{
  "recipes": [
    {
      "name": "Baked Italian Sausage and Peppers",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "lineCook",
        "sousChef"
      ],
      "cookTimeMinutes": 35,
      "description": "Sheet pan sausage with bell peppers and onions, tossed in olive oil and Italian herbs.",
      "ingredients": [
        "4 Italian sausages",
        "2 bell peppers, sliced",
        "1 yellow onion, sliced",
        "2 tbsp olive oil",
        "1 tsp Italian seasoning",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 400°F (200°C) and position a rack in the center. Line a large rimmed sheet pan with parchment paper or foil for easy cleanup.",
        "Cut the bell peppers into 1/2-inch strips, removing seeds and membranes. Slice the onion into 1/2-inch wedges, keeping some layers connected so they hold together during roasting.",
        "In a large bowl, toss the peppers and onions with olive oil, Italian seasoning, salt, and pepper until evenly coated. The vegetables should glisten but not be swimming in oil.",
        "Spread the vegetables in a single layer on the prepared sheet pan, leaving room for the sausages. Nestle the Italian sausages among the vegetables, leaving space around each for even browning.",
        "Pierce each sausage 2-3 times with a fork to prevent bursting and allow fat to render. This also helps the flavors meld with the vegetables.",
        "Roast for 25-30 minutes, flipping the sausages and stirring the vegetables halfway through. The sausages should be golden brown with an internal temperature of 165°F (74°C), and the peppers should have lightly charred edges.",
        "Let rest for 2-3 minutes before serving. Serve family-style straight from the pan with crusty Italian bread, over creamy polenta, or stuffed into hoagie rolls with a drizzle of balsamic glaze."
      ],
      "foodTags": [
        "pork"
      ],
      "imageName": "sausage-peppers",
      "cuisine": "italian"
    },
    {
      "name": "Chicken Tikka Masala",
      "isForFamily": false,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef",
        "executiveChef"
      ],
      "cookTimeMinutes": 45,
      "description": "Creamy tomato-based curry with marinated chicken, served over basmati rice.",
      "ingredients": [
        "1 lb chicken thighs, cubed",
        "1 cup plain yogurt",
        "2 tbsp garam masala",
        "1 tsp turmeric",
        "1 tsp cumin",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "1 tbsp grated ginger",
        "1 can (14 oz) tomato sauce",
        "1 cup heavy cream"
      ],
      "steps": [
        "Cut chicken thighs into 1.5-inch cubes, removing any excess fat. In a medium bowl, whisk together yogurt, 1 tbsp garam masala, turmeric, and cumin until smooth.",
        "Add the chicken to the marinade, toss to coat completely, cover with plastic wrap, and refrigerate for at least 30 minutes (or up to 24 hours for deeper, more complex flavor).",
        "Heat 2 tablespoons of oil in a large, deep skillet or Dutch oven over medium-high heat until shimmering. Remove chicken from marinade, shaking off excess, and sear in batches until golden brown on all sides, about 3-4 minutes per batch. Don't overcrowd the pan. Transfer to a plate.",
        "In the same pan, reduce heat to medium. Add the diced onion and cook until softened and golden at the edges, about 5-6 minutes, stirring occasionally and scraping up any browned bits from the chicken.",
        "Add the minced garlic and grated ginger to the onions. Cook for 1-2 minutes until very fragrant, stirring constantly to prevent burning. You'll smell the aromatics bloom.",
        "Pour in the tomato sauce and remaining 1 tbsp garam masala. Stir well to combine and bring to a gentle simmer. Let the sauce cook for 10-12 minutes, stirring occasionally, until it deepens in color and thickens slightly.",
        "Return the seared chicken pieces to the pan, nestling them into the sauce. Reduce heat to medium-low, cover, and simmer for 15-20 minutes until chicken is cooked through and very tender.",
        "Stir in the heavy cream and simmer uncovered for another 5 minutes, allowing the sauce to come together. Taste and adjust seasoning with salt as needed.",
        "Serve hot over fluffy basmati rice, garnished with fresh cilantro if desired. Warm naan bread on the side is essential for scooping up every drop of the creamy sauce."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "tikka-masala",
      "cuisine": "indian"
    },
    {
      "name": "Sheet Pan Veggie Tacos",
      "isForFamily": true,
      "dietTags": [
        "vegetarian",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 25,
      "description": "Roasted peppers, onions, and black beans served in warm tortillas.",
      "ingredients": [
        "2 bell peppers, sliced",
        "1 red onion, sliced",
        "1 can black beans, drained and rinsed",
        "2 tbsp olive oil",
        "1 tsp chili powder",
        "1 tsp cumin",
        "Corn tortillas"
      ],
      "steps": [
        "Preheat your oven to 425°F (220°C) and line a large sheet pan with parchment paper. Position the rack in the upper third of the oven for maximum caramelization.",
        "Cut the bell peppers into 1/2-inch strips and slice the red onion into thin half-moons. The pieces should be similar in size for even cooking.",
        "In a large bowl, combine the peppers, onion, and drained black beans. Drizzle with olive oil and sprinkle with chili powder, cumin, 1/2 teaspoon salt, and a pinch of pepper. Toss until everything is evenly coated.",
        "Spread the vegetables in a single layer on the prepared sheet pan. Avoid overcrowding—the vegetables need space to roast, not steam. Use two pans if needed.",
        "Roast for 15-20 minutes, stirring once halfway through, until the peppers are tender and have charred spots and the onions are caramelized and sweet.",
        "While the vegetables roast, warm your corn tortillas. Wrap them in foil and place in the oven for the last 5 minutes, or char them directly over a gas flame for extra flavor.",
        "To serve, spoon the roasted vegetables into warm tortillas. Top with your favorites: fresh salsa, crumbled queso fresco, sliced avocado, a squeeze of lime, and chopped cilantro."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "veggie-tacos",
      "cuisine": "mexican"
    },
    {
      "name": "Lemon Garlic Salmon with Roasted Broccoli",
      "isForFamily": false,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook",
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Roasted salmon fillets with lemon, garlic, and broccoli florets.",
      "ingredients": [
        "2 salmon fillets",
        "2 cups broccoli florets",
        "2 tbsp olive oil",
        "2 cloves garlic, minced",
        "1 lemon, sliced",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 400°F (200°C). Line a large sheet pan with parchment paper for easy cleanup. Remove salmon from the refrigerator 15 minutes before cooking to take the chill off.",
        "Cut broccoli into uniform florets (about 1.5 inches). In a bowl, toss the broccoli with 1 tablespoon olive oil, salt, and pepper until evenly coated.",
        "Pat the salmon fillets dry with paper towels—this is crucial for getting a nice sear. Season both sides generously with salt and pepper.",
        "Rub the salmon with the remaining olive oil and spread the minced garlic evenly over the top of each fillet, pressing gently so it adheres.",
        "Arrange the broccoli on one side of the sheet pan in a single layer. Place the salmon fillets skin-side down on the other side. Lay lemon slices over the salmon.",
        "Roast for 15-18 minutes until the salmon flakes easily with a fork and has an internal temperature of 125-130°F for medium (it will carry over cook). The broccoli should be tender with crispy, charred edges.",
        "Serve immediately, squeezing the roasted lemon slices over the salmon for extra brightness. The caramelized lemon adds a wonderful sweetness that balances the fish."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "lemon-salmon",
      "cuisine": "american"
    },
    {
      "name": "One-Pot Creamy Tuscan Chicken Pasta",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 35,
      "description": "Creamy pasta with chicken, spinach, and sun-dried tomatoes in one pot.",
      "ingredients": [
        "1 lb chicken breast, sliced",
        "8 oz short pasta",
        "2 cups chicken broth",
        "1 cup heavy cream",
        "1/2 cup sun-dried tomatoes, chopped",
        "2 cups baby spinach",
        "2 cloves garlic, minced"
      ],
      "steps": [
        "Slice chicken breasts horizontally into thin cutlets, then cut into 1-inch strips. Season generously with salt, pepper, and a pinch of Italian seasoning if you have it.",
        "Heat 2 tablespoons of olive oil in a large, deep skillet or Dutch oven over medium-high heat. Add the chicken in a single layer and cook until golden brown on both sides, about 3-4 minutes per side. Transfer to a plate.",
        "In the same pot, add a splash more oil if needed and sauté the minced garlic for 30 seconds until fragrant. Be careful not to let it burn—it should sizzle gently and smell amazing.",
        "Add the pasta, chicken broth, heavy cream, and sun-dried tomatoes to the pot. Stir to combine and bring to a boil. The liquid should just cover the pasta.",
        "Reduce heat to medium, cover with a lid slightly ajar, and simmer for 12-15 minutes, stirring occasionally, until the pasta is al dente and has absorbed most of the liquid. The sauce will thicken as it cooks.",
        "Return the chicken to the pot along with any accumulated juices. Add the baby spinach in handfuls, stirring after each addition until wilted. This only takes about 1-2 minutes.",
        "Taste and adjust seasoning with salt and pepper. If the sauce is too thick, add a splash of broth or pasta water. Serve immediately, topped with freshly grated parmesan cheese."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "tuscan-pasta",
      "cuisine": "italian"
    },
    {
      "name": "Black Bean & Sweet Potato Chili",
      "isForFamily": true,
      "dietTags": [
        "vegetarian",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 40,
      "description": "Hearty vegetarian chili with black beans and sweet potatoes.",
      "ingredients": [
        "1 large sweet potato, cubed",
        "1 can black beans, drained",
        "1 can diced tomatoes",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "2 tbsp chili powder",
        "1 tsp cumin",
        "2 cups vegetable broth"
      ],
      "steps": [
        "Peel the sweet potato and cut into 1/2-inch cubes. Uniform sizing ensures even cooking. Dice the onion and mince the garlic.",
        "Heat 2 tablespoons of olive oil in a large Dutch oven or heavy-bottomed pot over medium heat. Add the diced onion and cook until softened and translucent, about 4-5 minutes.",
        "Add the minced garlic and cook for another 30 seconds until fragrant. Stir in the chili powder and cumin, toasting the spices for about 1 minute. This blooms the spices and develops deeper flavor.",
        "Add the cubed sweet potato and stir to coat with the spiced onion mixture. Cook for 2-3 minutes, allowing the sweet potato to pick up some color on the edges.",
        "Pour in the diced tomatoes with their juices, drained black beans, and vegetable broth. Stir well to combine and bring to a boil.",
        "Reduce heat to medium-low and simmer, partially covered, for 25-30 minutes until the sweet potatoes are fork-tender but still hold their shape. Stir occasionally to prevent sticking.",
        "Taste and adjust seasoning with salt, pepper, and more chili powder if you like it spicier. The chili should be thick and hearty. Serve in deep bowls topped with sour cream, shredded cheese, diced avocado, and fresh cilantro."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "sweet-potato-chili",
      "cuisine": "american"
    },
    {
      "name": "Beef & Broccoli Stir Fry",
      "isForFamily": false,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 25,
      "description": "Quick stir fry with sliced beef, broccoli, and a savory sauce.",
      "ingredients": [
        "3/4 lb flank steak, sliced thin",
        "2 cups broccoli florets",
        "2 tbsp soy sauce",
        "1 tbsp oyster sauce",
        "1 tbsp cornstarch",
        "2 cloves garlic, minced",
        "1 tbsp vegetable oil"
      ],
      "steps": [
        "Slice the flank steak against the grain into thin 1/4-inch strips. This is crucial for tenderness. Partially freezing the steak for 20 minutes makes slicing easier.",
        "In a bowl, combine the beef strips with 1 tbsp soy sauce and cornstarch. Toss to coat evenly and let marinate for 10-15 minutes while you prep the other ingredients. The cornstarch helps create a velvety texture.",
        "Cut broccoli into bite-sized florets. Blanch in boiling water for 2 minutes, then immediately transfer to ice water to stop cooking. This ensures bright green, tender-crisp broccoli. Drain well.",
        "Heat a large wok or skillet over high heat until smoking. Add half the oil, then add the beef in a single layer. Let it sear undisturbed for 1 minute, then stir-fry until just browned, about 2 more minutes. Transfer to a plate.",
        "Add remaining oil to the wok. Toss in the garlic and stir for 10 seconds until fragrant. Add the blanched broccoli and stir-fry for 1-2 minutes.",
        "Return the beef to the wok. Add the remaining soy sauce and oyster sauce. Toss everything together over high heat for about 1 minute until the sauce coats the beef and broccoli evenly and becomes glossy.",
        "Serve immediately over steamed jasmine rice. The key to great stir-fry is high heat and quick cooking—everything should be slightly smoky and sizzling."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "beef-broccoli",
      "cuisine": "asian"
    },
    {
      "name": "Crispy Pork Carnitas Tacos",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 50,
      "description": "Slow-simmered pork crisped under the broiler and served in tortillas.",
      "ingredients": [
        "2 lbs pork shoulder, cubed",
        "1 onion, quartered",
        "2 cloves garlic",
        "1 orange, juiced",
        "1 tsp cumin",
        "1 tsp oregano",
        "Corn tortillas"
      ],
      "steps": [
        "Cut the pork shoulder into 2-inch cubes, leaving some fat on for flavor. Season generously with salt, cumin, and oregano, rubbing the spices into the meat.",
        "Place the seasoned pork in a Dutch oven or heavy pot. Add the quartered onion, whole garlic cloves, and fresh orange juice. Add just enough water to barely cover the meat, about 1-2 cups.",
        "Bring to a boil over high heat, then reduce to a gentle simmer. Cover and cook for 2-2.5 hours until the pork is fall-apart tender. The liquid will reduce and the pork will start to fry in its own rendered fat.",
        "Once tender, use two forks to shred the pork directly in the pot. Continue cooking uncovered until the liquid evaporates and the pork begins to crisp in the fat, stirring occasionally.",
        "For extra crispy edges, spread the shredded pork on a sheet pan in an even layer. Place under the broiler for 3-5 minutes, watching carefully, until the edges are golden and crispy. Toss and broil again if desired.",
        "Warm your corn tortillas over an open flame or in a dry skillet until pliable and slightly charred. Keep warm wrapped in a clean kitchen towel.",
        "Serve the crispy carnitas in warm tortillas topped with diced white onion, fresh cilantro, a squeeze of lime juice, and your favorite salsa verde or roja."
      ],
      "foodTags": [
        "pork"
      ],
      "imageName": "carnitas",
      "cuisine": "mexican"
    },
    {
      "name": "Margherita Flatbread Pizza",
      "isForFamily": false,
      "dietTags": [
        "vegetarian"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 20,
      "description": "Flatbread topped with tomato sauce, fresh mozzarella, and basil.",
      "ingredients": [
        "2 flatbreads",
        "1/2 cup tomato sauce",
        "4 oz fresh mozzarella, sliced",
        "Fresh basil leaves",
        "Olive oil"
      ],
      "steps": [
        "Preheat your oven to 425°F (220°C). If you have a pizza stone, place it in the oven while preheating for an extra crispy crust. Otherwise, use a sheet pan.",
        "Place flatbreads on your work surface. Brush the edges lightly with olive oil—this helps them crisp up and turn golden brown.",
        "Spread 1/4 cup of tomato sauce on each flatbread, leaving a 1/2-inch border around the edges. Use the back of a spoon in a circular motion for even coverage. Don't overload with sauce or the flatbread will get soggy.",
        "Tear or slice the fresh mozzarella into pieces and distribute evenly over the sauce. Fresh mozzarella has more moisture than shredded, so use slightly less than you think you need.",
        "Transfer the flatbreads to the preheated pizza stone or sheet pan. Bake for 8-10 minutes until the cheese is melted and bubbling with golden spots, and the edges are crispy and puffed.",
        "Remove from the oven and immediately scatter fresh basil leaves over the hot pizza. The residual heat will gently wilt them and release their aroma. Drizzle with high-quality extra virgin olive oil.",
        "Let cool for 1-2 minutes before slicing. Finish with a light sprinkle of flaky sea salt and a crack of black pepper if desired. Serve immediately while the cheese is still stretchy."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "margherita-pizza",
      "cuisine": "italian"
    },
    {
      "name": "Peanut Noodle Veggie Bowls",
      "isForFamily": false,
      "dietTags": [
        "vegan"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Rice noodles with a peanut sauce and crunchy veggies.",
      "ingredients": [
        "8 oz rice noodles",
        "1 red bell pepper, sliced",
        "1 cup shredded carrots",
        "1 cucumber, sliced",
        "1/3 cup peanut butter",
        "2 tbsp soy sauce",
        "1 tbsp lime juice",
        "1 tbsp maple syrup",
        "Water to thin"
      ],
      "steps": [
        "Bring a large pot of water to a boil. Cook rice noodles according to package directions—most require just 3-5 minutes in boiling water. Be careful not to overcook or they'll become mushy.",
        "While noodles cook, prepare the vegetables: slice the red bell pepper into thin strips, shred or julienne the carrots, and slice the cucumber into half-moons or thin matchsticks.",
        "Make the peanut sauce by whisking together peanut butter, soy sauce, lime juice, and maple syrup in a bowl. Add warm water 1 tablespoon at a time until you reach a pourable consistency—about 2-3 tablespoons. The sauce should coat a spoon but still flow.",
        "Drain the noodles and rinse under cold water to stop the cooking and remove excess starch. This also keeps them from sticking together. Shake off excess water.",
        "Transfer noodles to a large bowl. Pour about 2/3 of the peanut sauce over the noodles and toss thoroughly to coat every strand. Use tongs or two forks for best results.",
        "Divide the dressed noodles between serving bowls. Arrange the prepared vegetables on top in sections for a beautiful presentation. Drizzle with remaining sauce.",
        "Garnish with extra lime wedges for squeezing, chopped roasted peanuts for crunch, sliced green onions, and fresh cilantro. Serve cold or at room temperature—these noodles are great for meal prep."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "peanut-noodles",
      "cuisine": "asian"
    },
    {
      "name": "Shrimp Fried Rice",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Fried rice with shrimp, peas, carrots, and eggs.",
      "ingredients": [
        "3 cups cooked rice (day-old preferred)",
        "8 oz shrimp, peeled",
        "1/2 cup frozen peas and carrots",
        "2 eggs, beaten",
        "2 tbsp soy sauce",
        "2 tbsp vegetable oil",
        "2 green onions, sliced"
      ],
      "steps": [
        "Use day-old refrigerated rice for best results—freshly cooked rice is too moist and will turn mushy. If using fresh rice, spread it on a sheet pan and refrigerate uncovered for at least 1 hour.",
        "Heat 1 tablespoon oil in a large wok or skillet over high heat until smoking. Add the beaten eggs and scramble quickly, breaking them into small pieces as they cook—about 30-45 seconds. Transfer to a plate immediately.",
        "Add the shrimp to the hot wok in a single layer. Cook without stirring for 1 minute until pink on the bottom, then flip and cook 1 more minute until just cooked through. Transfer to the plate with the eggs. Don't overcook the shrimp.",
        "Add the remaining tablespoon of oil to the wok. Add the cold rice, breaking up any clumps with your spatula. Let it sit for 30 seconds to crisp up on the bottom, then stir. Repeat this process several times to get slightly crispy rice.",
        "Add the frozen peas and carrots directly to the rice. The heat will thaw and cook them quickly. Stir-fry for 1-2 minutes until heated through.",
        "Push the rice to the sides of the wok and add the soy sauce to the center. Let it sizzle for a few seconds, then toss everything together to distribute the sauce evenly.",
        "Return the eggs and shrimp to the wok. Add the sliced green onions (reserving some for garnish). Toss everything together for another 30 seconds until heated through. Serve immediately in warm bowls, garnished with remaining green onions."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "shrimp-fried-rice",
      "cuisine": "asian"
    },
    {
      "name": "BBQ Chicken Sheet Pan Dinner",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 35,
      "description": "BBQ chicken thighs roasted with potatoes and green beans.",
      "ingredients": [
        "6 chicken thighs",
        "1/2 cup BBQ sauce",
        "1 lb baby potatoes, halved",
        "2 cups green beans, trimmed",
        "2 tbsp olive oil",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 400°F (200°C). Line a large sheet pan with foil for easy cleanup—the BBQ sauce will caramelize and can stick.",
        "Halve the baby potatoes and trim the ends off the green beans. In a large bowl, toss the potatoes and green beans with olive oil, salt, and pepper until evenly coated.",
        "Pat the chicken thighs dry with paper towels. Season both sides generously with salt and pepper. Dry skin is essential for achieving crispy skin in the oven.",
        "Spread the potatoes and green beans on the sheet pan in a single layer, leaving space in the center for the chicken. Place the chicken thighs skin-side up on the pan.",
        "Roast for 15 minutes to get the cooking started and begin rendering the chicken fat. The skin should be starting to look golden.",
        "Remove the pan from the oven and brush the chicken thighs generously with BBQ sauce—use about half the sauce. Return to the oven and roast for another 15-20 minutes.",
        "The chicken is done when it reaches an internal temperature of 165°F and the juices run clear. The BBQ sauce should be caramelized and sticky, with slightly charred edges.",
        "Let rest for 5 minutes before serving. Brush with remaining BBQ sauce if desired. The potatoes should be golden and crispy, and the green beans tender with some char."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "bbq-chicken",
      "cuisine": "american"
    },
    {
      "name": "Veggie Frittata",
      "isForFamily": false,
      "dietTags": [
        "vegetarian",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 25,
      "description": "Egg-based frittata with spinach, peppers, and cheese.",
      "ingredients": [
        "6 eggs",
        "1/2 cup shredded cheese",
        "1 cup spinach",
        "1/2 red bell pepper, diced",
        "1/4 cup milk",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 375°F (190°C). Use a 10-inch oven-safe skillet—cast iron works beautifully for frittatas and helps create a golden crust.",
        "Crack the eggs into a large bowl. Add the milk, 1/2 teaspoon salt, and a few grinds of black pepper. Whisk vigorously until the eggs are completely uniform in color with no streaks of white.",
        "Fold the spinach, diced bell pepper, and most of the cheese (reserve 2 tablespoons) into the egg mixture. The spinach will wilt during cooking, so don't worry if it looks like a lot.",
        "Heat 1 tablespoon of butter or olive oil in your oven-safe skillet over medium heat. Swirl to coat the bottom and sides of the pan.",
        "Pour the egg mixture into the warm skillet. Let it cook undisturbed for 2-3 minutes until the edges are starting to set but the center is still quite wet. Gently lift the edges with a spatula to let uncooked egg flow underneath.",
        "Sprinkle the reserved cheese over the top. Transfer the skillet to the preheated oven and bake for 12-15 minutes until the frittata is puffed, golden on top, and set in the center. It should jiggle slightly when shaken.",
        "Let cool in the pan for 3-4 minutes before slicing—this makes it easier to cut clean wedges. Serve warm or at room temperature. Frittata also makes excellent leftovers and is great cold in sandwiches."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "frittata",
      "cuisine": "italian"
    },
    {
      "name": "Lentil Bolognese over Pasta",
      "isForFamily": true,
      "dietTags": [
        "vegan"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 40,
      "description": "Hearty tomato sauce with lentils served over pasta.",
      "ingredients": [
        "1 cup dry lentils",
        "1 jar marinara sauce",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "2 tbsp olive oil",
        "8 oz pasta"
      ],
      "steps": [
        "Rinse the lentils under cold water, picking out any debris or damaged lentils. Use brown or green lentils—they hold their shape better than red lentils during cooking.",
        "Place lentils in a saucepan and cover with 3 cups of water. Bring to a boil, then reduce heat and simmer for 20-25 minutes until tender but not mushy. Drain and set aside.",
        "While lentils cook, heat olive oil in a large skillet or Dutch oven over medium heat. Add the diced onion and cook until soft and translucent, about 5-6 minutes, stirring occasionally.",
        "Add the minced garlic and cook for 1 minute until fragrant. Add a pinch of red pepper flakes if you like a little heat.",
        "Pour in the marinara sauce and stir to combine with the aromatics. Add the cooked lentils and stir well. Simmer for 10-15 minutes, allowing the flavors to meld together. Add a splash of water if the sauce becomes too thick.",
        "Meanwhile, bring a large pot of salted water to a boil. Cook your pasta according to package directions until al dente. Reserve 1/2 cup pasta water before draining.",
        "Taste the lentil bolognese and adjust seasoning with salt, pepper, and a pinch of sugar if the sauce is too acidic. Toss the pasta with the sauce, adding a splash of pasta water if needed to loosen.",
        "Serve in warm bowls topped with nutritional yeast or vegan parmesan and fresh basil leaves. A drizzle of good olive oil finishes the dish beautifully."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "lentil-bolognese",
      "cuisine": "italian"
    },
    {
      "name": "Teriyaki Tofu Rice Bowls",
      "isForFamily": false,
      "dietTags": [
        "vegan",
        "glutenFree"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Crispy tofu with teriyaki sauce over rice and steamed veggies.",
      "ingredients": [
        "1 block extra-firm tofu, cubed",
        "2 tbsp cornstarch",
        "2 tbsp soy or tamari sauce",
        "2 tbsp teriyaki sauce",
        "2 cups cooked rice",
        "2 cups steamed broccoli"
      ],
      "steps": [
        "Press the tofu to remove excess moisture: wrap the block in paper towels or a clean kitchen towel, place on a plate, and set something heavy on top (like a cast iron skillet). Press for at least 15 minutes, changing towels if needed.",
        "Cut the pressed tofu into 3/4-inch cubes. Place in a bowl and toss with soy sauce, letting the tofu absorb the liquid for 5 minutes.",
        "Add the cornstarch to the tofu and toss gently until every piece is evenly coated. The cornstarch is the secret to achieving crispy edges.",
        "Heat 2-3 tablespoons of vegetable oil in a large non-stick skillet over medium-high heat. Add the tofu in a single layer—don't overcrowd or it will steam instead of crisp.",
        "Cook the tofu undisturbed for 3-4 minutes until golden and crispy on the bottom. Flip and continue cooking, turning occasionally, until all sides are crispy, about 8-10 minutes total.",
        "Reduce heat to medium-low and drizzle the teriyaki sauce over the tofu. Toss gently to coat, letting the sauce glaze the tofu for about 1 minute. It should be sticky and caramelized.",
        "Assemble the bowls: place a mound of steamed rice in each bowl, add steamed broccoli on one side, and pile the teriyaki tofu on the other. Drizzle any remaining sauce from the pan over the bowl.",
        "Garnish with sesame seeds, sliced green onions, and a sprinkle of chili flakes if you like heat. Serve immediately while the tofu is still crispy."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "teriyaki-tofu",
      "cuisine": "asian"
    },
    {
      "name": "Greek Chicken Bowls",
      "isForFamily": false,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook",
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Bowls with marinated chicken, cucumbers, tomatoes, and feta over rice.",
      "ingredients": [
        "1 lb chicken breast, cubed",
        "1/4 cup olive oil",
        "Juice of 1 lemon",
        "1 tsp oregano",
        "2 cups cooked rice",
        "1 cucumber, chopped",
        "1 cup cherry tomatoes, halved",
        "1/2 cup feta cheese"
      ],
      "steps": [
        "Cut the chicken breasts into 1-inch cubes. In a bowl, whisk together the olive oil, lemon juice, oregano, 1/2 teaspoon salt, and pepper to create the marinade.",
        "Add the chicken to the marinade, toss to coat completely, and let it sit for at least 15 minutes at room temperature, or up to 2 hours in the refrigerator for more flavor.",
        "While chicken marinates, prep your vegetables: dice the cucumber into 1/2-inch pieces, halve the cherry tomatoes, and crumble the feta cheese. Set aside.",
        "Heat a large skillet over medium-high heat. Remove chicken from marinade, shaking off excess, and add to the hot pan in a single layer. Cook undisturbed for 3-4 minutes until golden brown on the bottom.",
        "Flip the chicken pieces and continue cooking for another 3-4 minutes until cooked through and nicely browned on all sides. The internal temperature should reach 165°F. Let rest for 2 minutes.",
        "To assemble the bowls: start with a base of warm rice. Arrange the cucumber and tomatoes on one side of the bowl. Place the cooked chicken on the other side.",
        "Top with crumbled feta cheese and a drizzle of extra olive oil. Add a dollop of tzatziki sauce or hummus if desired. Garnish with fresh dill or parsley and a lemon wedge for squeezing."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "greek-chicken",
      "cuisine": "mediterranean"
    },
    {
      "name": "Slow Cooker Beef Stew",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 480,
      "description": "Comforting beef stew with potatoes, carrots, and onions.",
      "ingredients": [
        "2 lbs stew beef, cubed",
        "4 carrots, sliced",
        "4 potatoes, cubed",
        "1 onion, chopped",
        "3 cups beef broth",
        "2 tbsp tomato paste",
        "1 tsp thyme",
        "Salt & pepper"
      ],
      "steps": [
        "Cut the stew beef into 1.5-inch cubes if not already cut. Pat dry with paper towels and season generously with salt and pepper on all sides.",
        "Optional but recommended: sear the beef before slow cooking. Heat oil in a skillet over high heat and brown the beef in batches until a crust forms, about 2 minutes per side. This adds incredible depth of flavor.",
        "Prepare the vegetables: peel and cut potatoes into 1-inch cubes, slice carrots into 1/2-inch rounds, and roughly chop the onion. Larger cuts prevent the vegetables from turning to mush during the long cook.",
        "Layer the vegetables in the bottom of your slow cooker—this puts them closest to the heat source and ensures they cook through properly.",
        "Place the beef on top of the vegetables. In a bowl, whisk together the beef broth, tomato paste, and thyme until combined. Pour this mixture over everything in the slow cooker.",
        "Cover and cook on LOW for 8 hours or HIGH for 4-5 hours. The stew is ready when the beef is fork-tender and practically falls apart, and the vegetables are soft but still hold their shape.",
        "In the last 30 minutes, taste and adjust seasoning. If you want a thicker stew, mix 2 tablespoons cornstarch with 2 tablespoons cold water and stir it in, cooking on HIGH uncovered for the remaining time.",
        "Serve in deep bowls with crusty bread for sopping up the rich broth. Garnish with fresh parsley. This stew tastes even better the next day as the flavors continue to meld."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "beef-stew",
      "cuisine": "american"
    },
    {
      "name": "Fish Taco Bowls",
      "isForFamily": false,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 25,
      "description": "Seasoned fish over rice with slaw and lime crema.",
      "ingredients": [
        "3/4 lb white fish fillets",
        "1 tsp chili powder",
        "1 tsp cumin",
        "2 cups cooked rice",
        "1 cup shredded cabbage",
        "1/4 cup sour cream",
        "Juice of 1 lime"
      ],
      "steps": [
        "Pat the fish fillets dry with paper towels. Mix together the chili powder, cumin, 1/2 teaspoon salt, and a pinch of pepper. Rub this spice mixture evenly over both sides of the fish.",
        "For the lime crema, whisk together the sour cream with the juice of half the lime and a pinch of salt. Thin with a little water if needed to reach a drizzling consistency. Taste and adjust lime to your preference.",
        "Make a quick slaw by tossing the shredded cabbage with the juice from the remaining lime half, a drizzle of olive oil, and a pinch of salt. Let it sit while you cook the fish to slightly soften and absorb the dressing.",
        "Heat 1 tablespoon of oil in a skillet over medium-high heat. Once hot, add the fish fillets. Cook for 3-4 minutes per side depending on thickness, until the fish flakes easily with a fork and is opaque throughout.",
        "Alternatively, bake the fish at 400°F for 12-15 minutes on a parchment-lined sheet pan for a hands-off approach.",
        "Break the cooked fish into large flaky chunks. Build your bowls: start with a base of warm rice, add a pile of lime slaw on one side, and arrange the flaked fish on top.",
        "Drizzle generously with lime crema. Add your favorite toppings: diced avocado, pickled jalapeños, fresh cilantro, pico de gallo, or a sprinkle of cotija cheese. Serve with extra lime wedges."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "fish-tacos",
      "cuisine": "mexican"
    },
    {
      "name": "Chickpea Coconut Curry",
      "isForFamily": true,
      "dietTags": [
        "vegan",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 30,
      "description": "Creamy curry with chickpeas and spinach in coconut milk.",
      "ingredients": [
        "1 can chickpeas, drained",
        "1 can coconut milk",
        "1 onion, diced",
        "2 tbsp curry powder",
        "2 cups baby spinach",
        "1 tbsp oil"
      ],
      "steps": [
        "Drain and rinse the chickpeas. Pat them dry if you want them to crisp up slightly in the curry. Dice the onion finely for faster cooking and better texture in the sauce.",
        "Heat the oil in a large skillet or Dutch oven over medium heat. Add the diced onion and cook until soft and starting to turn golden, about 5-6 minutes. Stir occasionally to prevent burning.",
        "Add the curry powder to the onions and stir constantly for 1 minute. This toasting step is crucial—it awakens the spices and removes any raw, powdery taste. You should smell the spices blooming.",
        "Pour in the coconut milk, stirring to scrape up any spices stuck to the bottom of the pan. Shake the can well before opening, and use full-fat coconut milk for the creamiest result.",
        "Add the chickpeas and stir to combine. Bring to a gentle simmer and cook for 10-15 minutes, allowing the chickpeas to absorb the curry flavors and the sauce to thicken slightly.",
        "Add the baby spinach in handfuls, stirring after each addition until wilted. This only takes 1-2 minutes. The spinach adds color, nutrients, and freshness to balance the rich curry.",
        "Taste and season with salt, pepper, and a squeeze of lime juice to brighten the flavors. If you like it spicier, add a pinch of cayenne or some chili flakes.",
        "Serve over basmati rice or with warm naan bread for scooping. Garnish with fresh cilantro and a drizzle of coconut cream for an extra luxurious finish."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "chickpea-curry",
      "cuisine": "indian"
    },
    {
      "name": "Beef Meatballs with Zoodles",
      "isForFamily": false,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 35,
      "description": "Oven-baked beef meatballs served over zucchini noodles and marinara.",
      "ingredients": [
        "1 lb ground beef",
        "1 egg",
        "1/4 cup breadcrumbs (or GF crumbs)",
        "1 tsp Italian seasoning",
        "2 zucchinis, spiralized",
        "1 jar marinara sauce"
      ],
      "steps": [
        "Preheat your oven to 400°F (200°C). Line a sheet pan with parchment paper and lightly grease it or spray with cooking spray.",
        "In a large bowl, combine the ground beef, egg, breadcrumbs, Italian seasoning, 1/2 teaspoon salt, and a few grinds of pepper. Mix with your hands until just combined—don't overmix or the meatballs will be dense.",
        "Using a small ice cream scoop or your hands, form the mixture into 12-14 meatballs, about 1.5 inches in diameter. Roll them between your palms to make them round and place them on the prepared pan with space between each.",
        "Bake for 15-20 minutes until the meatballs are cooked through and browned on the outside. The internal temperature should reach 160°F. They'll continue cooking slightly after removing from the oven.",
        "While meatballs bake, spiralize the zucchini into noodles. If you don't have a spiralizer, use a vegetable peeler to make wide ribbons or julienne cut into thin strips.",
        "Warm the marinara sauce in a large skillet over medium heat. Add the zucchini noodles and toss gently with the sauce for 2-3 minutes until just warmed through and slightly softened. Don't overcook or they'll release water and become soggy.",
        "Divide the zoodles between serving bowls. Top with the baked meatballs and spoon extra sauce over the top. Garnish with fresh basil, grated parmesan (if not dairy-free), and a drizzle of olive oil."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "meatballs-zoodles",
      "cuisine": "american"
    },
    {
      "name": "Honey Garlic Glazed Salmon",
      "isForFamily": false,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 25,
      "description": "Pan-seared salmon with a sticky honey garlic glaze, served with steamed asparagus.",
      "ingredients": [
        "2 salmon fillets",
        "3 tbsp honey",
        "2 tbsp soy sauce",
        "3 cloves garlic, minced",
        "1 tbsp butter",
        "1 bunch asparagus",
        "Salt & pepper"
      ],
      "steps": [
        "Remove salmon from the refrigerator 15 minutes before cooking. Pat the fillets completely dry with paper towels—this is essential for achieving a crispy sear. Season both sides with salt and pepper.",
        "In a small bowl, whisk together the honey, soy sauce, and minced garlic. Set this glaze aside.",
        "Trim the woody ends off the asparagus by snapping them naturally—they'll break where the tender part begins. Steam or blanch in salted boiling water for 3-4 minutes until bright green and tender-crisp. Keep warm.",
        "Heat 1 tablespoon of oil in a large skillet over medium-high heat until it shimmers. Place the salmon skin-side up (flesh-side down) in the pan. Don't move it—let it sear undisturbed for 4 minutes.",
        "Flip the salmon so it's skin-side down. The flesh should have a beautiful golden crust. Cook for another 2 minutes.",
        "Reduce heat to medium-low. Add the butter to the pan, letting it melt. Pour the honey garlic glaze into the pan around the salmon. It will bubble immediately.",
        "Tilt the pan and use a spoon to continuously baste the salmon with the bubbling glaze for 2-3 minutes. The glaze will thicken and become sticky, and the salmon should reach an internal temp of 125-130°F for medium.",
        "Serve the salmon over the steamed asparagus, spooning the remaining glaze from the pan over everything. Garnish with sesame seeds and thinly sliced green onions."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "honey-garlic-salmon",
      "cuisine": "asian"
    },
    {
      "name": "Classic Beef Tacos",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 30,
      "description": "Seasoned ground beef in crispy taco shells with all the fixings.",
      "ingredients": [
        "1 lb ground beef",
        "1 packet taco seasoning (or 2 tbsp homemade)",
        "8 taco shells",
        "1 cup shredded cheese",
        "1 cup shredded lettuce",
        "1 tomato, diced",
        "Sour cream",
        "Salsa"
      ],
      "steps": [
        "Heat a large skillet over medium-high heat. Add the ground beef, breaking it apart with a wooden spoon or spatula as it cooks. Continue cooking until browned throughout, about 6-8 minutes.",
        "Drain excess fat from the pan by carefully tilting and spooning it out, or transfer beef to a colander briefly. Return beef to the skillet.",
        "Sprinkle the taco seasoning over the beef. Add 1/4 cup water and stir to combine. Simmer for 3-5 minutes until the water has evaporated and the seasoning coats the meat evenly.",
        "While the meat simmers, prep your toppings: shred the lettuce, dice the tomato, and set out the cheese, sour cream, and salsa in serving bowls for a taco bar setup.",
        "Warm the taco shells according to package directions. For crispy shells, place them directly on the oven rack at 325°F for 5 minutes. For soft tacos, warm tortillas in a dry skillet or over an open flame.",
        "Set up your taco station: place the seasoned beef in a serving bowl, arrange all the toppings within easy reach, and let everyone build their own tacos.",
        "To assemble: add a generous spoonful of beef to each shell, then layer with cheese (so it melts slightly from the heat), lettuce, tomatoes, a dollop of sour cream, and salsa. Squeeze fresh lime juice over the top if desired."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "beef-tacos",
      "cuisine": "mexican"
    },
    {
      "name": "Mushroom Risotto",
      "isForFamily": false,
      "dietTags": [
        "vegetarian",
        "glutenFree"
      ],
      "chefLevels": [
        "executiveChef"
      ],
      "cookTimeMinutes": 45,
      "description": "Creamy Italian risotto with sautéed mushrooms and parmesan cheese.",
      "ingredients": [
        "1 cup Arborio rice",
        "8 oz mixed mushrooms, sliced",
        "4 cups vegetable broth, warm",
        "1/2 cup white wine",
        "1/2 cup grated parmesan",
        "1 shallot, minced",
        "2 tbsp butter",
        "2 tbsp olive oil",
        "Fresh thyme"
      ],
      "steps": [
        "Heat the vegetable broth in a saucepan and keep it warm over low heat. Using warm broth is essential—cold broth will shock the rice and make the risotto gummy.",
        "In a separate large, wide skillet, melt 1 tbsp butter over medium-high heat. Add the sliced mushrooms in a single layer. Don't stir for 2-3 minutes to allow them to develop a golden brown crust. Flip and brown the other side. Season with salt and pepper, transfer to a plate.",
        "In the same skillet, heat the olive oil over medium heat. Add the minced shallot and cook until soft and translucent, about 2-3 minutes, stirring frequently.",
        "Add the Arborio rice to the shallot and stir constantly for 2 minutes. The rice should be coated in oil and become slightly translucent around the edges. This toasting step is important for texture.",
        "Pour in the white wine and stir until it's completely absorbed by the rice. You should be able to see the bottom of the pan when you drag your spoon through.",
        "Begin adding the warm broth one ladle (about 1/2 cup) at a time, stirring frequently. Wait until each addition is mostly absorbed before adding the next. This gradual process takes about 18-22 minutes and creates the creamy texture.",
        "The risotto is done when the rice is tender but still has a slight bite (al dente) and the consistency is creamy and flows slowly when you tilt the pan. It should not be gluey or dry.",
        "Remove from heat and stir in the remaining butter, parmesan cheese, and the sautéed mushrooms. Season to taste with salt and pepper. The butter and cheese add final creaminess (this is called mantecatura).",
        "Serve immediately in warm shallow bowls—risotto waits for no one! Garnish with fresh thyme leaves, extra parmesan, and a drizzle of truffle oil if you're feeling fancy."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "mushroom-risotto",
      "cuisine": "italian"
    },
    {
      "name": "Baked Ziti with Sausage",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 50,
      "description": "Hearty baked pasta with Italian sausage, ricotta, and melted mozzarella.",
      "ingredients": [
        "1 lb ziti pasta",
        "1 lb Italian sausage",
        "1 jar marinara sauce (24 oz)",
        "1 cup ricotta cheese",
        "2 cups shredded mozzarella",
        "1/2 cup grated parmesan",
        "Fresh basil"
      ],
      "steps": [
        "Preheat your oven to 375°F (190°C). Bring a large pot of generously salted water to a boil for the pasta.",
        "Cook the ziti according to package directions, but stop 2 minutes early—it should be very al dente since it will continue cooking in the oven. Drain and set aside.",
        "While pasta cooks, remove the sausage from its casing if necessary. Brown the sausage in a large skillet over medium-high heat, breaking it into bite-sized pieces with a wooden spoon. Cook until no pink remains, about 8-10 minutes.",
        "Add the marinara sauce to the sausage and stir to combine. Simmer for 5 minutes to let the flavors meld. Taste and adjust seasoning with salt, pepper, or red pepper flakes.",
        "In a large bowl, combine the cooked pasta with 3/4 of the sauce mixture and the ricotta cheese. Stir gently until everything is evenly distributed and the ricotta creates creamy pockets throughout.",
        "Pour half of the pasta mixture into a 9x13 inch baking dish. Sprinkle with half the mozzarella. Add the remaining pasta and top with remaining sauce from the pan.",
        "Cover with the rest of the mozzarella and sprinkle the parmesan evenly over the top. Cover loosely with foil.",
        "Bake covered for 20 minutes, then remove the foil and bake for another 10-15 minutes until the cheese is melted, bubbly, and golden brown in spots.",
        "Let rest for 5 minutes before serving—this allows the dish to set and makes it easier to portion. Garnish with torn fresh basil leaves and serve with garlic bread."
      ],
      "foodTags": [
        "pork"
      ],
      "imageName": "baked-ziti",
      "cuisine": "italian"
    },
    {
      "name": "Thai Basil Chicken",
      "isForFamily": false,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 20,
      "description": "Spicy stir-fried ground chicken with Thai basil and a fried egg over rice.",
      "ingredients": [
        "1 lb ground chicken",
        "4 cloves garlic, minced",
        "2 Thai chilies, sliced (or 1 tsp chili flakes)",
        "2 tbsp soy sauce",
        "1 tbsp fish sauce",
        "1 tbsp oyster sauce",
        "1 tsp sugar",
        "1 cup fresh Thai basil leaves",
        "2 eggs",
        "Jasmine rice"
      ],
      "steps": [
        "Start your jasmine rice first—rinse 1 cup rice until water runs clear, then cook with 1.25 cups water. The rice will be ready by the time your chicken is done. Keep covered until serving.",
        "Mix together the soy sauce, fish sauce, oyster sauce, and sugar in a small bowl. Set this sauce near your stove—Thai cooking goes fast and you'll need everything ready.",
        "Heat a wok or large skillet over high heat until smoking. Add 2 tablespoons of oil. When the oil shimmers, add the minced garlic and sliced Thai chilies. Stir-fry for just 10-15 seconds—watch carefully as garlic burns quickly.",
        "Immediately add the ground chicken, breaking it apart with your spatula. Let it sit undisturbed for 30 seconds to get some browning, then stir and continue cooking until no pink remains, about 3-4 minutes.",
        "Pour the sauce mixture over the chicken. Toss everything together over high heat for another minute, allowing the sauce to coat the meat and reduce slightly.",
        "Remove the wok from heat and immediately toss in the Thai basil leaves. Stir just until they begin to wilt—they should still be bright green and fragrant, not completely wilted. The residual heat is enough.",
        "In a separate small pan, fry the eggs in a little oil until the whites are set but the yolks are still runny. Crispy edges are traditional and delicious.",
        "Serve immediately: mound the jasmine rice in bowls, spoon the Thai basil chicken alongside, and top with a fried egg. Break the yolk and let it run into the chicken. Have extra fish sauce and chili flakes at the table."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "thai-basil-chicken",
      "cuisine": "asian"
    },
    {
      "name": "Stuffed Bell Peppers",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 45,
      "description": "Bell peppers stuffed with seasoned beef, rice, and topped with melted cheese.",
      "ingredients": [
        "4 large bell peppers",
        "1 lb ground beef",
        "1 cup cooked rice",
        "1 can diced tomatoes",
        "1 cup shredded cheddar cheese",
        "1 tsp Italian seasoning",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 375°F (190°C). Select bell peppers that can stand upright on their own—look for ones with flat bottoms.",
        "Cut the tops off the peppers about 1/2 inch down. Remove the seeds and membranes inside. If the peppers won't stand upright, shave a tiny bit off the bottom to create a flat surface, being careful not to cut through.",
        "Bring a large pot of salted water to a boil. Blanch the pepper shells for 3-4 minutes until slightly softened but still holding their shape. This pre-cooking ensures they'll be perfectly tender when done. Drain upside down on paper towels.",
        "In a large skillet, brown the ground beef over medium-high heat, breaking it into small pieces. Drain any excess fat. Add the Italian seasoning, salt, and pepper.",
        "Add the cooked rice and half the can of diced tomatoes (drained) to the beef. Stir in half the cheese. Mix until well combined. Taste and adjust seasoning.",
        "Stand the blanched peppers in a baking dish. Spoon the beef and rice mixture into each pepper, packing it down gently and mounding it slightly on top.",
        "Pour the remaining diced tomatoes around the base of the peppers. This creates steam and adds flavor. Cover the dish tightly with aluminum foil.",
        "Bake covered for 25-30 minutes. Remove the foil, top each pepper with the remaining cheese, and bake uncovered for 10-15 more minutes until the cheese is melted and bubbly.",
        "Let rest for 5 minutes before serving. Spoon the tomato sauce from the dish over the peppers. Garnish with fresh parsley or basil."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "stuffed-peppers",
      "cuisine": "american"
    },
    {
      "name": "Coconut Shrimp with Mango Salsa",
      "isForFamily": false,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Crispy coconut-crusted shrimp served with fresh mango salsa.",
      "ingredients": [
        "1 lb large shrimp, peeled and deveined",
        "1 cup shredded coconut",
        "1/2 cup panko breadcrumbs",
        "1/2 cup flour",
        "2 eggs, beaten",
        "1 ripe mango, diced",
        "1/4 red onion, diced",
        "1 jalapeño, minced",
        "Juice of 1 lime",
        "Fresh cilantro"
      ],
      "steps": [
        "Preheat your oven to 425°F (220°C). Line a baking sheet with parchment paper and place a wire rack on top if you have one—this helps the shrimp crisp up on all sides.",
        "Make the mango salsa: combine the diced mango, red onion, minced jalapeño (remove seeds for less heat), lime juice, and chopped cilantro in a bowl. Season with a pinch of salt. Refrigerate while you prepare the shrimp.",
        "Set up a breading station with three shallow bowls: flour seasoned with salt and pepper in the first, beaten eggs in the second, and the coconut mixed with panko in the third.",
        "Pat the shrimp dry with paper towels—this is crucial for the coating to stick. Working one at a time, dredge shrimp in flour, shaking off excess.",
        "Dip the floured shrimp in the beaten egg, letting excess drip off. Press the shrimp firmly into the coconut-panko mixture, turning to coat all sides completely.",
        "Arrange the breaded shrimp in a single layer on the prepared baking sheet. Lightly spray or mist with cooking oil for extra crispiness.",
        "Bake for 12-15 minutes, flipping halfway through, until the coconut is golden brown and the shrimp are pink and cooked through. Watch carefully as coconut can burn quickly.",
        "Serve the hot coconut shrimp immediately with the chilled mango salsa on the side for dipping. The contrast of hot, crispy shrimp with cool, tangy salsa is incredible. Add lime wedges for an extra squeeze of brightness."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "coconut-shrimp",
      "cuisine": "asian"
    },
    {
      "name": "Vegan Buddha Bowl",
      "isForFamily": false,
      "dietTags": [
        "vegan",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 25,
      "description": "Nourishing bowl with quinoa, roasted chickpeas, avocado, and tahini drizzle.",
      "ingredients": [
        "1 cup quinoa",
        "1 can chickpeas, drained",
        "1 avocado, sliced",
        "1 cup shredded purple cabbage",
        "1 cup shredded carrots",
        "2 tbsp tahini",
        "1 tbsp lemon juice",
        "1 tsp cumin",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 400°F (200°C). Rinse the quinoa under cold water to remove the bitter outer coating. Cook according to package directions (usually 1 cup quinoa to 2 cups water, simmered for 15 minutes). Fluff with a fork and set aside.",
        "Drain and rinse the chickpeas, then pat them very dry with paper towels or a clean kitchen towel. Wet chickpeas won't crisp up properly. Removing the skins (optional) makes them extra crispy.",
        "Toss the chickpeas with 1 tablespoon oil, cumin, salt, and pepper. Spread in a single layer on a baking sheet—don't overcrowd them.",
        "Roast the chickpeas for 25-30 minutes, shaking the pan halfway through, until they're golden brown and crispy. They'll continue to crisp as they cool.",
        "While the chickpeas roast, make the tahini dressing: whisk together the tahini, lemon juice, 2-3 tablespoons of water, a pinch of salt, and a small clove of minced garlic if desired. It should be pourable—add more water if needed.",
        "Prep your vegetables: thinly slice or shred the purple cabbage, shred the carrots, and slice the avocado right before serving to prevent browning.",
        "Assemble the bowls: start with a base of quinoa, then arrange sections of purple cabbage, carrots, sliced avocado, and a generous pile of crispy chickpeas.",
        "Drizzle the tahini dressing over everything. Top with additional toppings like sesame seeds, microgreens, hemp hearts, or pickled vegetables. Serve immediately while the chickpeas are still warm and crispy."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "buddha-bowl",
      "cuisine": "mediterranean"
    },
    {
      "name": "Pulled Pork Sandwiches",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 480,
      "description": "Slow cooker pulled pork with tangy coleslaw on soft brioche buns.",
      "ingredients": [
        "3 lb pork shoulder",
        "1 cup BBQ sauce",
        "1/2 cup apple cider vinegar",
        "1 tbsp brown sugar",
        "1 tsp smoked paprika",
        "4 cups coleslaw mix",
        "1/4 cup mayonnaise",
        "Brioche buns"
      ],
      "steps": [
        "Pat the pork shoulder dry and create a dry rub by mixing smoked paprika, 1 tablespoon brown sugar, 1 teaspoon salt, 1/2 teaspoon black pepper, and a pinch of cayenne. Rub this mixture all over the pork, getting into all the crevices.",
        "Place the seasoned pork in your slow cooker. Pour the apple cider vinegar around (not over) the meat—this helps keep it moist and adds tangy flavor. No need to add extra liquid; the pork will release its juices.",
        "Cover and cook on LOW for 8-10 hours or HIGH for 5-6 hours. The pork is ready when it's fall-apart tender and shreds easily with two forks. Internal temperature should reach 195-205°F.",
        "Carefully transfer the pork to a cutting board. Discard any large pieces of fat. Using two forks, shred the meat, pulling it apart into long strands.",
        "Pour out most of the cooking liquid from the slow cooker, reserving about 1/2 cup. Return the shredded pork to the slow cooker. Add the BBQ sauce and reserved cooking liquid. Stir to combine and keep on warm setting until ready to serve.",
        "Make the tangy coleslaw: toss the coleslaw mix with mayonnaise, 2 tablespoons apple cider vinegar, 1 teaspoon sugar, salt, and pepper. Taste and adjust—it should be tangy and slightly sweet. Refrigerate until serving.",
        "Toast the brioche buns lightly under the broiler or in a dry skillet until golden brown. This adds texture and prevents them from getting soggy.",
        "Build your sandwiches: pile the pulled pork generously on the bottom bun, top with a heap of tangy coleslaw, and close with the top bun. Serve with extra BBQ sauce on the side and plenty of napkins!"
      ],
      "foodTags": [
        "pork"
      ],
      "imageName": "pulled-pork",
      "cuisine": "american"
    },
    {
      "name": "Eggplant Parmesan",
      "isForFamily": false,
      "dietTags": [
        "vegetarian"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 50,
      "description": "Breaded eggplant slices baked with marinara and melted mozzarella.",
      "ingredients": [
        "1 large eggplant, sliced 1/2 inch thick",
        "1 cup breadcrumbs",
        "1/2 cup grated parmesan",
        "2 eggs, beaten",
        "2 cups marinara sauce",
        "1 1/2 cups shredded mozzarella",
        "Fresh basil"
      ],
      "steps": [
        "Slice the eggplant into 1/2-inch rounds. Lay them on paper towels and sprinkle generously with salt on both sides. Let sit for 20-30 minutes—this draws out moisture and bitterness. You'll see beads of liquid form on the surface.",
        "Preheat your oven to 400°F (200°C). Line a large baking sheet with parchment paper and set up your breading station.",
        "Rinse the salt off the eggplant slices and pat them very dry with paper towels. This step is crucial for crispy breading.",
        "Mix the breadcrumbs with the parmesan cheese in a shallow bowl. Beat the eggs in another shallow bowl. Dip each eggplant slice in egg, letting excess drip off, then press into the breadcrumb mixture, coating both sides.",
        "Arrange breaded eggplant in a single layer on the baking sheet. Bake for 20-25 minutes, flipping halfway through, until golden brown and crispy on both sides.",
        "Spread a thin layer of marinara sauce on the bottom of a baking dish. Arrange the baked eggplant slices on top in a single layer, overlapping slightly if needed.",
        "Spoon more marinara sauce over the eggplant. Top with shredded mozzarella, distributing it evenly. Sprinkle with a little more parmesan.",
        "Bake for 15-20 minutes until the cheese is melted, bubbly, and starting to brown in spots.",
        "Let rest for 5 minutes before serving. Garnish with fresh basil leaves. Serve with crusty bread or over spaghetti for a heartier meal."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "eggplant-parm",
      "cuisine": "italian"
    },
    {
      "name": "One-Pan Lemon Herb Chicken & Potatoes",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 40,
      "description": "Juicy chicken thighs roasted with golden potatoes and fresh herbs.",
      "ingredients": [
        "6 chicken thighs",
        "1 lb baby potatoes, halved",
        "4 cloves garlic, minced",
        "2 tbsp olive oil",
        "Juice of 1 lemon",
        "1 tbsp fresh rosemary",
        "1 tbsp fresh thyme",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 425°F (220°C). Take the chicken out of the refrigerator 15-20 minutes before cooking to take the chill off—this helps it cook more evenly.",
        "In a large bowl, combine the halved baby potatoes with 1 tbsp olive oil, minced garlic, half the rosemary and thyme, salt, and pepper. Toss until the potatoes are evenly coated.",
        "Spread the potatoes in a single layer in a large cast iron skillet or roasting pan. The potatoes should be mostly cut-side down for maximum browning.",
        "Pat the chicken thighs very dry with paper towels. Season generously on both sides with salt, pepper, and the remaining fresh herbs. Rub with the remaining olive oil.",
        "Nestle the chicken thighs on top of the potatoes, skin-side up. Squeeze the lemon juice over everything. Tuck the lemon halves into the pan around the chicken—they'll roast and caramelize.",
        "Roast for 35-40 minutes without opening the oven door. The chicken is done when it reaches an internal temperature of 165°F and the skin is deep golden brown and crispy. The potatoes should be fork-tender with crispy edges.",
        "Let rest for 5 minutes in the pan—this allows the juices to redistribute. Serve directly from the pan, spooning the aromatic pan juices over the chicken and potatoes.",
        "Garnish with additional fresh herbs and squeeze the roasted lemon over everything for extra brightness. The caramelized roasted lemon has a sweet, mellow flavor that's incredible."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "lemon-herb-chicken",
      "cuisine": "american"
    },
    {
      "name": "Vegetable Pad Thai",
      "isForFamily": false,
      "dietTags": [
        "vegan"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Classic Thai noodles with tofu, bean sprouts, and tangy tamarind sauce.",
      "ingredients": [
        "8 oz rice noodles",
        "1 block firm tofu, cubed",
        "2 cups bean sprouts",
        "3 green onions, sliced",
        "1/4 cup crushed peanuts",
        "3 tbsp tamarind paste",
        "2 tbsp soy sauce",
        "1 tbsp maple syrup",
        "1 tbsp rice vinegar",
        "Lime wedges"
      ],
      "steps": [
        "Soak the rice noodles in warm (not boiling) water for 20-30 minutes until pliable but still slightly firm OR based on package instructions. They'll finish cooking in the wok. Drain well before using.",
        "Press the tofu for at least 15 minutes to remove excess moisture. Cut into 1/2-inch cubes. Pan-fry in 2 tbsp oil over medium-high heat until golden and crispy on all sides, about 8-10 minutes. Set aside.",
        "Make the pad thai sauce: whisk together the tamarind paste, soy sauce, maple syrup, and rice vinegar. Taste and adjust—it should be a balance of sour, sweet, and salty. Add 2 tbsp water if it's too thick.",
        "Heat a large wok or skillet over high heat until smoking. Add 1 tbsp oil and swirl to coat. Add the drained noodles and toss continuously for 1-2 minutes.",
        "Pour the pad thai sauce over the noodles. Toss vigorously, lifting and turning the noodles to coat them evenly with the sauce. Keep the heat high—you want some slight char.",
        "Add the crispy tofu, bean sprouts (reserving some for garnish), and most of the green onions. Toss everything together for another minute until just combined. Bean sprouts should stay crisp.",
        "Transfer to serving plates. Top with the remaining fresh bean sprouts, sliced green onions, and crushed peanuts. Serve immediately with lime wedges for squeezing—the lime is essential!",
        "Add chili flakes or sriracha at the table for those who want extra heat. Traditional pad thai should have a perfect balance of sour, sweet, and salty flavors."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "veggie-pad-thai",
      "cuisine": "asian"
    },
    {
      "name": "Beef Stroganoff",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 35,
      "description": "Tender beef strips in a creamy mushroom sauce over egg noodles.",
      "ingredients": [
        "1 lb beef sirloin, sliced thin",
        "8 oz egg noodles",
        "8 oz mushrooms, sliced",
        "1 onion, diced",
        "2 cloves garlic, minced",
        "1 cup beef broth",
        "1 cup sour cream",
        "2 tbsp flour",
        "2 tbsp butter",
        "Fresh parsley"
      ],
      "steps": [
        "Slice the beef sirloin across the grain into thin 1/4-inch strips. Season with salt and pepper. Slicing against the grain is key for tenderness. Partially freezing the meat for 20 minutes makes slicing easier.",
        "Bring a large pot of salted water to a boil. Cook the egg noodles according to package directions until al dente. Drain and toss with a small pat of butter to prevent sticking. Keep warm.",
        "Heat 1 tbsp butter in a large skillet over high heat. Add the beef strips in a single layer—work in batches to avoid crowding. Sear quickly, about 1-2 minutes per side, until browned but still slightly pink inside. Transfer to a plate.",
        "Reduce heat to medium. Add remaining butter and the sliced mushrooms. Cook without stirring for 2-3 minutes to let them brown, then stir and continue cooking until golden and tender, about 5 more minutes.",
        "Add the diced onion to the mushrooms and cook until softened, about 3-4 minutes. Add the minced garlic and cook for 30 seconds until fragrant.",
        "Sprinkle the flour over the mushrooms and onions. Stir constantly for 1 minute to cook out the raw flour taste. This creates the base of your sauce.",
        "Gradually pour in the beef broth while stirring continuously to prevent lumps. Bring to a simmer and cook for 3-4 minutes until the sauce thickens enough to coat the back of a spoon.",
        "Remove the pan from heat (this is important!) and stir in the sour cream until smooth. Return the beef and any accumulated juices to the pan. Gently stir to combine. Don't boil after adding sour cream or it may curdle.",
        "Taste and adjust seasoning. Serve immediately over the warm egg noodles, garnished with chopped fresh parsley and an extra dollop of sour cream if desired."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "beef-stroganoff",
      "cuisine": "american"
    },
    {
      "name": "Mediterranean Quinoa Salad",
      "isForFamily": false,
      "dietTags": [
        "vegan",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 20,
      "description": "Fresh and light quinoa salad with cucumber, tomatoes, olives, and lemon dressing.",
      "ingredients": [
        "1 cup quinoa",
        "1 cucumber, diced",
        "1 cup cherry tomatoes, halved",
        "1/2 cup kalamata olives, halved",
        "1/4 red onion, diced",
        "1/4 cup olive oil",
        "Juice of 1 lemon",
        "1 tsp dried oregano",
        "Salt & pepper"
      ],
      "steps": [
        "Rinse the quinoa thoroughly under cold water using a fine-mesh strainer. This removes the natural coating (saponin) that can make it taste bitter or soapy.",
        "Cook the quinoa: combine 1 cup quinoa with 2 cups water in a saucepan. Bring to a boil, reduce heat to low, cover, and simmer for 15 minutes until all water is absorbed. Remove from heat and let stand covered for 5 minutes.",
        "Fluff the quinoa with a fork and spread it on a sheet pan to cool quickly. You can refrigerate it for 10 minutes to speed this up. The quinoa should be completely cool before assembling the salad.",
        "While quinoa cools, prep your vegetables: dice the cucumber into 1/2-inch pieces, halve the cherry tomatoes, halve the kalamata olives, and finely dice the red onion.",
        "Make the lemon dressing: whisk together the olive oil, lemon juice, dried oregano, 1/2 teaspoon salt, and pepper to taste. The dressing should be bright and tangy.",
        "In a large bowl, combine the cooled quinoa with the cucumber, tomatoes, olives, and red onion. Pour the dressing over and toss gently to combine everything evenly.",
        "Taste and adjust seasoning—you may want more lemon juice, salt, or a drizzle of extra olive oil. The salad should be well-dressed but not swimming in dressing.",
        "Serve immediately at room temperature, or refrigerate for at least 30 minutes to let the flavors meld. This salad keeps well for up to 3 days in the refrigerator and makes excellent meal prep. Add fresh herbs like parsley or mint before serving."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "quinoa-salad",
      "cuisine": "mediterranean"
    },
    {
      "name": "Crispy Baked Chicken Tenders",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 30,
      "description": "Kid-friendly crispy chicken tenders baked to golden perfection.",
      "ingredients": [
        "1.5 lbs chicken tenders",
        "1 cup panko breadcrumbs",
        "1/2 cup flour",
        "2 eggs, beaten",
        "1 tsp garlic powder",
        "1 tsp paprika",
        "Honey mustard for dipping",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 425°F (220°C). Line a baking sheet with parchment paper and place a wire cooling rack on top. Spray the rack with cooking oil. This setup allows air to circulate and makes the tenders crispy on all sides.",
        "Set up a breading station with three shallow dishes: flour seasoned with salt and pepper in the first, beaten eggs in the second, and panko mixed with garlic powder, paprika, 1/2 tsp salt, and pepper in the third.",
        "Pat the chicken tenders dry with paper towels. If any tenders are very thick, pound them gently to an even thickness for uniform cooking.",
        "Bread the chicken: dredge each tender in flour, shaking off excess. Dip in beaten egg, letting excess drip off. Press firmly into the panko mixture, coating all sides and pressing to adhere.",
        "Arrange the breaded tenders on the wire rack in a single layer with space between each. Lightly spray the tops with cooking oil—this helps achieve that golden, crispy exterior.",
        "Bake for 18-22 minutes, flipping halfway through, until the chicken is cooked through (165°F internal temperature) and the coating is golden brown and crispy. Cooking time may vary based on the size of your tenders.",
        "Let rest for 2-3 minutes before serving. The breading will continue to crisp as it rests.",
        "Serve with honey mustard, ranch, BBQ sauce, or your favorite dipping sauces. These tenders are also great sliced over salads or in wraps. For extra-crispy coating, spray with a little more oil after flipping."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "chicken-tenders",
      "cuisine": "american"
    },
    {
      "name": "Korean Bibimbap",
      "isForFamily": false,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 35,
      "description": "Colorful Korean rice bowl with seasoned vegetables, beef, and a fried egg topped with gochujang sauce.",
      "ingredients": [
        "2 cups cooked rice",
        "1/2 lb ground beef or sliced ribeye",
        "2 cups spinach",
        "1 carrot, julienned",
        "1 zucchini, julienned",
        "1 cup bean sprouts",
        "2 eggs",
        "2 tbsp gochujang",
        "2 tbsp soy sauce",
        "1 tbsp sesame oil",
        "2 cloves garlic, minced",
        "Sesame seeds"
      ],
      "steps": [
        "Start by preparing your rice. For authentic bibimbap, use short-grain rice that's slightly sticky. Keep it warm while you prepare the toppings.",
        "Season the beef with 1 tbsp soy sauce, 1 tsp sesame oil, and minced garlic. Let it marinate for 10 minutes. If using sliced ribeye, cut it into thin strips against the grain.",
        "Blanch the spinach in boiling salted water for 30 seconds, then immediately transfer to ice water. Squeeze out excess water and season with a pinch of salt and a few drops of sesame oil.",
        "Sauté the julienned carrots in a hot pan with a little oil for 2-3 minutes until slightly softened but still crisp. Season with salt and set aside.",
        "Cook the zucchini the same way—2-3 minutes in a hot pan until just tender. Season lightly with salt. Keep each vegetable separate for the traditional presentation.",
        "Blanch the bean sprouts for 1 minute, drain well, and season with sesame oil and a pinch of salt. They should remain crunchy.",
        "Cook the marinated beef in a hot skillet over high heat until browned and cooked through, about 3-4 minutes. Set aside.",
        "Fry the eggs sunny-side up so the yolks remain runny—this is essential for mixing into the bibimbap. The yolk creates a rich sauce when broken.",
        "To assemble: place warm rice in a bowl. Arrange each vegetable and the beef in separate sections on top of the rice, creating a colorful wheel pattern. Place the fried egg in the center.",
        "Serve with gochujang (Korean chili paste) on the side. Mix everything together before eating, breaking the egg yolk so it coats the rice. Sprinkle with sesame seeds."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "korean-bibimbap",
      "cuisine": "asian"
    },
    {
      "name": "Shakshuka",
      "isForFamily": false,
      "dietTags": [
        "vegetarian",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 25,
      "description": "Middle Eastern eggs poached in a spiced tomato and pepper sauce, perfect for breakfast or dinner.",
      "ingredients": [
        "1 can (28 oz) crushed tomatoes",
        "4-6 eggs",
        "1 red bell pepper, diced",
        "1 onion, diced",
        "4 cloves garlic, minced",
        "2 tsp cumin",
        "1 tsp paprika",
        "1/2 tsp cayenne pepper",
        "Fresh cilantro or parsley",
        "Crusty bread for serving",
        "Crumbled feta cheese (optional)"
      ],
      "steps": [
        "Heat 2 tablespoons of olive oil in a large, deep skillet (with a lid) over medium heat. A cast iron pan works beautifully and retains heat for serving.",
        "Add the diced onion and bell pepper. Cook until softened and the onion is translucent, about 5-6 minutes. Stir occasionally.",
        "Add the minced garlic, cumin, paprika, and cayenne. Cook for 1 minute, stirring constantly, until the spices are fragrant and toasted. This blooms the spices and intensifies their flavor.",
        "Pour in the crushed tomatoes and stir well. Season with salt and pepper. Bring to a simmer and cook for 10 minutes, allowing the sauce to thicken slightly and the flavors to meld.",
        "Taste the sauce and adjust seasoning—it should be well-seasoned as the eggs won't add much flavor. Add more cayenne if you like it spicier.",
        "Use a spoon to create small wells in the sauce, spacing them evenly. Crack an egg into each well. Be careful not to break the yolks.",
        "Cover the pan with a lid and cook for 5-8 minutes until the egg whites are set but the yolks are still runny. For firmer yolks, cook 2-3 minutes longer.",
        "Remove from heat and scatter fresh cilantro or parsley over the top. Add crumbled feta cheese if using—it adds a nice salty, creamy contrast.",
        "Serve immediately, straight from the pan, with plenty of crusty bread for scooping up the eggs and sauce. This is best eaten family-style."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "shakshuka",
      "cuisine": "mediterranean"
    },
    {
      "name": "Cajun Shrimp Pasta",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Creamy pasta with spicy Cajun-seasoned shrimp, bell peppers, and a touch of heat.",
      "ingredients": [
        "1 lb large shrimp, peeled and deveined",
        "12 oz penne or fettuccine",
        "2 tbsp Cajun seasoning",
        "1 red bell pepper, sliced",
        "1 green bell pepper, sliced",
        "4 cloves garlic, minced",
        "1 cup heavy cream",
        "1/2 cup chicken broth",
        "1/2 cup parmesan cheese, grated",
        "2 tbsp butter",
        "Fresh parsley"
      ],
      "steps": [
        "Bring a large pot of salted water to a boil. Cook the pasta according to package directions until al dente. Reserve 1/2 cup pasta water before draining.",
        "While pasta cooks, pat the shrimp dry and toss with 1 tablespoon of Cajun seasoning until evenly coated. Let sit for 5 minutes.",
        "Heat 1 tablespoon butter in a large skillet over medium-high heat. Add the seasoned shrimp in a single layer. Cook for 2 minutes per side until pink and slightly charred. Transfer to a plate immediately—don't overcook.",
        "In the same skillet, add the remaining butter. Sauté the sliced bell peppers until slightly softened but still crisp, about 3-4 minutes.",
        "Add the minced garlic and remaining Cajun seasoning. Cook for 30 seconds until fragrant, stirring constantly to prevent burning.",
        "Pour in the heavy cream and chicken broth. Bring to a simmer and cook for 3-4 minutes until the sauce begins to thicken. Stir occasionally.",
        "Reduce heat to low and stir in the parmesan cheese until melted and smooth. Taste and adjust seasoning—you may want more Cajun spice or salt.",
        "Add the drained pasta to the skillet, tossing to coat with the creamy sauce. Add pasta water a splash at a time if the sauce is too thick.",
        "Return the shrimp to the pan and toss gently to combine. Cook just until heated through, about 1 minute.",
        "Serve immediately, garnished with fresh parsley and extra parmesan. Have red pepper flakes at the table for those who want more heat."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "cajun-shrimp-pasta",
      "cuisine": "american"
    },
    {
      "name": "Butter Chicken",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 40,
      "description": "Rich and creamy Indian curry with tender chicken in a tomato-based sauce, served with basmati rice.",
      "ingredients": [
        "1.5 lbs chicken thighs, cubed",
        "1 cup plain yogurt",
        "2 tbsp garam masala",
        "1 tsp turmeric",
        "1 can (14 oz) tomato puree",
        "1 cup heavy cream",
        "4 tbsp butter",
        "1 large onion, diced",
        "4 cloves garlic, minced",
        "1 tbsp grated ginger",
        "1 tsp paprika",
        "Fresh cilantro",
        "Basmati rice"
      ],
      "steps": [
        "Cut chicken thighs into 1.5-inch pieces. Marinate in yogurt, 1 tbsp garam masala, and turmeric for at least 30 minutes, or overnight in the refrigerator for best results.",
        "Start your basmati rice: rinse until water runs clear, then cook with a 1:1.5 ratio of rice to water. Once boiling, reduce to low, cover, and cook for 15 minutes.",
        "Melt 2 tablespoons butter in a large pot or Dutch oven over medium heat. Remove chicken from marinade (shaking off excess) and cook in batches until browned on all sides, about 5 minutes. Set aside.",
        "Add remaining butter to the pot. Sauté the diced onion until soft and golden, about 6-7 minutes. This caramelization adds sweetness to the sauce.",
        "Add the garlic, ginger, remaining garam masala, and paprika. Cook for 1-2 minutes until very fragrant, stirring constantly.",
        "Pour in the tomato puree and stir well, scraping up any browned bits from the bottom. Simmer for 10 minutes until the sauce darkens and thickens slightly.",
        "Stir in the heavy cream, creating that signature orange color. Return the chicken pieces to the pot along with any accumulated juices.",
        "Simmer uncovered for 15 minutes until the chicken is cooked through and the sauce is rich and creamy. Stir occasionally to prevent sticking.",
        "Taste and adjust seasoning with salt and a pinch of sugar if the tomatoes are too acidic. The sauce should be slightly sweet and well-balanced.",
        "Serve over fluffy basmati rice, garnished with fresh cilantro. Warm naan bread is essential for scooping up the sauce."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "butter-chicken",
      "cuisine": "indian"
    },
    {
      "name": "Vegetable Stir Fry",
      "isForFamily": true,
      "dietTags": [
        "vegan",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 20,
      "description": "Quick and colorful stir fry with crisp vegetables in a savory garlic-ginger sauce.",
      "ingredients": [
        "2 cups broccoli florets",
        "1 red bell pepper, sliced",
        "1 cup snap peas",
        "1 cup sliced mushrooms",
        "2 carrots, sliced thin",
        "3 cloves garlic, minced",
        "1 tbsp fresh ginger, minced",
        "3 tbsp soy sauce or tamari",
        "1 tbsp sesame oil",
        "1 tbsp rice vinegar",
        "1 tsp cornstarch",
        "Cooked rice for serving",
        "Sesame seeds"
      ],
      "steps": [
        "Prep all your vegetables before you start cooking—stir frying goes fast. Cut everything into similar-sized pieces for even cooking.",
        "Mix the sauce: whisk together soy sauce, sesame oil, rice vinegar, and cornstarch with 2 tablespoons water. Set aside near your stove.",
        "Heat a large wok or skillet over high heat until smoking. Add 2 tablespoons vegetable oil and swirl to coat.",
        "Add the carrots first since they take longest to cook. Stir fry for 2 minutes, keeping them moving constantly.",
        "Add the broccoli and bell pepper. Continue stir frying for another 2 minutes, tossing frequently. The vegetables should start to char slightly at the edges.",
        "Add the mushrooms and snap peas. Cook for 1-2 minutes more. The vegetables should be crisp-tender, not soft.",
        "Push the vegetables to the sides of the wok, creating a well in the center. Add the garlic and ginger to the center and cook for 30 seconds until fragrant.",
        "Give the sauce a quick stir (the cornstarch settles) and pour it into the wok. Toss everything together quickly as the sauce thickens and coats the vegetables, about 30 seconds.",
        "Remove from heat immediately—the vegetables should still be vibrant and slightly crunchy. Overcooked stir fry is soggy stir fry.",
        "Serve immediately over steamed rice, topped with sesame seeds. Add chili flakes or sriracha for heat if desired."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "vegetable-stir-fry",
      "cuisine": "asian"
    },
    {
      "name": "Lamb Gyros",
      "isForFamily": false,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 45,
      "description": "Greek-style seasoned lamb in warm pita with tzatziki, tomatoes, and onions.",
      "ingredients": [
        "1 lb ground lamb",
        "1 tsp cumin",
        "1 tsp oregano",
        "1 tsp paprika",
        "4 cloves garlic, minced",
        "1/2 onion, grated",
        "4 pita breads",
        "1 cup Greek yogurt",
        "1/2 cucumber, grated",
        "1 tomato, sliced",
        "1/4 red onion, sliced thin",
        "Fresh dill"
      ],
      "steps": [
        "Make the tzatziki first so flavors can meld: grate the cucumber, squeeze out excess moisture with a clean towel. Mix with Greek yogurt, 1 clove minced garlic, 1 tbsp olive oil, fresh dill, salt, and a squeeze of lemon. Refrigerate.",
        "For the lamb, combine ground lamb with cumin, oregano, paprika, remaining minced garlic, grated onion, 1 tsp salt, and pepper in a bowl.",
        "Mix the lamb thoroughly with your hands for 2-3 minutes. The more you work it, the better the texture will be. The meat should be somewhat paste-like.",
        "Form the lamb mixture into a flat loaf shape, about 1 inch thick. This helps it cook evenly and mimics the traditional gyro meat texture.",
        "Preheat your oven to 325°F. Place the lamb loaf on a baking sheet lined with a wire rack. Bake for 25-30 minutes until the internal temperature reaches 160°F.",
        "While the lamb bakes, prep your toppings: slice the tomato, thinly slice the red onion, and chop fresh dill for garnish.",
        "Let the lamb rest for 5 minutes, then slice it very thin—almost shaving it. For extra crispiness, sear the slices briefly in a hot pan.",
        "Warm the pita breads in a dry skillet or directly over a gas flame until soft and pliable with a few char marks.",
        "Assemble the gyros: spread tzatziki on each pita, add sliced lamb, tomatoes, red onion, and a final drizzle of tzatziki.",
        "Fold and serve immediately. Offer extra tzatziki on the side and a wedge of lemon for squeezing."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "lamb-gyros",
      "cuisine": "mediterranean"
    },
    {
      "name": "Black Bean Burgers",
      "isForFamily": true,
      "dietTags": [
        "vegan"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 30,
      "description": "Hearty homemade veggie burgers with black beans, spices, and a crispy exterior.",
      "ingredients": [
        "2 cans black beans, drained and rinsed",
        "1/2 cup breadcrumbs",
        "1/4 cup flour",
        "1 tsp cumin",
        "1 tsp smoked paprika",
        "1/2 tsp garlic powder",
        "1/4 cup red onion, finely diced",
        "1 tbsp soy sauce",
        "Burger buns",
        "Avocado, lettuce, tomato for topping"
      ],
      "steps": [
        "Drain and rinse the black beans thoroughly. Pat them dry with paper towels—excess moisture will make the burgers fall apart.",
        "Add the beans to a large bowl and mash about 3/4 of them with a fork or potato masher, leaving some whole for texture. The mixture should be chunky, not smooth.",
        "Add the breadcrumbs, flour, cumin, smoked paprika, garlic powder, diced red onion, and soy sauce. Mix until well combined.",
        "The mixture should hold together when pressed. If it's too wet, add more breadcrumbs. If too dry, add a splash of water.",
        "Divide the mixture into 4 equal portions and shape into patties about 3/4 inch thick. Press firmly and smooth the edges. Refrigerate for 15 minutes to help them hold together.",
        "Heat 2 tablespoons oil in a large skillet over medium heat. Once hot, add the patties. Don't move them for 4-5 minutes to develop a crispy crust.",
        "Carefully flip and cook another 4-5 minutes until browned and heated through. The patties are delicate, so use a wide spatula.",
        "Toast the burger buns in the same skillet or under the broiler until golden brown.",
        "Assemble burgers with your favorite toppings: mashed avocado, lettuce, tomato, red onion, and any sauce you like—chipotle mayo is excellent.",
        "Serve immediately. These burgers also hold up well in the fridge for meal prep and can be reheated in a pan."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "black-bean-burgers",
      "cuisine": "mexican"
    },
    {
      "name": "Chicken Alfredo",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 35,
      "description": "Classic creamy pasta with tender chicken breast in a rich parmesan sauce.",
      "ingredients": [
        "1 lb fettuccine",
        "1 lb chicken breast",
        "4 tbsp butter",
        "4 cloves garlic, minced",
        "2 cups heavy cream",
        "1.5 cups parmesan cheese, grated",
        "1/2 tsp nutmeg",
        "Italian seasoning",
        "Fresh parsley",
        "Salt & pepper"
      ],
      "steps": [
        "Bring a large pot of salted water to a boil for the pasta. Season generously—it should taste like the sea.",
        "Slice chicken breasts in half horizontally to create thin cutlets. Season both sides with Italian seasoning, salt, and pepper.",
        "Heat 1 tablespoon butter in a large skillet over medium-high heat. Cook the chicken for 4-5 minutes per side until golden brown and cooked through (165°F internal). Let rest, then slice into strips.",
        "While chicken rests, cook the fettuccine according to package directions until al dente. Reserve 1 cup pasta water before draining.",
        "In the same skillet, melt the remaining butter over medium heat. Add the minced garlic and cook for 30 seconds until fragrant—don't let it brown.",
        "Pour in the heavy cream and bring to a gentle simmer. Cook for 2-3 minutes until it starts to thicken slightly, stirring occasionally.",
        "Reduce heat to low. Gradually add the parmesan cheese, stirring constantly until melted and smooth. Add the nutmeg and season with salt and pepper.",
        "Add the drained pasta directly to the sauce. Toss well to coat every strand. Add pasta water a splash at a time if the sauce is too thick—it should be silky and cling to the pasta.",
        "Add the sliced chicken and toss gently to combine. Taste and adjust seasoning.",
        "Serve immediately in warm bowls, topped with extra parmesan, cracked black pepper, and fresh parsley."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "chicken-alfredo",
      "cuisine": "italian"
    },
    {
      "name": "Thai Green Curry",
      "isForFamily": false,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Aromatic Thai curry with chicken, vegetables, and coconut milk served over jasmine rice.",
      "ingredients": [
        "1 lb chicken breast, sliced",
        "1 can (14 oz) coconut milk",
        "3 tbsp green curry paste",
        "1 red bell pepper, sliced",
        "1 cup bamboo shoots",
        "1 cup Thai basil leaves",
        "2 tbsp fish sauce",
        "1 tbsp brown sugar",
        "1 cup chicken broth",
        "Jasmine rice",
        "Lime wedges"
      ],
      "steps": [
        "Start the jasmine rice first: rinse 1 cup rice until water runs clear. Cook with 1.25 cups water. Once boiling, reduce to low, cover, and simmer for 15 minutes. Keep covered until serving.",
        "Slice the chicken breast into thin strips against the grain. This ensures tender pieces that cook quickly.",
        "Open the coconut milk and scoop the thick cream from the top into a wok or large pan. Heat over medium-high until it begins to separate and sizzle.",
        "Add the green curry paste to the coconut cream. Fry for 1-2 minutes, stirring constantly, until very fragrant. This blooms the paste and intensifies the flavor.",
        "Add the chicken strips and cook for 3-4 minutes, stirring to coat them in the curry paste, until nearly cooked through.",
        "Pour in the remaining coconut milk and chicken broth. Add the fish sauce and brown sugar. Stir to combine and bring to a simmer.",
        "Add the sliced bell pepper and bamboo shoots. Simmer for 5-7 minutes until the vegetables are tender and the sauce has thickened slightly.",
        "Taste and adjust seasoning—you may need more fish sauce for saltiness or sugar for sweetness. Thai food balances salty, sweet, sour, and spicy.",
        "Remove from heat and stir in the Thai basil leaves. They should wilt but remain bright green.",
        "Serve over jasmine rice with lime wedges for squeezing. The lime juice brightens all the flavors."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "thai-green-curry",
      "cuisine": "asian"
    },
    {
      "name": "Caprese Salad",
      "isForFamily": false,
      "dietTags": [
        "vegetarian",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 10,
      "description": "Classic Italian salad with fresh mozzarella, ripe tomatoes, and basil drizzled with olive oil.",
      "ingredients": [
        "2 large ripe tomatoes",
        "8 oz fresh mozzarella",
        "1 bunch fresh basil",
        "3 tbsp extra virgin olive oil",
        "1 tbsp balsamic glaze",
        "Flaky sea salt",
        "Fresh cracked pepper"
      ],
      "steps": [
        "Choose the ripest tomatoes you can find—this salad is all about quality ingredients. Heirloom tomatoes work beautifully for their flavor and visual appeal.",
        "Slice the tomatoes into 1/4-inch thick rounds. Slice the fresh mozzarella to match. Both should be roughly the same thickness.",
        "Arrange the tomato and mozzarella slices on a serving platter, alternating and overlapping them slightly. Traditional presentation is in a line or circular pattern.",
        "Tuck whole basil leaves between the tomato and mozzarella slices. Use small to medium leaves for the best appearance. Don't chop the basil—it bruises easily.",
        "Drizzle generously with high-quality extra virgin olive oil. This is not the time for cheap oil—use the good stuff, you'll taste the difference.",
        "Drizzle the balsamic glaze in thin lines across the top. The sweetness of the balsamic complements the fresh tomatoes perfectly.",
        "Season with flaky sea salt and fresh cracked black pepper. The salt should be visible—it adds texture and brings out the tomato's sweetness.",
        "Let the salad sit at room temperature for 5 minutes before serving. Cold mozzarella straight from the fridge won't have as much flavor.",
        "Serve immediately as an appetizer or light lunch. This is best eaten the day it's made while everything is at peak freshness."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "caprese-salad",
      "cuisine": "italian"
    },
    {
      "name": "Beef Burrito Bowl",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 35,
      "description": "Chipotle-style bowl with seasoned beef, cilantro-lime rice, beans, and all the fixings.",
      "ingredients": [
        "1 lb ground beef",
        "2 cups cooked rice",
        "1 can black beans, drained",
        "1 cup corn kernels",
        "1 cup pico de gallo",
        "1 avocado, sliced",
        "1/2 cup shredded cheese",
        "2 tbsp taco seasoning",
        "Juice of 2 limes",
        "1/4 cup fresh cilantro, chopped",
        "Sour cream",
        "Lettuce"
      ],
      "steps": [
        "Cook the rice according to package directions. When done, fluff with a fork and stir in the juice of 1 lime and most of the chopped cilantro. This cilantro-lime rice is the foundation of the bowl.",
        "Heat the black beans in a small saucepan with a pinch of cumin and salt. Keep warm.",
        "In a large skillet over medium-high heat, cook the ground beef, breaking it apart with a wooden spoon. Cook until browned, about 6-8 minutes.",
        "Drain excess fat from the beef. Add the taco seasoning and 1/4 cup water. Stir and simmer for 3-4 minutes until the seasoning coats the meat.",
        "Warm the corn in a small pan or microwave. For extra flavor, char the corn in a dry hot skillet until slightly blackened in spots.",
        "Slice the avocado and squeeze a little lime juice over it to prevent browning. Prepare any other toppings: shred the cheese, chop lettuce, have sour cream ready.",
        "Assemble the bowls: start with a base of cilantro-lime rice. Add sections of seasoned beef, black beans, corn, and lettuce.",
        "Top with pico de gallo, sliced avocado, shredded cheese, and a dollop of sour cream.",
        "Drizzle with remaining lime juice and garnish with extra cilantro. Serve immediately while everything is warm.",
        "For meal prep, store components separately and assemble fresh bowls throughout the week. The rice and beef reheat well."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "beef-burrito-bowl",
      "cuisine": "mexican"
    },
    {
      "name": "Garlic Butter Shrimp",
      "isForFamily": false,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 15,
      "description": "Quick and elegant shrimp sautéed in garlic butter with white wine and fresh parsley.",
      "ingredients": [
        "1 lb large shrimp, peeled and deveined",
        "4 tbsp butter",
        "6 cloves garlic, minced",
        "1/4 cup white wine",
        "Juice of 1 lemon",
        "1/4 tsp red pepper flakes",
        "Fresh parsley, chopped",
        "Salt & pepper",
        "Crusty bread for serving"
      ],
      "steps": [
        "Pat the shrimp completely dry with paper towels—this is crucial for getting a good sear. Season lightly with salt and pepper.",
        "Melt 2 tablespoons butter in a large skillet over medium-high heat. Wait until the butter is foaming and just starting to brown.",
        "Add the shrimp in a single layer. Don't move them! Let them sear for 2 minutes until pink and golden on the bottom.",
        "Flip the shrimp and cook for 1 minute more. They should be pink and opaque but still juicy. Transfer to a plate immediately—don't overcook.",
        "Reduce heat to medium. Add the remaining butter and minced garlic. Sauté for 30 seconds until the garlic is fragrant but not browned.",
        "Add the white wine, carefully as it may splatter. Let it simmer for 1 minute, scraping up any browned bits from the pan.",
        "Add the lemon juice and red pepper flakes. Stir to combine and let the sauce reduce slightly, about 30 seconds.",
        "Return the shrimp to the pan and toss to coat with the garlic butter sauce. Remove from heat immediately.",
        "Transfer to a serving dish and garnish with fresh chopped parsley. Pour any remaining sauce from the pan over the top.",
        "Serve immediately with crusty bread for soaking up the garlicky butter sauce. This also pairs beautifully over pasta or rice."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "garlic-butter-shrimp",
      "cuisine": "american"
    },
    {
      "name": "Vegetable Lasagna",
      "isForFamily": true,
      "dietTags": [
        "vegetarian"
      ],
      "chefLevels": [
        "executiveChef"
      ],
      "cookTimeMinutes": 60,
      "description": "Hearty layered pasta with ricotta, spinach, mushrooms, and three cheeses.",
      "ingredients": [
        "12 lasagna noodles",
        "2 cups ricotta cheese",
        "2 cups spinach, chopped",
        "8 oz mushrooms, sliced",
        "1 zucchini, sliced thin",
        "2 cups marinara sauce",
        "2 cups shredded mozzarella",
        "1/2 cup parmesan cheese",
        "1 egg",
        "2 cloves garlic, minced",
        "Italian seasoning"
      ],
      "steps": [
        "Preheat oven to 375°F (190°C). Cook lasagna noodles according to package directions. Drain and lay flat on a clean towel to prevent sticking.",
        "Sauté the sliced mushrooms in 1 tablespoon olive oil over medium-high heat until golden brown and moisture has evaporated, about 6-7 minutes. Season with salt and set aside.",
        "In the same pan, quickly wilt the spinach with the minced garlic, about 2 minutes. Squeeze out excess moisture and set aside.",
        "In a bowl, mix the ricotta cheese with the egg, half the parmesan, Italian seasoning, salt, and pepper. Fold in the sautéed spinach.",
        "Spread 1/2 cup marinara on the bottom of a 9x13 baking dish. Layer 4 noodles, slightly overlapping.",
        "Spread half the ricotta mixture over the noodles. Layer half the mushrooms and half the zucchini slices. Top with 1/2 cup marinara and 1/2 cup mozzarella.",
        "Repeat layers: 4 noodles, remaining ricotta mixture, remaining vegetables, 1/2 cup marinara, 1/2 cup mozzarella.",
        "Top with final 4 noodles, remaining marinara, remaining mozzarella, and remaining parmesan. Cover tightly with foil.",
        "Bake covered for 35 minutes. Remove foil and bake 15-20 minutes more until bubbly and golden brown on top.",
        "Let rest for 15 minutes before cutting—this is essential for clean slices. Garnish with fresh basil and serve."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "vegetable-lasagna",
      "cuisine": "italian"
    },
    {
      "name": "Honey Mustard Chicken",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 35,
      "description": "Juicy baked chicken thighs glazed with a sweet and tangy honey mustard sauce.",
      "ingredients": [
        "6 chicken thighs, bone-in, skin-on",
        "1/4 cup honey",
        "3 tbsp Dijon mustard",
        "2 tbsp whole grain mustard",
        "2 tbsp olive oil",
        "4 cloves garlic, minced",
        "1 tbsp fresh rosemary, chopped",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat your oven to 425°F (220°C). Take the chicken out of the refrigerator 15 minutes before cooking to bring to room temperature.",
        "Pat the chicken thighs very dry with paper towels. Season generously with salt and pepper on both sides, especially the skin.",
        "In a small bowl, whisk together the honey, both mustards, olive oil, minced garlic, and chopped rosemary. Reserve 3 tablespoons for serving.",
        "Heat an oven-safe skillet over medium-high heat. Add a drizzle of oil. Place chicken skin-side down and sear for 5-6 minutes until the skin is golden and crispy. Don't move the chicken while it sears.",
        "Flip the chicken so it's skin-side up. Brush generously with the honey mustard glaze.",
        "Transfer the skillet to the oven and roast for 20-25 minutes until the chicken reaches an internal temperature of 165°F and the glaze is caramelized.",
        "Halfway through cooking, brush with more glaze. If the glaze is browning too quickly, tent loosely with foil.",
        "Remove from oven and let rest for 5 minutes. The juices will redistribute and the chicken will be even more tender.",
        "Drizzle with the reserved glaze before serving. The pan drippings are delicious—spoon them over the chicken or serve on the side.",
        "Serve with roasted vegetables or a simple green salad. The sweet and tangy glaze pairs well with almost any side."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "honey-mustard-chicken",
      "cuisine": "american"
    },
    {
      "name": "Falafel Wraps",
      "isForFamily": false,
      "dietTags": [
        "vegan"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 40,
      "description": "Crispy homemade falafel in warm pita with fresh vegetables and creamy tahini sauce.",
      "ingredients": [
        "1 can chickpeas, drained",
        "1/2 onion, roughly chopped",
        "4 cloves garlic",
        "1 cup fresh parsley",
        "1 cup fresh cilantro",
        "1 tsp cumin",
        "1/2 tsp coriander",
        "4 pita breads",
        "1 cup shredded lettuce",
        "1 tomato, diced",
        "1/4 cup tahini",
        "Juice of 1 lemon",
        "Pickled vegetables"
      ],
      "steps": [
        "Make the tahini sauce: whisk together tahini, lemon juice, 1 minced garlic clove, and enough water to make it drizzle-able. Season with salt. Set aside.",
        "For best results, use dried chickpeas soaked overnight rather than canned. If using canned, pat them very dry and the texture will be slightly different but still delicious.",
        "Add chickpeas, onion, remaining garlic, parsley, cilantro, cumin, coriander, 1/2 tsp salt, and pepper to a food processor. Pulse until combined but not smooth—you want some texture.",
        "Test the mixture by pressing some in your hand—it should hold together. If too wet, add 1-2 tablespoons flour. Refrigerate for 30 minutes for easier shaping.",
        "Shape the mixture into small patties about 2 inches wide and 1/2 inch thick. You should get about 12 falafel.",
        "Heat 1/4 inch of oil in a skillet over medium heat until it shimmers. Carefully add the falafel, working in batches to avoid crowding.",
        "Fry for 3-4 minutes per side until deep golden brown and crispy. The outside should be crunchy while the inside stays green and moist.",
        "Drain on paper towels and season with a pinch of salt while hot.",
        "Warm the pita breads in a dry skillet or over a flame until soft and pliable.",
        "Assemble: spread tahini sauce inside each pita, add shredded lettuce, 2-3 falafel, diced tomatoes, and pickled vegetables. Drizzle with more tahini and serve immediately."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "falafel-wraps",
      "cuisine": "mediterranean"
    },
    {
      "name": "Spaghetti Carbonara",
      "isForFamily": false,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 25,
      "description": "Authentic Italian pasta with crispy pancetta, egg, and pecorino cheese in a silky sauce.",
      "ingredients": [
        "1 lb spaghetti",
        "8 oz pancetta or guanciale, diced",
        "4 egg yolks",
        "2 whole eggs",
        "1 cup pecorino Romano, finely grated",
        "1/2 cup parmesan, finely grated",
        "Fresh cracked black pepper",
        "Salt"
      ],
      "steps": [
        "Bring a large pot of generously salted water to a boil. True carbonara uses guanciale (cured pork cheek), but pancetta works well. Bacon is not traditional but acceptable in a pinch.",
        "While water heats, cook the pancetta in a cold skillet over medium heat. Starting cold renders the fat slowly for extra crispy results. Cook 8-10 minutes until crispy and golden.",
        "In a bowl, whisk together the egg yolks, whole eggs, pecorino, parmesan, and a generous amount of black pepper. The sauce should be thick but pourable.",
        "Cook the spaghetti until al dente—check 1 minute before package time. Reserve at least 1.5 cups pasta water before draining.",
        "When pasta is ready, turn off the heat under the pancetta. Add the drained spaghetti to the pancetta pan and toss to coat in the rendered fat.",
        "Working quickly while the pan is off the heat (this is crucial!), pour the egg mixture over the pasta. Toss vigorously, adding pasta water a splash at a time.",
        "The residual heat will cook the eggs into a creamy sauce—if you do this over direct heat, you'll get scrambled eggs. Keep tossing and adding water until the sauce is silky and clings to the pasta.",
        "The sauce should be glossy and coat each strand. It will thicken as it sits, so work quickly and add more pasta water if needed.",
        "Serve immediately in warm bowls with extra pecorino and lots of fresh cracked black pepper. Carbonara waits for no one.",
        "True carbonara has no cream—the creaminess comes entirely from the emulsified eggs and cheese."
      ],
      "foodTags": [
        "pork"
      ],
      "imageName": "spaghetti-carbonara",
      "cuisine": "italian"
    },
    {
      "name": "Miso Glazed Cod",
      "isForFamily": false,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 25,
      "description": "Japanese-inspired cod fillets with a caramelized sweet miso glaze.",
      "ingredients": [
        "2 cod fillets (6 oz each)",
        "3 tbsp white miso paste",
        "2 tbsp mirin",
        "2 tbsp sake or dry white wine",
        "1 tbsp brown sugar",
        "1 tbsp soy sauce",
        "Sesame seeds",
        "Sliced green onions",
        "Steamed rice"
      ],
      "steps": [
        "For best results, marinate the fish: whisk together miso paste, mirin, sake, brown sugar, and soy sauce. Coat the cod fillets and refrigerate for at least 2 hours, or up to 48 hours for deeper flavor.",
        "If short on time, the fish can be glazed and cooked immediately—it will still be delicious, just with less miso penetration.",
        "When ready to cook, preheat your oven's broiler. Line a baking sheet with foil and lightly oil it.",
        "Remove the cod from the marinade, gently wiping off excess. Save the remaining marinade for basting.",
        "Place the cod fillets on the prepared baking sheet. The fish should be about 4-5 inches from the broiler element.",
        "Broil for 8-10 minutes, watching carefully. The miso glaze should caramelize and develop dark spots while the fish becomes opaque and flakes easily.",
        "About halfway through, brush with more marinade for an extra-glossy finish. Be careful—the sugars in the miso burn quickly under high heat.",
        "The cod is done when it flakes easily with a fork and the internal temperature reaches 145°F. Let rest for 2 minutes.",
        "Garnish with sesame seeds and sliced green onions. Serve immediately over steamed rice.",
        "This preparation also works beautifully with salmon, black cod (traditional), or sea bass."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "miso-glazed-cod",
      "cuisine": "asian"
    },
    {
      "name": "Sweet and Sour Pork",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 35,
      "description": "Classic Chinese-American dish with crispy pork in a tangy pineapple sauce.",
      "ingredients": [
        "1.5 lbs pork tenderloin, cubed",
        "1 cup pineapple chunks",
        "1 red bell pepper, chunked",
        "1 green bell pepper, chunked",
        "1/2 cup ketchup",
        "1/4 cup rice vinegar",
        "3 tbsp brown sugar",
        "2 tbsp soy sauce",
        "1/2 cup cornstarch",
        "2 eggs, beaten",
        "Oil for frying",
        "Steamed rice"
      ],
      "steps": [
        "Cut the pork tenderloin into 1-inch cubes. Season with salt and pepper. The pork should be bite-sized for easy eating.",
        "Set up a breading station: beaten eggs in one bowl, cornstarch in another. Dip the pork pieces in egg, then coat thoroughly in cornstarch.",
        "Heat 2 inches of oil in a deep pan or wok to 350°F. Fry the pork in batches, not crowding the pan, for 3-4 minutes until golden and cooked through.",
        "Transfer fried pork to a wire rack to stay crispy while you cook the rest. Don't put on paper towels—that creates steam and makes them soggy.",
        "Make the sauce: whisk together ketchup, rice vinegar, brown sugar, soy sauce, and 1/4 cup pineapple juice (from the can if using canned pineapple).",
        "In a clean wok or large skillet, heat 1 tablespoon oil over high heat. Add the bell peppers and stir-fry for 2-3 minutes until crisp-tender.",
        "Add the pineapple chunks and toss for 30 seconds to warm through.",
        "Pour in the sweet and sour sauce. Bring to a simmer and cook for 2 minutes until the sauce thickens slightly and becomes glossy.",
        "Add the crispy pork to the sauce and toss quickly to coat. Don't leave the pork in the sauce too long or it will lose its crispiness.",
        "Serve immediately over steamed rice. The pork should be eaten right away while still crispy on the outside and saucy on top."
      ],
      "foodTags": [
        "pork"
      ],
      "imageName": "sweet-sour-pork",
      "cuisine": "asian"
    },
    {
      "name": "Chickpea Salad Sandwich",
      "isForFamily": false,
      "dietTags": [
        "vegan"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 15,
      "description": "Creamy smashed chickpea salad that tastes like tuna salad, perfect for sandwiches.",
      "ingredients": [
        "2 cans chickpeas, drained",
        "1/4 cup vegan mayo",
        "1 tbsp Dijon mustard",
        "2 stalks celery, diced fine",
        "2 tbsp red onion, diced fine",
        "1 tbsp capers, chopped",
        "Juice of 1 lemon",
        "1/2 tsp kelp flakes (optional, for seafood flavor)",
        "Bread or wraps",
        "Lettuce and tomato"
      ],
      "steps": [
        "Drain and rinse the chickpeas. Pat them dry with a clean towel—this helps the mashing and prevents the salad from being watery.",
        "Add the chickpeas to a large bowl. Use a fork or potato masher to mash them. Leave some chunks for texture—you don't want a paste.",
        "Add the vegan mayo, Dijon mustard, and lemon juice. Stir to combine with the chickpeas.",
        "Fold in the diced celery, red onion, and chopped capers. The capers add briny depth that makes this taste reminiscent of tuna salad.",
        "For an extra 'seafood' flavor, add kelp flakes or a pinch of dulse. This is optional but adds an oceanic quality that many people love.",
        "Season with salt and pepper to taste. Add more lemon juice or mustard to adjust the flavor to your preference.",
        "For best flavor, refrigerate for at least 30 minutes to let the flavors meld. It keeps well for up to 4 days.",
        "To serve, toast your bread if desired. Layer with lettuce, pile on the chickpea salad, add tomato slices, and close the sandwich.",
        "This also works great in wraps, on crackers, or stuffed in a pita with other Mediterranean toppings.",
        "For variations, add dill, pickles, jalapeño, or curry powder to customize the flavor profile."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "chickpea-salad-sandwich",
      "cuisine": "american"
    },
    {
      "name": "Chicken Parmesan",
      "isForFamily": true,
      "dietTags": [
        "none"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 45,
      "description": "Crispy breaded chicken cutlets topped with marinara sauce and melted mozzarella.",
      "ingredients": [
        "4 chicken breasts",
        "1 cup breadcrumbs",
        "1/2 cup parmesan cheese, grated",
        "1/2 cup flour",
        "2 eggs, beaten",
        "1 tsp Italian seasoning",
        "2 cups marinara sauce",
        "1.5 cups shredded mozzarella",
        "Fresh basil",
        "Olive oil"
      ],
      "steps": [
        "Preheat oven to 425°F (220°C). Slice each chicken breast horizontally to create thin cutlets, about 1/2 inch thick. Alternatively, pound them to even thickness between plastic wrap.",
        "Set up a breading station: flour seasoned with salt and pepper in the first dish, beaten eggs in the second, breadcrumbs mixed with parmesan and Italian seasoning in the third.",
        "Pat chicken cutlets dry. Dredge in flour, shaking off excess. Dip in egg, letting excess drip off. Press firmly into breadcrumb mixture, coating both sides completely.",
        "Heat 1/4 inch of olive oil in a large oven-safe skillet over medium-high heat. Test with a breadcrumb—it should sizzle immediately.",
        "Cook the breaded chicken in batches for 2-3 minutes per side until golden brown. Don't crowd the pan. The chicken won't be cooked through yet—it will finish in the oven.",
        "If your skillet isn't oven-safe, transfer the browned cutlets to a baking sheet.",
        "Spoon marinara sauce over each piece of chicken, then top with shredded mozzarella. Make sure the cheese covers the edges.",
        "Bake for 15 minutes until the chicken is cooked through (165°F internal) and the cheese is melted, bubbly, and starting to brown.",
        "For extra browning on the cheese, broil for 1-2 minutes. Watch carefully to prevent burning.",
        "Garnish with fresh basil and extra parmesan. Serve over spaghetti with extra marinara on the side."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "chicken-parmesan",
      "cuisine": "italian"
    },
    {
      "name": "Vegetable Curry",
      "isForFamily": true,
      "dietTags": [
        "vegan",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 35,
      "description": "Warming vegan curry packed with vegetables in a rich coconut-tomato sauce.",
      "ingredients": [
        "1 can coconut milk",
        "1 can diced tomatoes",
        "2 cups cauliflower florets",
        "1 cup diced potatoes",
        "1 cup chickpeas",
        "1 onion, diced",
        "3 cloves garlic, minced",
        "2 tbsp curry powder",
        "1 tsp garam masala",
        "Fresh cilantro",
        "Basmati rice"
      ],
      "steps": [
        "Start the rice first: rinse 1 cup basmati until water runs clear. Cook with 1.5 cups water—once boiling, reduce heat, cover, and simmer 15 minutes.",
        "Cut the potatoes into 1/2-inch cubes. Break the cauliflower into small, similar-sized florets for even cooking.",
        "Heat 2 tablespoons oil in a large pot over medium heat. Add the diced onion and cook until soft and golden, about 5-6 minutes.",
        "Add the garlic, curry powder, and garam masala. Cook for 1 minute, stirring constantly, until the spices are fragrant and toasted.",
        "Add the diced tomatoes with their juices and stir to combine with the spiced onions. Let simmer for 2 minutes.",
        "Pour in the coconut milk and stir well. Add the potatoes, cauliflower, and chickpeas. Season with salt.",
        "Bring to a simmer, then reduce heat to medium-low. Cover and cook for 20-25 minutes, stirring occasionally, until the potatoes are tender.",
        "Taste and adjust seasoning—you may want more salt, a pinch of sugar to balance acidity, or a squeeze of lime for brightness.",
        "If the sauce is too thin, simmer uncovered for a few more minutes. If too thick, add a splash of water or vegetable broth.",
        "Serve over fluffy basmati rice, garnished generously with fresh cilantro. Warm naan bread is perfect for scooping up the sauce."
      ],
      "foodTags": [
        "vegan"
      ],
      "imageName": "vegetable-curry",
      "cuisine": "indian"
    },
    {
      "name": "Steak Fajitas",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Sizzling skillet fajitas with marinated steak, peppers, and onions served with warm tortillas.",
      "ingredients": [
        "1.5 lbs flank steak",
        "3 bell peppers (mixed colors), sliced",
        "2 onions, sliced",
        "Juice of 3 limes",
        "3 cloves garlic, minced",
        "2 tbsp olive oil",
        "2 tsp cumin",
        "1 tsp chili powder",
        "Flour or corn tortillas",
        "Sour cream, guacamole, salsa"
      ],
      "steps": [
        "Make the marinade: whisk together lime juice, olive oil, minced garlic, cumin, chili powder, 1 tsp salt, and pepper.",
        "Slice the flank steak against the grain into thin strips. Place in a bowl and pour the marinade over. Refrigerate for at least 30 minutes, or up to 4 hours.",
        "Slice the bell peppers and onions into thin strips. They should be about the same thickness for even cooking.",
        "Heat a large cast iron skillet over high heat until smoking. This is key for that restaurant-style sizzle and char.",
        "Remove steak from marinade, shaking off excess. Cook in batches without crowding—the meat should sear, not steam. Cook 2-3 minutes per side for medium. Transfer to a plate.",
        "Add a drizzle of oil to the same pan. Add the peppers and onions. Let them sit without stirring for 2 minutes to get some char, then stir and continue cooking for 4-5 minutes until slightly softened with charred edges.",
        "Return the steak to the pan with any accumulated juices. Toss everything together for 1 minute until combined and heated through.",
        "Warm the tortillas: wrap in foil and heat in a 350°F oven for 10 minutes, or heat individually in a dry skillet until pliable and slightly charred.",
        "Serve the fajitas sizzling hot, straight from the pan. Set out warm tortillas and all the toppings: sour cream, guacamole, salsa, shredded cheese, and lime wedges.",
        "Let everyone build their own fajitas. The communal, interactive style is part of what makes fajitas so fun."
      ],
      "foodTags": [
        "beef"
      ],
      "imageName": "steak-fajitas",
      "cuisine": "mexican"
    },
    {
      "name": "Lemon Herb Tilapia",
      "isForFamily": false,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 20,
      "description": "Light and flaky tilapia fillets with a bright lemon herb butter sauce.",
      "ingredients": [
        "4 tilapia fillets",
        "4 tbsp butter",
        "4 cloves garlic, minced",
        "Juice of 2 lemons",
        "2 tbsp fresh parsley, chopped",
        "1 tbsp fresh dill, chopped",
        "1/2 tsp paprika",
        "Salt & pepper",
        "Lemon slices for garnish"
      ],
      "steps": [
        "Pat the tilapia fillets completely dry with paper towels. Season both sides with salt, pepper, and paprika.",
        "Heat 2 tablespoons butter in a large non-stick skillet over medium-high heat until foaming and just starting to brown.",
        "Add the tilapia fillets to the pan. Cook without moving for 3-4 minutes until the bottom is golden and the fish releases easily from the pan.",
        "Carefully flip the fillets and cook for another 2-3 minutes until the fish is opaque throughout and flakes easily with a fork. Transfer to a serving plate.",
        "Reduce heat to medium. Add the remaining butter to the pan. Once melted, add the minced garlic and cook for 30 seconds until fragrant.",
        "Add the lemon juice to the pan—it will sizzle. Stir to combine with the butter and scrape up any browned bits from the fish.",
        "Remove from heat and stir in the fresh parsley and dill. Taste and adjust seasoning with salt and pepper.",
        "Spoon the lemon herb butter sauce generously over the tilapia fillets.",
        "Garnish with fresh lemon slices and additional herbs. Serve immediately while the fish is hot and the sauce is drizzling.",
        "Pairs beautifully with steamed vegetables, rice, or a simple green salad. The light, fresh flavors make this perfect for a healthy weeknight dinner."
      ],
      "foodTags": [
        "seafood"
      ],
      "imageName": "lemon-herb-tilapia",
      "cuisine": "mediterranean"
    },
    {
      "name": "Mushroom Stroganoff",
      "isForFamily": false,
      "dietTags": [
        "vegetarian"
      ],
      "chefLevels": [
        "sousChef"
      ],
      "cookTimeMinutes": 30,
      "description": "Creamy vegetarian stroganoff with a variety of mushrooms over egg noodles.",
      "ingredients": [
        "1 lb mixed mushrooms (cremini, shiitake, oyster)",
        "8 oz egg noodles",
        "1 onion, sliced",
        "4 cloves garlic, minced",
        "1 cup vegetable broth",
        "1 cup sour cream",
        "2 tbsp flour",
        "2 tbsp butter",
        "1 tbsp Worcestershire sauce (vegetarian)",
        "Fresh thyme",
        "Fresh parsley"
      ],
      "steps": [
        "Clean the mushrooms by wiping with a damp paper towel—don't wash them, as they'll absorb water. Slice into 1/4-inch pieces.",
        "Bring a large pot of salted water to a boil. Cook the egg noodles according to package directions. Drain and toss with a pat of butter.",
        "Heat 1 tablespoon butter in a large skillet over high heat. Add the mushrooms in a single layer. Don't stir for 3-4 minutes to allow browning.",
        "Stir the mushrooms, season with salt, and continue cooking until all sides are golden and they've released and reabsorbed their liquid, about 5 more minutes. Transfer to a plate.",
        "Reduce heat to medium. Add remaining butter and the sliced onion. Cook until soft and golden, about 5 minutes. Add garlic and cook 30 seconds.",
        "Sprinkle flour over the onions and stir constantly for 1 minute to cook out the raw flour taste.",
        "Gradually pour in the vegetable broth while stirring to prevent lumps. Add the Worcestershire sauce and fresh thyme. Simmer for 3-4 minutes until thickened.",
        "Remove from heat—this is important. Stir in the sour cream until smooth. Return the mushrooms and any juices to the pan.",
        "Gently warm over low heat if needed, but don't boil or the sour cream will curdle. Taste and adjust seasoning.",
        "Serve over the warm egg noodles, garnished with fresh parsley and extra thyme. A crack of black pepper finishes it perfectly."
      ],
      "foodTags": [
        "vegetarian"
      ],
      "imageName": "mushroom-stroganoff",
      "cuisine": "american"
    },
    {
      "name": "BBQ Pulled Chicken",
      "isForFamily": true,
      "dietTags": [
        "none",
        "glutenFree"
      ],
      "chefLevels": [
        "lineCook"
      ],
      "cookTimeMinutes": 40,
      "description": "Easy shredded BBQ chicken perfect for sandwiches, tacos, or salads.",
      "ingredients": [
        "2 lbs boneless chicken breasts or thighs",
        "1.5 cups BBQ sauce",
        "1/2 cup chicken broth",
        "2 tbsp brown sugar",
        "1 tbsp apple cider vinegar",
        "1 tsp smoked paprika",
        "1 tsp garlic powder",
        "1/2 tsp onion powder",
        "Brioche buns",
        "Coleslaw"
      ],
      "steps": [
        "Season the chicken on both sides with smoked paprika, garlic powder, onion powder, salt, and pepper.",
        "Place the seasoned chicken in a large pot or Dutch oven. Pour the chicken broth around the chicken.",
        "In a bowl, mix together the BBQ sauce, brown sugar, and apple cider vinegar. Pour half of this mixture over the chicken. Reserve the rest.",
        "Bring to a boil over medium-high heat, then immediately reduce to a simmer. Cover and cook for 25-30 minutes until the chicken is cooked through and very tender.",
        "Remove the chicken to a cutting board. It should be tender enough to shred easily. Use two forks to pull the meat apart into long shreds.",
        "Return the shredded chicken to the pot with the cooking liquid. Add the reserved BBQ sauce mixture and stir to combine.",
        "Simmer uncovered for 5-10 minutes, stirring occasionally, until the sauce thickens and coats the chicken. The chicken will absorb the flavors.",
        "Taste and adjust—add more BBQ sauce for stronger flavor, vinegar for tanginess, or brown sugar for sweetness.",
        "Toast the brioche buns under the broiler or in a dry skillet until golden.",
        "Pile the pulled chicken on the toasted buns and top with coleslaw for crunch. This also makes excellent tacos, nachos, quesadillas, or salad toppers."
      ],
      "foodTags": [
        "chicken"
      ],
      "imageName": "bbq-pulled-chicken",
      "cuisine": "american"
    },
    {
      "name": "Honey Garlic Glazed Salmon",
      "isForFamily": false,
      "dietTags": ["glutenFree"],
      "chefLevels": ["lineCook", "sousChef"],
      "cookTimeMinutes": 25,
      "description": "Pan-seared salmon fillets with a sweet and savory honey garlic glaze, finished with a squeeze of fresh lemon.",
      "ingredients": [
        "2 salmon fillets (6 oz each)",
        "3 tbsp honey",
        "2 tbsp soy sauce (or tamari for gluten-free)",
        "4 cloves garlic, minced",
        "1 tbsp olive oil",
        "1 tbsp butter",
        "Juice of 1 lemon",
        "Salt & pepper",
        "Fresh parsley for garnish"
      ],
      "steps": [
        "Remove salmon from refrigerator 15 minutes before cooking to bring to room temperature. Pat completely dry with paper towels and season generously with salt and pepper on both sides.",
        "In a small bowl, whisk together honey, soy sauce, and minced garlic until well combined. Set the glaze aside.",
        "Heat olive oil in a large non-stick or cast iron skillet over medium-high heat until shimmering. The pan should be hot enough that a drop of water sizzles immediately.",
        "Place salmon fillets skin-side up in the pan. Sear without moving for 3-4 minutes until a golden crust forms. The salmon should release easily from the pan when ready to flip.",
        "Flip the salmon to skin-side down. Reduce heat to medium and cook for another 3 minutes. The skin should crisp up nicely.",
        "Push salmon to one side of the pan. Add butter to the empty side and let it melt. Pour in the honey garlic glaze and let it bubble for 30 seconds.",
        "Spoon the glaze over the salmon repeatedly for 1-2 minutes, basting until the fish is cooked through and the glaze is thick and glossy.",
        "Remove from heat, squeeze fresh lemon juice over the top, and garnish with chopped parsley. Serve immediately over rice or with roasted vegetables."
      ],
      "foodTags": ["seafood"],
      "imageName": "honey-garlic-salmon",
      "cuisine": "asian"
    },
    {
      "name": "Classic Beef Stroganoff",
      "isForFamily": true,
      "dietTags": ["none"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 40,
      "description": "Tender strips of beef in a rich, creamy mushroom sauce served over egg noodles. A comforting family classic.",
      "ingredients": [
        "1.5 lbs beef sirloin, sliced thin",
        "8 oz cremini mushrooms, sliced",
        "1 large onion, diced",
        "3 cloves garlic, minced",
        "2 cups beef broth",
        "1 cup sour cream",
        "2 tbsp flour",
        "2 tbsp butter",
        "2 tbsp olive oil",
        "1 tbsp Worcestershire sauce",
        "1 tbsp Dijon mustard",
        "Salt & pepper",
        "12 oz egg noodles"
      ],
      "steps": [
        "Slice beef sirloin against the grain into thin 1/4-inch strips. Season generously with salt and pepper. Letting the meat sit at room temperature for 10 minutes helps it brown better.",
        "Heat 1 tablespoon each of butter and olive oil in a large skillet over high heat. Working in batches to avoid crowding, sear beef strips for 1-2 minutes per side until browned. Transfer to a plate and set aside.",
        "Reduce heat to medium. Add remaining butter and oil to the pan. Add sliced mushrooms in a single layer and cook without stirring for 3-4 minutes until golden brown on the bottom.",
        "Stir mushrooms and add diced onion. Cook for 5-6 minutes until onions are softened and translucent. Add minced garlic and cook 1 minute more until fragrant.",
        "Sprinkle flour over the vegetables and stir to coat. Cook for 1 minute to eliminate the raw flour taste. This creates the base for your creamy sauce.",
        "Gradually pour in beef broth while stirring constantly to prevent lumps. Add Worcestershire sauce and Dijon mustard. Bring to a simmer and cook for 5 minutes until sauce thickens.",
        "Meanwhile, cook egg noodles according to package directions. Drain and set aside.",
        "Reduce heat to low. Stir in sour cream until fully incorporateddon't let it boil or it may curdle. Return beef and any accumulated juices to the pan. Simmer 2-3 minutes until heated through.",
        "Taste and adjust seasoning. Serve stroganoff over hot egg noodles, garnished with fresh parsley if desired."
      ],
      "foodTags": ["beef"],
      "imageName": "beef-stroganoff",
      "cuisine": "american"
    },
    {
      "name": "Thai Basil Chicken (Pad Krapow)",
      "isForFamily": false,
      "dietTags": ["none"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 20,
      "description": "A quick and flavorful Thai street food classic with ground chicken, Thai basil, and a savory-sweet sauce, served over jasmine rice with a fried egg.",
      "ingredients": [
        "1 lb ground chicken",
        "4 cloves garlic, minced",
        "2-4 Thai chilies, sliced (adjust to taste)",
        "1 shallot, thinly sliced",
        "2 cups fresh Thai basil leaves",
        "2 tbsp oyster sauce",
        "1 tbsp soy sauce",
        "1 tbsp fish sauce",
        "1 tsp sugar",
        "2 tbsp vegetable oil",
        "4 eggs (for frying)",
        "Jasmine rice for serving"
      ],
      "steps": [
        "Prepare all ingredients before startingthis dish comes together very quickly. Mince garlic, slice chilies and shallot, and pick basil leaves from stems. Have your sauces measured and ready.",
        "In a small bowl, combine oyster sauce, soy sauce, fish sauce, and sugar. Stir until sugar dissolves. This is your flavor base.",
        "Heat a wok or large skillet over high heat until smoking. Add 1 tablespoon oil and swirl to coat. The high heat is essential for authentic wok hei (breath of the wok).",
        "Add garlic, chilies, and shallot. Stir-fry for 30 seconds until very fragrant but not burned. Keep everything moving in the pan.",
        "Add ground chicken, breaking it up with your spatula. Spread it in a thin layer and let it sear for 1 minute without stirring to develop browning. Then stir-fry for 2-3 minutes until cooked through.",
        "Pour in the sauce mixture. Toss everything together and cook for 1 minute until the sauce coats the chicken and reduces slightly.",
        "Remove from heat and immediately add Thai basil. Toss until just wiltedabout 30 seconds. The residual heat will wilt the basil perfectly.",
        "In a separate non-stick pan, fry eggs sunny-side up in remaining oil until whites are set but yolks are runny.",
        "Serve chicken over steamed jasmine rice, topped with a fried egg. The runny yolk creates an extra rich sauce when broken."
      ],
      "foodTags": ["chicken"],
      "imageName": "thai-basil-chicken",
      "cuisine": "asian"
    },
    {
      "name": "Mushroom and Spinach Risotto",
      "isForFamily": false,
      "dietTags": ["vegetarian", "glutenFree"],
      "chefLevels": ["sousChef", "executiveChef"],
      "cookTimeMinutes": 45,
      "description": "Creamy Arborio rice slowly cooked with earthy mushrooms, fresh spinach, and finished with Parmesan. A labor of love that's worth every stir.",
      "ingredients": [
        "1.5 cups Arborio rice",
        "8 oz mixed mushrooms (cremini, shiitake), sliced",
        "4 cups vegetable broth, kept warm",
        "1 cup dry white wine",
        "3 cups fresh spinach",
        "1 shallot, finely diced",
        "3 cloves garlic, minced",
        "1/2 cup grated Parmesan cheese",
        "3 tbsp butter, divided",
        "2 tbsp olive oil",
        "Fresh thyme leaves",
        "Salt & pepper"
      ],
      "steps": [
        "Heat vegetable broth in a saucepan and keep at a low simmer throughout cooking. Warm broth is essentialcold broth will shock the rice and result in uneven cooking.",
        "In a large, wide pan or Dutch oven, heat 1 tablespoon each butter and olive oil over medium-high heat. Add mushrooms in a single layer and cook without stirring for 3-4 minutes until deeply golden.",
        "Stir mushrooms, season with salt and thyme, and cook 2 minutes more. Transfer to a plate and set aside.",
        "In the same pan, add remaining olive oil. Saut shallot for 2-3 minutes until softened. Add garlic and cook 30 seconds until fragrant.",
        "Add Arborio rice and stir to coat every grain with oil. Toast for 1-2 minutes until the edges become slightly translucent. This step builds a nutty flavor foundation.",
        "Pour in white wine and stir constantly until fully absorbed. The alcohol will cook off, leaving behind a subtle acidity that brightens the dish.",
        "Begin adding warm broth one ladle at a time (about 1/2 cup), stirring frequently. Wait until each addition is almost fully absorbed before adding the next. This process takes 18-22 minutes.",
        "When rice is al dente and creamy (with a slight bite in the center), stir in spinach until wilted. Add reserved mushrooms, remaining butter, and Parmesan. Stir vigorously to create a creamy emulsion.",
        "Season with salt and pepper to taste. Serve immediately in warm bowlsrisotto waits for no one! Garnish with extra Parmesan and fresh thyme."
      ],
      "foodTags": ["vegetarian"],
      "imageName": "mushroom-risotto",
      "cuisine": "italian"
    },
    {
      "name": "Korean Beef Bulgogi Bowls",
      "isForFamily": true,
      "dietTags": ["none"],
      "chefLevels": ["lineCook", "sousChef"],
      "cookTimeMinutes": 35,
      "description": "Sweet and savory marinated beef served over rice with pickled vegetables, sesame seeds, and a drizzle of gochujang mayo.",
      "ingredients": [
        "1.5 lbs beef ribeye or sirloin, thinly sliced",
        "1 Asian pear or apple, grated",
        "1/4 cup soy sauce",
        "2 tbsp brown sugar",
        "1 tbsp sesame oil",
        "4 cloves garlic, minced",
        "1 inch ginger, grated",
        "1 tbsp vegetable oil",
        "4 cups cooked white rice",
        "Quick pickled cucumbers",
        "Kimchi for serving",
        "Sesame seeds and green onions for garnish"
      ],
      "steps": [
        "For tender bulgogi, freeze beef for 20 minutes before slicingthis firms it up for thin, even cuts. Slice against the grain into 1/8-inch strips.",
        "In a large bowl, combine grated pear (a natural tenderizer), soy sauce, brown sugar, sesame oil, garlic, and ginger. Whisk until sugar dissolves.",
        "Add sliced beef to the marinade, tossing to coat every piece. Cover and refrigerate for at least 30 minutes, or up to overnight for deeper flavor.",
        "While beef marinates, prepare quick pickled cucumbers: thinly slice 1 cucumber, toss with 2 tbsp rice vinegar, 1 tsp sugar, and a pinch of salt. Let sit while you cook.",
        "Heat a large cast iron skillet or grill pan over high heat until smoking. Working in batches to avoid crowding, cook beef for 1-2 minutes per side until caramelized and slightly charred.",
        "The sugars in the marinade will create beautiful caramelization. Don't move the beef too muchlet it develop color before flipping.",
        "Assemble bowls: Start with a base of warm white rice. Arrange bulgogi on one side, pickled cucumbers on another, and a generous scoop of kimchi.",
        "Garnish with toasted sesame seeds and sliced green onions. Drizzle with additional sesame oil or gochujang mayo if desired. Mix everything together before eating for the full experience."
      ],
      "foodTags": ["beef"],
      "imageName": "bulgogi-bowl",
      "cuisine": "asian"
    },
    {
      "name": "Mediterranean Chickpea Bowls",
      "isForFamily": true,
      "dietTags": ["vegan", "glutenFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 25,
      "description": "Roasted spiced chickpeas over fluffy quinoa with cucumber, tomatoes, red onion, and a creamy tahini dressing. Fresh, healthy, and satisfying.",
      "ingredients": [
        "2 cans (15 oz) chickpeas, drained and rinsed",
        "1 cup quinoa",
        "1 English cucumber, diced",
        "1 pint cherry tomatoes, halved",
        "1/2 red onion, thinly sliced",
        "1/4 cup tahini",
        "2 tbsp lemon juice",
        "2 tbsp olive oil",
        "1 tsp cumin",
        "1 tsp paprika",
        "1/2 tsp garlic powder",
        "Fresh parsley and mint",
        "Salt & pepper"
      ],
      "steps": [
        "Preheat oven to 425F (220C). Line a baking sheet with parchment paper.",
        "Pat chickpeas very dry with paper towelsthis is crucial for crispiness. Any moisture will steam instead of roast. Spread on prepared baking sheet.",
        "Drizzle chickpeas with 1 tablespoon olive oil. Sprinkle with cumin, paprika, garlic powder, salt, and pepper. Toss to coat evenly.",
        "Roast for 25-30 minutes, shaking the pan halfway through, until chickpeas are golden and crispy. They'll crisp up more as they cool.",
        "Meanwhile, cook quinoa according to package directions. Fluff with a fork and season with a pinch of salt. Keep warm.",
        "Make tahini dressing: Whisk together tahini, lemon juice, remaining olive oil, and 2-3 tablespoons water until smooth and pourable. Season with salt.",
        "Prepare vegetables: Dice cucumber, halve tomatoes, and thinly slice red onion. Roughly chop fresh parsley and mint.",
        "Assemble bowls: Start with a bed of quinoa, top with roasted chickpeas, and arrange cucumber, tomatoes, and red onion around the edges.",
        "Drizzle generously with tahini dressing, scatter fresh herbs over the top, and serve immediately. The warm chickpeas against the cool vegetables create a perfect contrast."
      ],
      "foodTags": ["vegan"],
      "imageName": "mediterranean-chickpea-bowl",
      "cuisine": "mediterranean"
    },
    {
      "name": "Crispy Parmesan Pork Chops",
      "isForFamily": true,
      "dietTags": ["none"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 30,
      "description": "Juicy bone-in pork chops with a crispy Parmesan and herb crust, pan-seared to golden perfection. Simple enough for weeknights, impressive enough for company.",
      "ingredients": [
        "4 bone-in pork chops (1 inch thick)",
        "1 cup grated Parmesan cheese",
        "1/2 cup panko breadcrumbs",
        "1 tsp Italian seasoning",
        "1/2 tsp garlic powder",
        "2 eggs, beaten",
        "1/2 cup flour",
        "3 tbsp olive oil",
        "2 tbsp butter",
        "Fresh lemon wedges",
        "Salt & pepper"
      ],
      "steps": [
        "Remove pork chops from refrigerator 20 minutes before cooking. Pat completely dry with paper towels and season both sides generously with salt and pepper.",
        "Set up a breading station with three shallow dishes: flour in the first, beaten eggs in the second, and a mixture of Parmesan, panko, Italian seasoning, and garlic powder in the third.",
        "Dredge each pork chop in flour, shaking off excess. Dip in egg, letting excess drip off. Press firmly into Parmesan mixture, coating both sides well. The coating should be thick and even.",
        "Heat olive oil and butter in a large oven-safe skillet over medium heat until the butter stops foaming. The combination of oil and butter gives great flavor without burning.",
        "Carefully place breaded pork chops in the pan. Cook undisturbed for 4-5 minutes until the bottom is deeply golden and crispy. Resist the urge to move them!",
        "Flip pork chops and transfer the entire skillet to a 400F (200C) oven. Bake for 8-10 minutes until internal temperature reaches 145F (63C).",
        "Remove from oven and let rest for 5 minutes. The temperature will continue rising 5-10 degrees while resting, and juices will redistribute.",
        "Serve immediately with fresh lemon wedges for squeezing. Pairs beautifully with a simple arugula salad or roasted vegetables."
      ],
      "foodTags": ["pork"],
      "imageName": "parmesan-pork-chops",
      "cuisine": "italian"
    },
    {
      "name": "Spicy Black Bean Tacos",
      "isForFamily": true,
      "dietTags": ["vegan", "glutenFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 20,
      "description": "Smoky, spiced black beans piled into warm corn tortillas with fresh pico de gallo, creamy avocado, and a squeeze of lime. Quick, cheap, and incredibly delicious.",
      "ingredients": [
        "2 cans (15 oz) black beans, drained",
        "1 tbsp olive oil",
        "1 tsp cumin",
        "1 tsp chili powder",
        "1/2 tsp smoked paprika",
        "1/4 tsp cayenne pepper",
        "8 small corn tortillas",
        "2 ripe avocados, sliced",
        "1 cup fresh pico de gallo",
        "Fresh cilantro",
        "2 limes, cut into wedges",
        "Hot sauce to taste"
      ],
      "steps": [
        "Heat olive oil in a large skillet over medium heat. Add drained black beans, cumin, chili powder, smoked paprika, and cayenne. Stir to coat beans with spices.",
        "Cook for 5-7 minutes, stirring occasionally, until beans are heated through and spices are fragrant. Use a fork or potato masher to roughly mash about half the beans, leaving some whole for texture.",
        "Add 2-3 tablespoons of water if beans seem dry. Season with salt to taste. Keep warm over low heat while you prepare toppings.",
        "Warm corn tortillas: Stack and wrap in damp paper towels, then microwave for 30 seconds. Alternatively, char directly over a gas flame for smoky flavor.",
        "Slice avocados and prepare fresh pico de gallo if you haven't already. Rough chop cilantro.",
        "Assemble tacos: Spoon a generous amount of spiced black beans into each warm tortilla. The beans should be the stardon't be shy!",
        "Top with sliced avocado, a spoonful of fresh pico de gallo, and a sprinkle of cilantro.",
        "Serve immediately with lime wedges for squeezing and your favorite hot sauce on the side. These tacos are best eaten immediately while the tortillas are warm and pliable."
      ],
      "foodTags": ["vegan"],
      "imageName": "black-bean-tacos",
      "cuisine": "mexican"
    },
    {
      "name": "Lemon Herb Roasted Chicken Thighs",
      "isForFamily": true,
      "dietTags": ["glutenFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 45,
      "description": "Crispy-skinned chicken thighs roasted with lemon, garlic, and fresh herbs. The secret is starting skin-side down in a cold pan for maximum crispiness.",
      "ingredients": [
        "6 bone-in, skin-on chicken thighs",
        "2 lemons (1 juiced, 1 sliced)",
        "6 cloves garlic, smashed",
        "4 sprigs fresh rosemary",
        "4 sprigs fresh thyme",
        "3 tbsp olive oil",
        "1 tsp dried oregano",
        "Salt & pepper",
        "Fresh parsley for garnish"
      ],
      "steps": [
        "Remove chicken from refrigerator 30 minutes before cooking. Pat skin completely dry with paper towelsthis is the key to crispy skin. Season generously with salt, pepper, and dried oregano.",
        "Place chicken thighs skin-side down in a COLD oven-safe skillet or cast iron pan. Starting cold allows the fat to render slowly, resulting in supremely crispy skin.",
        "Turn heat to medium and cook without moving for 12-15 minutes. The fat will render and the skin will turn deep golden brown. Don't peek or press!",
        "While chicken cooks, preheat oven to 425F (220C). Combine olive oil, lemon juice, smashed garlic, rosemary, and thyme in a small bowl.",
        "Once skin is golden and crispy, flip chicken thighs skin-side up. Tuck lemon slices and herb sprigs around and under the chicken. Pour garlic-oil mixture over the top.",
        "Transfer skillet to preheated oven. Roast for 20-25 minutes until internal temperature reaches 165F (74C) and juices run clear.",
        "Remove from oven and let rest 5 minutes in the pan. The chicken will continue cooking slightly and juices will redistribute.",
        "Serve chicken thighs with the roasted lemons and garlic, spooning pan juices over the top. Garnish with fresh parsley. Amazing with mashed potatoes or crusty bread to soak up the juices."
      ],
      "foodTags": ["chicken"],
      "imageName": "lemon-herb-chicken",
      "cuisine": "mediterranean"
    },
    {
      "name": "Creamy Tuscan Shrimp Pasta",
      "isForFamily": false,
      "dietTags": ["none"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 30,
      "description": "Succulent shrimp in a garlicky sun-dried tomato and spinach cream sauce, tossed with penne. Restaurant-quality in under 30 minutes.",
      "ingredients": [
        "1 lb large shrimp, peeled and deveined",
        "12 oz penne pasta",
        "1/2 cup sun-dried tomatoes, chopped",
        "3 cups fresh spinach",
        "4 cloves garlic, minced",
        "1 cup heavy cream",
        "1/2 cup chicken broth",
        "1/2 cup grated Parmesan cheese",
        "2 tbsp olive oil",
        "1 tbsp butter",
        "1 tsp Italian seasoning",
        "Red pepper flakes",
        "Salt & pepper"
      ],
      "steps": [
        "Bring a large pot of salted water to boil. Cook penne according to package directions until al dente. Reserve 1/2 cup pasta water before draining.",
        "While pasta cooks, pat shrimp completely dry and season with salt, pepper, and a pinch of Italian seasoning.",
        "Heat olive oil in a large skillet over medium-high heat. Add shrimp in a single layer and cook 1-2 minutes per side until pink and just cooked through. Don't overcook! Transfer to a plate.",
        "Reduce heat to medium. Add butter to the same skillet. Once melted, add minced garlic and cook for 30 seconds until fragrant.",
        "Add sun-dried tomatoes and cook for 1 minute. Pour in heavy cream and chicken broth. Bring to a simmer and cook for 3-4 minutes until sauce starts to thicken.",
        "Add spinach to the sauce and stir until wilted, about 1-2 minutes. The vibrant green against the creamy sauce looks beautiful.",
        "Stir in Parmesan cheese and remaining Italian seasoning. Add red pepper flakes to taste. If sauce is too thick, add reserved pasta water a splash at a time.",
        "Add drained pasta and cooked shrimp to the skillet. Toss everything together until pasta is well coated and shrimp are warmed through.",
        "Serve immediately in warm bowls, topped with extra Parmesan and fresh cracked pepper. A glass of crisp white wine is highly recommended!"
      ],
      "foodTags": ["seafood"],
      "imageName": "tuscan-shrimp-pasta",
      "cuisine": "italian"
    },
    {
      "name": "Vegan Ramen with Miso Broth",
      "isForFamily": false,
      "dietTags": ["vegan", "dairyFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 60,
      "description": "A deeply flavorful plant-based ramen featuring a rich miso and mushroom broth, silky noodles, and an array of perfectly prepared toppings including crispy tofu and marinated soft-boiled eggs alternative.",
      "ingredients": [
        "8 oz ramen noodles",
        "6 cups vegetable broth",
        "4 oz shiitake mushrooms, sliced",
        "3 tbsp white miso paste",
        "2 tbsp soy sauce",
        "1 tbsp sesame oil",
        "1 block firm tofu, cubed",
        "2 cups bok choy, halved",
        "1 cup corn kernels",
        "4 green onions, sliced",
        "2 cloves garlic, minced",
        "1 inch ginger, sliced",
        "Nori sheets for garnish",
        "Chili oil to taste",
        "Sesame seeds"
      ],
      "steps": [
        "Start the broth: In a large pot, heat 1 tablespoon sesame oil over medium heat. Add sliced ginger and garlic, saut for 2 minutes until fragrant but not browned.",
        "Add shiitake mushrooms to the pot and cook for 5 minutes until they release their liquid and begin to brown. This builds an umami foundation for your broth.",
        "Pour in vegetable broth and bring to a simmer. Let it cook for 20-25 minutes to develop deep flavor. The broth should reduce slightly and become more concentrated.",
        "While broth simmers, prepare the crispy tofu. Press tofu for 10 minutes, then cut into 1-inch cubes. Toss with 1 tbsp soy sauce and cornstarch.",
        "Heat remaining sesame oil in a non-stick pan over medium-high heat. Fry tofu cubes until golden and crispy on all sides, about 8-10 minutes total. Set aside.",
        "Blanch bok choy in boiling water for 2 minutes until tender-crisp. Remove and set aside. Use the same water to cook ramen noodles according to package directions.",
        "Strain the broth to remove ginger and garlic. Return to pot over low heat. Whisk in miso paste and remaining soy sauce. Do not boil after adding miso as it kills beneficial enzymes.",
        "Divide noodles between deep bowls. Ladle hot miso broth over noodles. Arrange toppings artfully: crispy tofu, bok choy, corn, and green onions.",
        "Garnish with torn nori sheets, a drizzle of chili oil, and sesame seeds. Serve immediately while steaming hot. Slurp loudlyit's encouraged!"
      ],
      "foodTags": ["vegetarian"],
      "imageName": "vegan-miso-ramen",
      "cuisine": "asian"
    },
    {
      "name": "Stuffed Acorn Squash with Wild Rice",
      "isForFamily": true,
      "dietTags": ["vegan", "glutenFree", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 55,
      "description": "Roasted acorn squash halves filled with a hearty mixture of wild rice, cranberries, pecans, and autumn spices. A stunning centerpiece for any plant-based meal.",
      "ingredients": [
        "2 acorn squash, halved and seeded",
        "1 cup wild rice blend",
        "1/2 cup dried cranberries",
        "1/2 cup pecans, chopped",
        "1 small onion, diced",
        "2 celery stalks, diced",
        "3 cloves garlic, minced",
        "2 cups vegetable broth",
        "2 tbsp olive oil",
        "2 tbsp maple syrup",
        "1 tsp dried sage",
        "1/2 tsp cinnamon",
        "Salt & pepper",
        "Fresh parsley for garnish"
      ],
      "steps": [
        "Preheat oven to 400F (200C). Cut acorn squash in half through the stem and scoop out seeds. Brush cut sides with 1 tbsp olive oil and season with salt and pepper.",
        "Place squash cut-side down on a lined baking sheet. Roast for 35-40 minutes until tender when pierced with a fork. The skin should be slightly caramelized.",
        "Meanwhile, cook wild rice in vegetable broth according to package directions. Wild rice takes longer than white riceusually 45-50 minutes. It should be chewy but tender.",
        "While rice cooks, heat remaining olive oil in a large skillet over medium heat. Saut onion and celery until softened, about 5-6 minutes.",
        "Add garlic, sage, and cinnamon to the vegetables. Cook for 1 minute until very fragrant. The kitchen should smell like autumn.",
        "Combine cooked rice with the sauted vegetables. Fold in cranberries and pecans. Drizzle with maple syrup and season generously with salt and pepper.",
        "Flip roasted squash halves cut-side up. Mound the wild rice filling into each cavity, pressing gently to pack it in. You can pile it highthe squash is your bowl!",
        "Return stuffed squash to the oven for 10-15 minutes to warm the filling and allow flavors to meld together.",
        "Garnish with fresh parsley and an extra drizzle of maple syrup if desired. Serve immediately. Each person gets their own edible bowl!"
      ],
      "foodTags": ["vegetarian"],
      "imageName": "stuffed-acorn-squash",
      "cuisine": "american"
    },
    {
      "name": "Vegan Tikka Masala",
      "isForFamily": false,
      "dietTags": ["vegan", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 45,
      "description": "All the warming spices and creamy comfort of traditional tikka masala, made entirely plant-based with crispy baked tofu and rich coconut cream sauce.",
      "ingredients": [
        "1 block extra-firm tofu, pressed and cubed",
        "1 can (14 oz) coconut cream",
        "1 can (14 oz) crushed tomatoes",
        "1 large onion, diced",
        "4 cloves garlic, minced",
        "2 inch ginger, grated",
        "2 tbsp garam masala",
        "1 tbsp curry powder",
        "1 tsp turmeric",
        "1 tsp cumin",
        "1/2 tsp cayenne pepper",
        "3 tbsp vegetable oil",
        "2 tbsp tomato paste",
        "Fresh cilantro",
        "Basmati rice for serving"
      ],
      "steps": [
        "Press tofu for at least 15 minutes to remove excess water. Cut into 1-inch cubes and toss with 1 tbsp oil, 1 tsp garam masala, and a pinch of salt.",
        "Preheat oven to 425F (220C). Spread tofu on a lined baking sheet in a single layer. Bake for 25-30 minutes, flipping halfway, until golden and crispy on all edges.",
        "While tofu bakes, heat remaining oil in a large deep skillet over medium heat. Add diced onion and cook for 8-10 minutes until golden and caramelized.",
        "Add garlic and ginger to the onions. Cook for 2 minutes, stirring constantly, until incredibly fragrant. This aromatic base is crucial for authentic flavor.",
        "Add remaining garam masala, curry powder, turmeric, cumin, and cayenne. Toast the spices in the oil for 1 minutethey should sizzle and become very aromatic.",
        "Stir in tomato paste, coating the onions and spices. Add crushed tomatoes and stir to combine. Simmer for 10 minutes until sauce thickens.",
        "Pour in coconut cream and stir until fully incorporated. The sauce should turn a beautiful orange-red color. Simmer for another 5 minutes.",
        "Add the crispy baked tofu to the sauce, stirring gently to coat each piece without breaking them. Let simmer for 5 minutes so tofu absorbs the flavors.",
        "Taste and adjust seasoning. Serve over fluffy basmati rice, garnished generously with fresh cilantro. Warm naan bread on the side completes the experience."
      ],
      "foodTags": ["vegetarian"],
      "imageName": "vegan-tikka-masala",
      "cuisine": "indian"
    },
    {
      "name": "Cauliflower Tacos al Pastor",
      "isForFamily": true,
      "dietTags": ["vegan", "glutenFree", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 40,
      "description": "Smoky, charred cauliflower marinated in traditional al pastor spices with caramelized pineapple, served in warm tortillas with all the classic toppings.",
      "ingredients": [
        "1 large head cauliflower, cut into florets",
        "1 cup fresh pineapple chunks",
        "3 dried guajillo chiles",
        "2 chipotle peppers in adobo",
        "4 cloves garlic",
        "1/2 cup orange juice",
        "2 tbsp apple cider vinegar",
        "1 tbsp achiote paste",
        "1 tsp cumin",
        "1 tsp oregano",
        "8 corn tortillas",
        "1/2 white onion, diced",
        "Fresh cilantro",
        "Lime wedges",
        "Salsa verde"
      ],
      "steps": [
        "Toast dried guajillo chiles in a dry skillet for 1-2 minutes until fragrant and pliable. Remove stems and seeds, then soak in hot water for 15 minutes.",
        "Drain chiles and add to a blender with chipotle peppers, garlic, orange juice, vinegar, achiote paste, cumin, and oregano. Blend until completely smooth.",
        "Cut cauliflower into large florets, keeping some flat edges for better charring. Place in a large bowl and pour the al pastor marinade over. Toss to coat evenly.",
        "Let cauliflower marinate for at least 20 minutes at room temperature, or up to overnight in the refrigerator for deeper flavor penetration.",
        "Preheat oven to 425F (220C). Spread marinated cauliflower on a lined baking sheet in a single layer. Roast for 25-30 minutes until charred at the edges and tender.",
        "Add pineapple chunks to another section of the baking sheet during the last 10 minutes of roasting. They should caramelize and get beautiful grill marks.",
        "Warm corn tortillas directly over a gas flame or in a dry skillet until slightly charred and pliable. Keep warm wrapped in a clean kitchen towel.",
        "Roughly chop the roasted pineapple and mix with some of the cauliflower. The sweet and smoky combination is magical.",
        "Assemble tacos: pile cauliflower and pineapple onto warm tortillas. Top with diced onion, fresh cilantro, a squeeze of lime, and salsa verde. Serve immediately!"
      ],
      "foodTags": ["vegetarian"],
      "imageName": "cauliflower-al-pastor",
      "cuisine": "mexican"
    },
    {
      "name": "Vegan Bolognese with Walnut Meat",
      "isForFamily": true,
      "dietTags": ["vegan", "dairyFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 35,
      "description": "A hearty plant-based take on the Italian classic, using savory walnut 'meat' and mushrooms to create a rich, satisfying sauce that even meat-lovers will enjoy.",
      "ingredients": [
        "2 cups raw walnuts",
        "8 oz cremini mushrooms, finely diced",
        "1 can (28 oz) crushed tomatoes",
        "1 large onion, finely diced",
        "2 carrots, finely diced",
        "2 celery stalks, finely diced",
        "4 cloves garlic, minced",
        "1/2 cup red wine",
        "2 tbsp tomato paste",
        "2 tbsp soy sauce",
        "1 tbsp olive oil",
        "1 tsp dried oregano",
        "1 tsp dried basil",
        "1 lb spaghetti",
        "Fresh basil for garnish"
      ],
      "steps": [
        "Pulse walnuts in a food processor until they resemble ground meatcrumbly but not powdery. About 10-15 quick pulses. Set aside.",
        "Heat olive oil in a large Dutch oven over medium heat. Add the onion, carrots, and celery (this classic combo is called soffritto). Cook for 8-10 minutes until very soft.",
        "Add diced mushrooms to the pot and cook for 5-6 minutes until they release their liquid and start to brown. Mushrooms add incredible meaty umami flavor.",
        "Add garlic, oregano, and basil. Cook for 1 minute until fragrant. Stir in tomato paste and cook another minute, coating the vegetables.",
        "Pour in red wine and let it simmer for 2-3 minutes, scraping up any browned bits from the bottom of the pot. The alcohol will cook off.",
        "Add the pulsed walnuts and soy sauce. The soy sauce adds depth and umami that mimics the savory quality of meat. Stir to combine.",
        "Pour in crushed tomatoes and stir everything together. Reduce heat to low and simmer for 15-20 minutes, stirring occasionally, until thick and rich.",
        "Meanwhile, cook spaghetti in well-salted boiling water until al dente. Reserve 1 cup pasta water before draining.",
        "Toss hot pasta with the bolognese sauce, adding pasta water as needed to achieve your desired consistency. Serve in warm bowls topped with fresh basil."
      ],
      "foodTags": ["vegetarian"],
      "imageName": "vegan-bolognese",
      "cuisine": "italian"
    },
    {
      "name": "Thai Peanut Lettuce Wraps",
      "isForFamily": false,
      "dietTags": ["vegan", "glutenFree", "dairyFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 20,
      "description": "Fresh, crunchy butter lettuce cups filled with a spiced peanut-vegetable mixture, topped with herbs and a drizzle of sweet chili sauce. Light yet satisfying.",
      "ingredients": [
        "1 head butter lettuce, leaves separated",
        "1 block firm tofu, crumbled",
        "1 cup shredded carrots",
        "1 red bell pepper, finely diced",
        "4 green onions, sliced",
        "1/2 cup roasted peanuts, chopped",
        "1/4 cup peanut butter",
        "2 tbsp soy sauce",
        "1 tbsp rice vinegar",
        "1 tbsp sesame oil",
        "1 tbsp sriracha",
        "2 cloves garlic, minced",
        "1 inch ginger, grated",
        "Fresh mint and cilantro",
        "Lime wedges"
      ],
      "steps": [
        "Whisk together peanut butter, soy sauce, rice vinegar, sriracha, and 2 tablespoons warm water until smooth. This is your flavor-packed sauce.",
        "Press tofu for 10 minutes, then crumble it into small pieces with your hands. You want a ground meat-like texture.",
        "Heat sesame oil in a large skillet over medium-high heat. Add crumbled tofu and cook, stirring occasionally, for 5-6 minutes until golden and slightly crispy.",
        "Add garlic and ginger to the tofu. Cook for 1 minute until very fragrant. The aroma should be intoxicating.",
        "Add shredded carrots and diced bell pepper. Cook for 2-3 minutes until vegetables are tender-crisp. They should still have some bite.",
        "Pour the peanut sauce over the tofu mixture and toss to coat everything evenly. Cook for another minute until sauce thickens slightly.",
        "Meanwhile, wash and dry butter lettuce leaves. Choose the cup-shaped leaves for easy filling and eating.",
        "Spoon the warm peanut-tofu mixture into lettuce cups. Top with sliced green onions, chopped peanuts, and fresh herbs.",
        "Serve immediately with lime wedges on the side for squeezing. These are best eaten right away while the filling is warm and the lettuce is crisp!"
      ],
      "foodTags": ["vegetarian"],
      "imageName": "thai-peanut-wraps",
      "cuisine": "asian"
    },
    {
      "name": "Moroccan Vegetable Tagine",
      "isForFamily": true,
      "dietTags": ["vegan", "glutenFree", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 50,
      "description": "A fragrant North African stew featuring chickpeas, root vegetables, and dried fruits simmered in aromatic spices. Served over fluffy couscous with preserved lemon.",
      "ingredients": [
        "1 can (15 oz) chickpeas, drained",
        "2 sweet potatoes, cubed",
        "2 carrots, sliced",
        "1 zucchini, cubed",
        "1 large onion, diced",
        "4 cloves garlic, minced",
        "1 can (14 oz) diced tomatoes",
        "2 cups vegetable broth",
        "1/2 cup dried apricots, halved",
        "2 tbsp olive oil",
        "2 tsp cumin",
        "2 tsp coriander",
        "1 tsp cinnamon",
        "1 tsp turmeric",
        "1/2 tsp cayenne",
        "Couscous for serving",
        "Fresh cilantro and mint",
        "Sliced almonds"
      ],
      "steps": [
        "Heat olive oil in a large Dutch oven or tagine pot over medium heat. Add diced onion and cook for 5-6 minutes until softened and golden.",
        "Add garlic, cumin, coriander, cinnamon, turmeric, and cayenne. Stir constantly for 1-2 minutes until spices are toasted and incredibly fragrant. This blooms the spices.",
        "Add sweet potatoes and carrots to the pot, stirring to coat in the spiced oil. These hearty vegetables need the longest cooking time.",
        "Pour in diced tomatoes and vegetable broth. Bring to a boil, then reduce heat to low. Cover and simmer for 20 minutes.",
        "Add zucchini, chickpeas, and dried apricots to the pot. The apricots add a traditional Moroccan sweetness that balances the spices beautifully.",
        "Continue simmering covered for another 15-20 minutes until all vegetables are tender and the sauce has thickened. Stir occasionally to prevent sticking.",
        "Meanwhile, prepare couscous according to package directions. Fluff with a fork and keep warm.",
        "Taste the tagine and adjust seasoning with salt. The balance of sweet, savory, and spice should be harmonious.",
        "Serve tagine over fluffy couscous, garnished with fresh cilantro, mint leaves, and toasted sliced almonds. A squeeze of preserved lemon elevates it further."
      ],
      "foodTags": ["vegetarian"],
      "imageName": "moroccan-tagine",
      "cuisine": "mediterranean"
    },
    {
      "name": "Jackfruit Pulled Pork Bowls",
      "isForFamily": true,
      "dietTags": ["vegan", "glutenFree", "dairyFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 35,
      "description": "Young jackfruit shredded and simmered in smoky BBQ sauce, served over creamy coleslaw and rice. The texture is remarkably similar to real pulled pork!",
      "ingredients": [
        "2 cans (20 oz each) young jackfruit in water, drained",
        "1 cup BBQ sauce",
        "2 tbsp olive oil",
        "1 onion, sliced",
        "3 cloves garlic, minced",
        "1 tbsp smoked paprika",
        "1 tsp cumin",
        "1/2 tsp cayenne",
        "4 cups coleslaw mix",
        "1/4 cup vegan mayo",
        "2 tbsp apple cider vinegar",
        "1 tbsp maple syrup",
        "Cooked rice for serving",
        "Pickled jalapeos",
        "Fresh cilantro"
      ],
      "steps": [
        "Drain and rinse jackfruit. Remove any hard core pieces and seeds. Using your hands or two forks, shred the jackfruit into pulled pork-like strands.",
        "Heat olive oil in a large skillet over medium-high heat. Add sliced onion and cook for 5 minutes until softened and starting to caramelize.",
        "Add shredded jackfruit to the skillet. Spread in an even layer and let it cook undisturbed for 3-4 minutes to develop some browning and texture.",
        "Add garlic, smoked paprika, cumin, and cayenne. Stir to coat the jackfruit in the spices. Cook for 1-2 minutes until fragrant.",
        "Pour BBQ sauce over the jackfruit and stir to combine. Reduce heat to medium-low and simmer for 15-20 minutes, stirring occasionally, until sauce is thick and jackfruit is very tender.",
        "While jackfruit simmers, make the slaw. Whisk together vegan mayo, apple cider vinegar, and maple syrup. Toss with coleslaw mix until evenly coated. Season with salt and pepper.",
        "Use two forks to shred the jackfruit even more as it cooksit should pull apart easily into stringy pieces just like pork.",
        "Build your bowls: start with a base of rice, add a generous portion of creamy slaw, and top with smoky pulled jackfruit.",
        "Garnish with pickled jalapeos and fresh cilantro. Serve immediatelythese bowls are best enjoyed fresh and warm!"
      ],
      "foodTags": ["vegetarian"],
      "imageName": "jackfruit-pulled-pork",
      "cuisine": "american"
    },
    {
      "name": "Beef Wellington",
      "isForFamily": true,
      "dietTags": ["none"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 120,
      "description": "The ultimate showstopper: tender beef tenderloin wrapped in savory mushroom duxelles, prosciutto, and golden puff pastry. A true test of culinary skill.",
      "ingredients": [
        "2 lb beef tenderloin, trimmed",
        "1 lb cremini mushrooms",
        "8 slices prosciutto",
        "1 sheet puff pastry, thawed",
        "4 tbsp Dijon mustard",
        "4 tbsp butter",
        "4 shallots, minced",
        "4 cloves garlic, minced",
        "1/2 cup dry white wine",
        "2 tbsp fresh thyme",
        "1 egg, beaten",
        "Kosher salt & pepper",
        "2 tbsp vegetable oil",
        "Flaky sea salt for finishing"
      ],
      "steps": [
        "Season beef tenderloin generously with salt and pepper. Heat oil in a cast iron skillet over high heat until smoking. Sear beef on all sides until deep golden brown, about 2 minutes per side.",
        "Remove beef from skillet and brush all over with Dijon mustard. Let cool completely while you prepare the duxellesthis is crucial for crispy pastry.",
        "Pulse mushrooms in a food processor until very finely chopped. Work in batches if needed. The texture should be almost paste-like.",
        "Melt butter in a large skillet over medium-high heat. Add shallots and cook for 3 minutes. Add mushrooms and cook, stirring often, for 15-20 minutes until all moisture evaporates. This step cannot be rushed!",
        "Add garlic, wine, and thyme to the mushrooms. Continue cooking until mixture is dry and holds together. Season well with salt and pepper. Let cool completely.",
        "Lay plastic wrap on your work surface. Shingle prosciutto slices to create a rectangle large enough to wrap the beef. Spread cooled duxelles evenly over prosciutto.",
        "Place cooled beef at one end and roll tightly using the plastic wrap to create a tight cylinder. Twist ends like a candy wrapper. Refrigerate for 30 minutes to set.",
        "Roll puff pastry to 1/8-inch thickness. Unwrap the beef log and place at edge of pastry. Roll up tightly, trim excess, and seal edges with beaten egg. Score decorative pattern on top.",
        "Brush entire surface with egg wash. Chill for 15 minutes. Bake at 425F for 25-30 minutes until pastry is golden and internal temp reaches 125F for medium-rare. Rest 10 minutes before slicing."
      ],
      "foodTags": ["beef"],
      "imageName": "beef-wellington",
      "cuisine": "american"
    },
    {
      "name": "Homemade Tonkotsu Ramen",
      "isForFamily": false,
      "dietTags": ["none", "dairyFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 180,
      "description": "Rich, creamy pork bone broth simmered for hours until milky white, topped with chashu pork, soft-boiled egg, and all the traditional fixings. Restaurant-quality at home.",
      "ingredients": [
        "3 lb pork neck bones",
        "1 lb pork fatback",
        "1 lb pork belly for chashu",
        "4 eggs",
        "Fresh ramen noodles",
        "1 onion, halved",
        "1 head garlic, halved",
        "3 inch ginger, sliced",
        "1/2 cup soy sauce",
        "1/2 cup mirin",
        "2 tbsp sake",
        "Green onions",
        "Nori sheets",
        "Sesame seeds",
        "Chili oil"
      ],
      "steps": [
        "Place pork bones in a large pot, cover with cold water, and bring to a boil. Boil for 10 minutes to remove impurities. Drain, rinse bones, and scrub pot clean. This step is essential for clean flavor.",
        "Return bones to clean pot with fatback, onion, garlic, and ginger. Cover with 12 cups water. Bring to a rolling boil, then reduce to a vigorous simmer.",
        "Simmer broth for 3-4 hours, maintaining a strong simmerthe agitation is what creates the creamy white color. Add water as needed to keep bones covered. Stir occasionally, breaking down the fat.",
        "Meanwhile, prepare chashu: roll pork belly tightly and tie with kitchen twine. Sear in a hot pan until browned on all sides.",
        "Combine soy sauce, mirin, and sake in a pot. Add seared pork belly, cover, and braise at 275F for 2-3 hours until very tender. Let cool in the braising liquid.",
        "Make marinated eggs: soft-boil eggs for exactly 6.5 minutes. Ice bath immediately. Peel carefully and marinate in leftover chashu braising liquid for at least 2 hours.",
        "Strain broth through a fine-mesh sieve, pressing on solids. You should have about 8 cups of creamy, opaque white broth. Season with salt to taste.",
        "Cook ramen noodles according to package directions. Slice chashu into 1/4-inch rounds. Halve the marinated eggs.",
        "Assemble bowls: hot broth, drained noodles, sliced chashu, halved egg, green onions, nori, sesame seeds, and chili oil. Serve immediately and slurp with abandon!"
      ],
      "foodTags": ["pork"],
      "imageName": "tonkotsu-ramen",
      "cuisine": "asian"
    },
    {
      "name": "Duck Confit with Cherry Glaze",
      "isForFamily": false,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 150,
      "description": "Classic French duck legs slowly cooked in their own fat until impossibly tender, finished with crispy skin and a sweet-tart cherry gastrique. Pure elegance.",
      "ingredients": [
        "4 duck legs",
        "2 cups duck fat (or enough to cover)",
        "1 cup fresh or frozen cherries, pitted",
        "1/2 cup red wine",
        "1/4 cup red wine vinegar",
        "3 tbsp honey",
        "4 cloves garlic",
        "4 sprigs fresh thyme",
        "2 bay leaves",
        "2 tbsp kosher salt",
        "1 tbsp black pepper",
        "1 tsp juniper berries, crushed",
        "Orange zest"
      ],
      "steps": [
        "Two days ahead: Mix salt, pepper, and juniper berries. Rub generously all over duck legs. Place in a dish with garlic, thyme, and bay leaves. Cover and refrigerate for 24-48 hours. This cures the meat.",
        "When ready to cook, preheat oven to 225F (107C). Rinse duck legs and pat completely dry. Removing excess cure prevents over-salting.",
        "Arrange duck legs in a single layer in a Dutch oven or deep baking dish. They should fit snugly. Add garlic and herbs from the cure.",
        "Melt duck fat and pour over legsthey should be completely submerged. If not, add more fat or arrange legs so at least the meat is covered.",
        "Cover tightly with foil or a lid. Cook for 3-4 hours until meat is incredibly tender and pulls easily from the bone. The low, slow cooking transforms tough legs into butter.",
        "While duck confits, make the cherry glaze: combine cherries, wine, vinegar, and honey in a saucepan. Simmer for 15-20 minutes until cherries burst and sauce reduces by half.",
        "Strain cherry sauce through a sieve, pressing on solids. Return liquid to pan and simmer until syrupy. Add orange zest. You should have about 1/2 cup glaze.",
        "Remove duck from fat (save the fatit's gold for roasting potatoes!). To serve, heat a cast iron skillet over high heat. Add duck legs skin-side down.",
        "Press down with a spatula and cook for 5-8 minutes until skin is deeply golden and shatteringly crispy. Flip briefly to warm the other side. Drizzle with cherry glaze and serve immediately."
      ],
      "foodTags": ["chicken"],
      "imageName": "duck-confit-cherry",
      "cuisine": "french"
    },
    {
      "name": "Paella Valenciana",
      "isForFamily": true,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 90,
      "description": "The iconic Spanish rice dish made the traditional way with saffron-tinted rice, chicken, seafood, and the prized crispy bottom called socarrat. A feast for all senses.",
      "ingredients": [
        "2 cups bomba or calasparra rice",
        "1 lb chicken thighs, bone-in",
        "1/2 lb large shrimp, shell-on",
        "1/2 lb mussels, scrubbed",
        "1/2 lb calamari, sliced into rings",
        "4 cups chicken broth, warmed",
        "1 large pinch saffron threads",
        "1 can (14 oz) crushed tomatoes",
        "1 onion, grated",
        "4 cloves garlic, minced",
        "1 red bell pepper, sliced",
        "1 cup green beans",
        "1/2 cup olive oil",
        "1 tsp smoked paprika",
        "1 lemon, cut in wedges",
        "Fresh parsley"
      ],
      "steps": [
        "Bloom saffron in warm broth for at least 10 minutes. This releases the flavor and color. Real saffron is expensive but irreplaceabledon't skip it.",
        "Heat olive oil in a 15-inch paella pan over medium-high heat. Season chicken with salt and sear until golden brown, about 4-5 minutes per side. Remove and set aside.",
        "In the same oil, saut green beans and bell pepper for 3-4 minutes. Remove and set aside with chicken.",
        "Reduce heat to medium. Add grated onion and cook until very soft and starting to caramelize, about 8-10 minutes. Add garlic and paprika, cook 1 minute.",
        "Add crushed tomatoes and cook, stirring, until the mixture darkens and oil separates around the edgesabout 5-7 minutes. This is called the sofrito.",
        "Pour in saffron-infused broth and bring to a boil. Taste and season with salt. Add rice, distributing evenlydo not stir after this point!",
        "Nestle chicken pieces and vegetables into the rice. Reduce heat to medium-low. Cook for 15 minutes without stirring, rotating the pan occasionally for even cooking.",
        "Arrange shrimp, mussels, and calamari on top, pressing slightly into the rice. Cover loosely with foil and cook for 10 more minutes until rice is tender and seafood is cooked.",
        "Remove foil and increase heat to medium-high for 2-3 minutes to develop the socarratthe prized crispy bottom. You'll hear it crackle! Let rest 5 minutes. Garnish with parsley and lemon wedges."
      ],
      "foodTags": ["seafood", "chicken"],
      "imageName": "paella-valenciana",
      "cuisine": "mediterranean"
    },
    {
      "name": "Lamb Tagine with Apricots",
      "isForFamily": true,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 150,
      "description": "Tender lamb shoulder braised with warm Moroccan spices, sweet apricots, and honey until falling apart. A celebration of North African cuisine served over fluffy couscous.",
      "ingredients": [
        "3 lb lamb shoulder, cut into 2-inch chunks",
        "1 cup dried apricots",
        "1 large onion, diced",
        "4 cloves garlic, minced",
        "2 inch ginger, grated",
        "2 cups chicken broth",
        "1 can (14 oz) diced tomatoes",
        "3 tbsp honey",
        "2 tbsp olive oil",
        "2 tsp cinnamon",
        "2 tsp cumin",
        "1 tsp coriander",
        "1 tsp turmeric",
        "1/2 tsp cayenne",
        "Couscous for serving",
        "Toasted almonds",
        "Fresh cilantro and mint"
      ],
      "steps": [
        "Pat lamb pieces very dry with paper towelsthis is essential for browning. Season generously with salt, pepper, and half the spices.",
        "Heat olive oil in a large Dutch oven over high heat until almost smoking. Working in batches, sear lamb until deep brown on all sides, about 3-4 minutes per side. Don't crowd the pan. Set browned lamb aside.",
        "Reduce heat to medium. Add onion to the pot with all those flavorful browned bits. Cook for 8-10 minutes until golden and soft, scraping up the fond.",
        "Add garlic, ginger, and remaining spices. Cook for 2 minutes until incredibly fragrantyour kitchen will smell like a Moroccan souk.",
        "Pour in tomatoes and broth, scraping up any remaining bits from the bottom. Return lamb to the pot along with any accumulated juices.",
        "Bring to a boil, then reduce heat to low. Cover and simmer for 1.5 hours, stirring occasionally. The lamb should be starting to become tender.",
        "Add dried apricots and honey. Continue cooking covered for another 30-45 minutes until lamb is fall-apart tender and sauce has thickened.",
        "Meanwhile, prepare couscous according to package directions. Fluff with a fork and stir in a pat of butter if desired.",
        "Taste tagine and adjust seasoningit should be a perfect balance of savory, sweet, and warmly spiced. Serve over couscous, topped with toasted almonds, fresh cilantro, and mint."
      ],
      "foodTags": ["lamb"],
      "imageName": "lamb-tagine-apricots",
      "cuisine": "mediterranean"
    },
    {
      "name": "Seared Scallops with Brown Butter",
      "isForFamily": false,
      "dietTags": ["glutenFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 25,
      "description": "Restaurant-quality seared scallops with a perfect golden crust, finished with nutty brown butter, capers, and lemon. Simple ingredients, flawless technique.",
      "ingredients": [
        "1 lb dry-packed sea scallops (U-10 size)",
        "4 tbsp unsalted butter",
        "2 tbsp vegetable oil",
        "2 tbsp capers, drained",
        "2 tbsp fresh lemon juice",
        "2 tbsp fresh parsley, chopped",
        "2 cloves garlic, thinly sliced",
        "Flaky sea salt",
        "Fresh cracked pepper",
        "Lemon wedges for serving"
      ],
      "steps": [
        "Remove scallops from packaging and pat extremely dry with paper towels. This is the most important stepwet scallops will steam, not sear. Let them sit uncovered in the fridge for 30 minutes if time allows.",
        "Remove the small side muscle from each scallop if presentit's tough and chewy. Season both sides with salt and pepper just before cooking.",
        "Heat a large stainless steel or cast iron skillet over high heat for 2-3 minutes until very hot. Add oilit should shimmer immediately.",
        "Carefully place scallops in the pan, making sure they don't touch. You need space for steam to escape. Work in batches if necessary.",
        "Do not move the scallops! Let them sear undisturbed for 2 minutes until a deep golden crust forms on the bottom. Resist the urge to peek.",
        "Flip scallopsthey should release easily if properly seared. Cook for 1-2 minutes more. The center should still be slightly translucent. Remove to a warm plate.",
        "Reduce heat to medium. Add butter to the same pan. Let it melt and foam, swirling occasionally. Continue cooking until butter turns golden brown and smells nutty, about 2-3 minutes. Watch carefullyit can burn quickly.",
        "Add garlic and capers to the brown butter. Cook for 30 seconds until garlic is fragrant. Remove from heat and add lemon juiceit will sizzle dramatically.",
        "Arrange scallops on plates, spoon brown butter sauce over the top, and garnish with fresh parsley. Finish with flaky sea salt. Serve immediatelyscallops wait for no one!"
      ],
      "foodTags": ["seafood"],
      "imageName": "seared-scallops",
      "cuisine": "french"
    },
    {
      "name": "Peking Duck Pancakes",
      "isForFamily": true,
      "dietTags": ["dairyFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 180,
      "description": "The legendary Chinese dish featuring incredibly crispy lacquered duck skin, tender meat, and homemade Mandarin pancakes with traditional accompaniments.",
      "ingredients": [
        "1 whole duck (5-6 lbs)",
        "1/4 cup maltose or honey",
        "2 tbsp rice vinegar",
        "1 tbsp soy sauce",
        "2 cups flour for pancakes",
        "1 cup boiling water",
        "2 tbsp sesame oil",
        "1 bunch green onions, julienned",
        "1 cucumber, julienned",
        "Hoisin sauce",
        "1 tbsp five-spice powder",
        "1 tbsp salt"
      ],
      "steps": [
        "Day before: Remove any giblets from duck cavity. Bring a large pot of water to boil. Dip duck in boiling water for 30 seconds, turning to coat all areasthis tightens the skin.",
        "Pat duck completely dry. Mix maltose with rice vinegar and soy sauce, heating gently to dissolve. Brush this glaze all over the duck skin.",
        "Season cavity with five-spice powder and salt. Hang duck in a cool, dry place overnight or place on a rack over a sheet pan in the refrigerator uncovered. The skin must dry completely for crispiness.",
        "Make pancake dough: pour boiling water into flour, mixing with chopsticks. When cool enough, knead into a smooth dough. Rest covered for 30 minutes.",
        "Divide dough into 16 pieces. Roll into balls. Brush one side with sesame oil, press two balls together oil-sides touching. Roll into thin 6-inch circles.",
        "Cook pancakes in a dry non-stick skillet over medium heat for 1-2 minutes per side until spotty brown. Immediately separate the two layers. Stack and cover with a towel to keep soft.",
        "Preheat oven to 350F. Place duck breast-side up on a rack over a roasting pan with 1 inch water. Roast for 1.5 hours.",
        "Increase heat to 400F and roast for 30-45 minutes more until skin is deep mahogany and incredibly crispy. Internal temp should reach 165F.",
        "Rest duck 15 minutes. Carve skin separately from meat in thin stripsboth go on the pancakes! Serve with warm pancakes, hoisin sauce, and julienned vegetables. Roll up and enjoy!"
      ],
      "foodTags": ["chicken"],
      "imageName": "peking-duck",
      "cuisine": "asian"
    },
    {
      "name": "Osso Buco with Gremolata",
      "isForFamily": true,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 180,
      "description": "Braised veal shanks cooked low and slow until meltingly tender, served with the traditional bright lemon-parsley-garlic gremolata. Italian comfort food at its finest.",
      "ingredients": [
        "4 veal shanks (osso buco cut, 1.5 inches thick)",
        "1 cup flour for dredging",
        "1 cup dry white wine",
        "1 can (14 oz) crushed tomatoes",
        "2 cups beef broth",
        "1 onion, diced",
        "2 carrots, diced",
        "2 celery stalks, diced",
        "4 cloves garlic, minced",
        "3 tbsp olive oil",
        "2 tbsp tomato paste",
        "2 bay leaves",
        "Fresh thyme sprigs",
        "For gremolata: 1/4 cup parsley, 2 cloves garlic, zest of 1 lemon"
      ],
      "steps": [
        "Pat veal shanks dry and tie kitchen twine around the circumference to help them keep their shape during braising. Season generously with salt and pepper. Dredge lightly in flour, shaking off excess.",
        "Heat olive oil in a large Dutch oven over medium-high heat. Sear shanks until deep golden brown on both sides, about 4-5 minutes per side. Work in batches if needed. Set aside.",
        "Reduce heat to medium. Add onion, carrots, and celery to the pot. Cook for 8-10 minutes until softened and golden, scraping up the delicious fond from the meat.",
        "Add garlic and tomato paste. Cook for 2 minutes, stirring constantly. The tomato paste should darken slightly and coat the vegetables.",
        "Pour in white wine and bring to a boil, scraping up all the browned bits. Let wine reduce by half, about 3-4 minutes.",
        "Add crushed tomatoes, beef broth, bay leaves, and thyme. Return veal shanks to the potthey should be mostly submerged. Bring to a simmer.",
        "Cover and transfer to a 325F oven. Braise for 2.5-3 hours, turning shanks halfway through. The meat should be falling-off-the-bone tender and the sauce rich and glossy.",
        "Make gremolata while shanks braise: finely mince parsley and garlic together. Add lemon zest and a pinch of salt. Mix well. This brightens the rich dish.",
        "Remove twine from shanks. Serve over creamy polenta or risotto Milanese. Spoon sauce generously over the top and finish with a generous sprinkle of gremolata. The marrow inside the bone is a delicacydig in!"
      ],
      "foodTags": ["beef"],
      "imageName": "osso-buco",
      "cuisine": "italian"
    },
    {
      "name": "Chicken Shawarma Plates",
      "isForFamily": true,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 45,
      "description": "Middle Eastern spiced chicken thighs with crispy edges, served with fluffy rice, tangy pickled vegetables, creamy garlic sauce, and warm pita.",
      "ingredients": [
        "2 lbs boneless chicken thighs",
        "1/4 cup olive oil",
        "4 cloves garlic, minced",
        "2 tsp cumin",
        "2 tsp coriander",
        "1 tsp turmeric",
        "1 tsp paprika",
        "1/2 tsp cinnamon",
        "1/4 tsp cayenne",
        "Juice of 1 lemon",
        "Basmati rice",
        "Pickled turnips and cucumbers",
        "Pita bread",
        "For sauce: 1/2 cup tahini, 1/4 cup lemon juice, 2 cloves garlic, water to thin"
      ],
      "steps": [
        "Combine olive oil, garlic, all spices, and lemon juice in a bowl. Add chicken thighs and massage marinade into every surface. Marinate for at least 30 minutes, or overnight for best flavor.",
        "Make tahini sauce: whisk tahini with lemon juice and minced garlic. Add water gradually until you reach a pourable consistency. Season with salt. Set aside.",
        "Cook rice according to package directions. For extra flavor, toast rice in butter before adding water and cook with a cinnamon stick and bay leaf.",
        "Heat a large cast iron skillet over medium-high heat. Remove chicken from marinade, shaking off excess. Lay flat in the hot skillet.",
        "Cook chicken for 6-7 minutes per side until charred and cooked through. The edges should be crispy and caramelized from the spices. Internal temp should reach 165F.",
        "Let chicken rest for 5 minutes, then slice into strips against the grain. The resting ensures juicy meat.",
        "Warm pita bread directly over a gas flame or in the hot skillet. Wrap in a towel to keep soft.",
        "Assemble plates: mound rice on one side, pile sliced chicken alongside. Add pickled vegetables, a generous drizzle of tahini sauce, and warm pita on the side.",
        "Garnish with fresh parsley, a sprinkle of sumac if available, and serve with hot sauce for those who like heat. This is a complete meal in every bite!"
      ],
      "foodTags": ["chicken"],
      "imageName": "chicken-shawarma",
      "cuisine": "mediterranean"
    },
    {
      "name": "Orange Chicken",
      "isForFamily": true,
      "dietTags": ["dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 40,
      "description": "Better than takeout! Crispy fried chicken pieces tossed in a sweet, tangy, and slightly spicy orange glaze. Serve over steamed rice for the ultimate comfort meal.",
      "ingredients": [
        "2 lbs boneless chicken thighs, cut into 1-inch pieces",
        "1 cup cornstarch",
        "2 eggs, beaten",
        "Oil for frying",
        "1 cup orange juice",
        "1/3 cup sugar",
        "3 tbsp soy sauce",
        "2 tbsp rice vinegar",
        "Zest of 2 oranges",
        "3 cloves garlic, minced",
        "1 inch ginger, grated",
        "1 tbsp cornstarch mixed with 2 tbsp water",
        "1/2 tsp red pepper flakes",
        "Green onions and sesame seeds for garnish",
        "Steamed rice for serving"
      ],
      "steps": [
        "Cut chicken into bite-sized pieces and pat dry. Season with salt and pepper. Dip each piece in beaten egg, then coat thoroughly in cornstarch. Shake off excess.",
        "Heat 2 inches of oil in a large pot or wok to 350F. Fry chicken in batches for 4-5 minutes until golden brown and cooked through. Don't overcrowdthis lowers the oil temperature and makes soggy chicken.",
        "Transfer fried chicken to a wire rack set over a sheet pan. Keep warm in a 200F oven while frying remaining batches.",
        "Make the sauce: combine orange juice, sugar, soy sauce, rice vinegar, and orange zest in a medium saucepan. Bring to a boil over medium-high heat.",
        "Add garlic, ginger, and red pepper flakes. Simmer for 3-4 minutes until slightly reduced and fragrant.",
        "Give the cornstarch slurry a stir and add it to the sauce. Cook, stirring constantly, until sauce thickens and becomes glossy, about 1-2 minutes.",
        "Add fried chicken to the sauce and toss to coat every piece evenly. The sauce should cling to the crispy chicken.",
        "Work quickly to servethe chicken is best when freshly tossed while still crispy. Transfer to a serving plate.",
        "Garnish with sliced green onions and sesame seeds. Serve immediately over steamed white rice. Extra sauce on the side is always welcome!"
      ],
      "foodTags": ["chicken"],
      "imageName": "orange-chicken",
      "cuisine": "asian"
    },
    {
      "name": "Jerk Chicken with Rice and Peas",
      "isForFamily": true,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 60,
      "description": "Authentic Caribbean jerk chicken with bold spices and scotch bonnet heat, served alongside coconut rice and kidney beans. A taste of the islands at home.",
      "ingredients": [
        "8 chicken drumsticks and thighs",
        "6 green onions",
        "4 cloves garlic",
        "2 scotch bonnet peppers (remove seeds for less heat)",
        "3 tbsp soy sauce",
        "2 tbsp olive oil",
        "2 tbsp brown sugar",
        "1 tbsp allspice",
        "1 tbsp thyme leaves",
        "1 tsp cinnamon",
        "Juice of 2 limes",
        "For rice: 1.5 cups rice, 1 can coconut milk, 1 can kidney beans, 2 cups water, 2 sprigs thyme"
      ],
      "steps": [
        "Make jerk marinade: blend green onions, garlic, scotch bonnets, soy sauce, oil, brown sugar, allspice, thyme, cinnamon, and lime juice until smooth. Be careful with the peppersthey're very hot!",
        "Score chicken pieces deeply with a knife to allow marinade to penetrate. Place in a large dish and coat thoroughly with jerk marinade. Cover and refrigerate for at least 4 hours, preferably overnight.",
        "Make coconut rice: rinse rice until water runs clear. Drain kidney beans, reserving liquid. In a pot, combine rice, coconut milk, 1 cup water, and 1/2 cup bean liquid.",
        "Add kidney beans and thyme sprigs to the rice. Bring to a boil, then reduce heat to low. Cover tightly and cook for 18-20 minutes until liquid is absorbed. Let rest covered for 5 minutes.",
        "Preheat grill to medium-high (or preheat oven to 400F). Remove chicken from marinade, letting excess drip off but keeping the coating.",
        "Grill chicken for 8-10 minutes per side, turning occasionally, until charred and cooked through. Internal temp should reach 165F. If using oven, roast for 40-45 minutes.",
        "For extra authentic flavor, brush chicken with additional marinade during the last few minutes of cooking. The sugars will caramelize beautifully.",
        "Fluff rice with a fork and remove thyme sprigs. The coconut and kidney beans should be distributed throughout.",
        "Serve jerk chicken hot alongside coconut rice and peas. Garnish with lime wedges and extra scotch bonnet for the brave. Pair with cold Red Stripe beer!"
      ],
      "foodTags": ["chicken"],
      "imageName": "jerk-chicken",
      "cuisine": "american"
    },
    {
      "name": "Chicken Marsala",
      "isForFamily": false,
      "dietTags": ["none"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 35,
      "description": "Tender chicken cutlets in a rich Marsala wine and mushroom sauce, finished with butter and fresh herbs. Italian-American comfort food at its best.",
      "ingredients": [
        "4 chicken breasts, pounded thin",
        "8 oz cremini mushrooms, sliced",
        "1 cup Marsala wine",
        "1/2 cup chicken broth",
        "1/2 cup flour",
        "4 tbsp butter, divided",
        "2 tbsp olive oil",
        "3 cloves garlic, minced",
        "2 shallots, minced",
        "2 tbsp fresh parsley, chopped",
        "Salt and pepper",
        "Fresh thyme leaves"
      ],
      "steps": [
        "Place chicken breasts between plastic wrap and pound to 1/2-inch thickness with a meat mallet or rolling pin. Even thickness ensures even cooking. Season both sides with salt and pepper.",
        "Dredge chicken in flour, shaking off excess. The thin coating creates a nice crust and helps thicken the sauce.",
        "Heat olive oil and 1 tablespoon butter in a large skillet over medium-high heat. Add chicken and cook 3-4 minutes per side until golden brown and cooked through. Remove to a plate.",
        "Add another tablespoon of butter to the pan. Add mushrooms in a single layer and cook without stirring for 3-4 minutes until golden on one side. Stir and cook another 2 minutes.",
        "Add shallots and garlic to the mushrooms. Cook for 1-2 minutes until fragrant and shallots are softened.",
        "Pour in Marsala wine and chicken broth. Use a wooden spoon to scrape up all the delicious browned bits from the bottom of the pan. This is where the flavor lives!",
        "Bring to a boil and let sauce reduce by half, about 5-6 minutes. It should coat the back of a spoon.",
        "Reduce heat to low. Swirl in remaining 2 tablespoons cold butter until melted and sauce is glossy. This is called mounting with butter and creates a silky finish.",
        "Return chicken to the pan, spooning sauce over the top. Sprinkle with fresh parsley and thyme. Serve immediately over pasta, mashed potatoes, or with crusty bread to soak up every drop!"
      ],
      "foodTags": ["chicken"],
      "imageName": "chicken-marsala",
      "cuisine": "italian"
    },
    {
      "name": "Pan-Seared Halibut with Herb Sauce",
      "isForFamily": false,
      "dietTags": ["glutenFree"],
      "chefLevels": ["executiveChef"],
      "cookTimeMinutes": 30,
      "description": "Pristine halibut fillets with a golden crust, served with a vibrant green herb sauce and seasonal vegetables. Fine dining elegance made achievable at home.",
      "ingredients": [
        "4 halibut fillets (6 oz each)",
        "1 cup fresh herbs (parsley, chives, tarragon, basil)",
        "1/2 cup olive oil",
        "2 tbsp capers",
        "2 tbsp lemon juice",
        "1 shallot, minced",
        "1 clove garlic",
        "2 tbsp vegetable oil",
        "2 tbsp butter",
        "Flaky sea salt",
        "Fresh cracked pepper",
        "Lemon wedges for serving"
      ],
      "steps": [
        "Remove halibut from refrigerator 20 minutes before cooking. Pat fillets completely dry with paper towels and season generously with salt and pepper on both sides.",
        "Make herb sauce: blend fresh herbs, olive oil, capers, lemon juice, shallot, and garlic until smooth but still slightly textured. Season with salt to taste. Set aside at room temperature.",
        "Heat a large stainless steel or cast iron skillet over high heat for 2-3 minutes. Add vegetable oilit should shimmer immediately.",
        "Carefully place halibut fillets in the pan, presentation side (skinless side) down. Press gently with a spatula to ensure full contact with the pan.",
        "Cook undisturbed for 4-5 minutes until a deep golden crust forms. Don't move the fishtrust the process. The fish will release when ready.",
        "Reduce heat to medium. Add butter to the pan. When foaming, flip fillets carefully. Baste with the butter using a spoon.",
        "Continue cooking for 3-4 more minutes, basting occasionally. The fish is done when it flakes easily and reaches 130F internally. It will carry over to 140F while resting.",
        "Remove fish to warm plates. The crust should be gorgeous and golden, the interior perfectly opaque and moist.",
        "Spoon herb sauce generously around (not over) the fish to preserve the crispy crust. Add a wedge of lemon and a pinch of flaky sea salt. Serve immediately."
      ],
      "foodTags": ["seafood"],
      "imageName": "pan-seared-halibut",
      "cuisine": "french"
    },
    {
      "name": "Shrimp Scampi Linguine",
      "isForFamily": false,
      "dietTags": ["none"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 25,
      "description": "Succulent shrimp sauted in garlic butter and white wine, tossed with linguine and fresh parsley. A timeless Italian-American classic ready in under 30 minutes.",
      "ingredients": [
        "1 lb large shrimp, peeled and deveined",
        "12 oz linguine",
        "6 cloves garlic, thinly sliced",
        "1/2 cup dry white wine",
        "1/4 cup fresh lemon juice",
        "6 tbsp butter, divided",
        "3 tbsp olive oil",
        "1/4 tsp red pepper flakes",
        "1/2 cup fresh parsley, chopped",
        "Zest of 1 lemon",
        "Salt and pepper",
        "Grated Parmesan for serving"
      ],
      "steps": [
        "Bring a large pot of well-salted water to boil. Cook linguine according to package directions until al dente. Reserve 1 cup pasta water before draining.",
        "While pasta cooks, pat shrimp completely dry and season with salt and pepper. Dry shrimp = better sear.",
        "Heat olive oil and 2 tablespoons butter in a large skillet over medium-high heat. Add shrimp in a single layer and cook 1-2 minutes per side until pink. Remove to a platedon't overcook!",
        "Reduce heat to medium. Add remaining butter and sliced garlic to the pan. Cook for 1-2 minutes until garlic is golden and fragrant. Don't let it burn!",
        "Add red pepper flakes, then pour in white wine and lemon juice. Let it simmer and reduce by half, about 2-3 minutes. Scrape up any browned bits.",
        "Add drained pasta directly to the skillet. Toss to coat in the sauce, adding pasta water a splash at a time if needed for silkiness.",
        "Return shrimp to the pan along with any accumulated juices. Toss everything together and cook for 1 minute to warm the shrimp through.",
        "Remove from heat. Add parsley and lemon zest, tossing to distribute. Taste and adjust seasoning with salt.",
        "Serve immediately in warm bowls with extra parsley on top and grated Parmesan on the side. Crusty bread is essential for the sauce!"
      ],
      "foodTags": ["seafood"],
      "imageName": "shrimp-scampi",
      "cuisine": "italian"
    },
    {
      "name": "Blackened Mahi Mahi Tacos",
      "isForFamily": true,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 30,
      "description": "Flaky mahi mahi coated in Cajun spices and seared to perfection, served in warm tortillas with mango salsa and chipotle crema. California meets Louisiana.",
      "ingredients": [
        "1.5 lb mahi mahi fillets",
        "2 tbsp paprika",
        "1 tbsp garlic powder",
        "1 tbsp onion powder",
        "1 tsp cayenne pepper",
        "1 tsp thyme",
        "1 tsp oregano",
        "8 corn tortillas",
        "2 cups shredded cabbage",
        "1 mango, diced",
        "1/2 red onion, diced",
        "1 jalapeo, minced",
        "1/4 cup cilantro, chopped",
        "2 limes",
        "3 tbsp vegetable oil"
      ],
      "steps": [
        "Make blackening spice: combine paprika, garlic powder, onion powder, cayenne, thyme, and oregano. This makes more than you needsave extra for future cooking.",
        "Make mango salsa: combine diced mango, red onion, jalapeo, half the cilantro, juice of 1 lime, and a pinch of salt. Let flavors meld while you cook the fish.",
        "Cut mahi mahi into portions that will fit in tortillas. Pat completely dry and brush both sides with 1 tablespoon oil. Coat generously with blackening spice, pressing to adhere.",
        "Heat a cast iron skillet over high heat until smokingthis is essential for proper blackening. Add remaining oil.",
        "Carefully place fish in the screaming hot pan. Cook for 3-4 minutes until a dark, flavorful crust forms. Flip and cook another 2-3 minutes until fish flakes easily.",
        "Remove fish and let rest for 2 minutes. Turn on your vent hoodblackening creates smoke! That's the flavor.",
        "Warm tortillas directly over gas flame or in the hot cast iron until slightly charred and pliable. Stack and wrap in a towel.",
        "Flake the blackened fish into large chunks. You want texture, not shredded mush.",
        "Build tacos: tortilla, cabbage, generous portion of fish, mango salsa, remaining cilantro, and a squeeze of lime. Serve immediately with lime wedges on the side!"
      ],
      "foodTags": ["seafood"],
      "imageName": "blackened-mahi-tacos",
      "cuisine": "mexican"
    },
    {
      "name": "Coconut Curry Mussels",
      "isForFamily": false,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 25,
      "description": "Plump mussels steamed in a fragrant Thai-inspired coconut curry broth with lemongrass, ginger, and lime. Serve with crusty bread to soak up every drop.",
      "ingredients": [
        "2 lbs fresh mussels, cleaned and debearded",
        "1 can (14 oz) coconut milk",
        "1 cup fish or vegetable broth",
        "2 stalks lemongrass, bruised",
        "2 inch ginger, sliced",
        "4 cloves garlic, smashed",
        "2 tbsp red curry paste",
        "2 tbsp fish sauce",
        "1 tbsp brown sugar",
        "2 Thai chilies, sliced",
        "Juice of 2 limes",
        "Fresh cilantro and Thai basil",
        "Crusty bread for serving"
      ],
      "steps": [
        "Clean mussels: scrub under cold water, remove beards (the stringy bits), and discard any that are cracked or don't close when tapped. Keep cold until ready to cook.",
        "Make the curry base: heat a large pot or Dutch oven over medium heat. Add 2 tablespoons of the thick cream from the top of the coconut milk and the curry paste. Fry for 1-2 minutes until fragrant.",
        "Add garlic, ginger, and lemongrass. Saut for another minute until very aromatic. Your kitchen should smell incredible.",
        "Pour in remaining coconut milk and broth. Add fish sauce and brown sugar. Bring to a simmer and let flavors meld for 5 minutes.",
        "Increase heat to high. Add mussels all at once and cover immediately. Steam for 4-5 minutes, shaking the pot occasionally, until mussels open.",
        "Use a slotted spoon to transfer opened mussels to serving bowls. Discard any that haven't openedthey're not safe to eat.",
        "Add Thai chilies and lime juice to the broth. Taste and adjust seasoningit should be a balance of salty, sweet, sour, and spicy.",
        "Pour the hot coconut broth over the mussels in the bowls. The broth is the starmake sure there's plenty!",
        "Garnish generously with fresh cilantro and Thai basil. Serve immediately with plenty of crusty bread for dunking. This is a hands-on, napkin-required kind of meal!"
      ],
      "foodTags": ["seafood"],
      "imageName": "coconut-curry-mussels",
      "cuisine": "asian"
    },
    {
      "name": "Mongolian Beef",
      "isForFamily": true,
      "dietTags": ["dairyFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 25,
      "description": "Tender slices of beef stir-fried until caramelized and tossed in a sweet-savory sauce with green onions. A takeout favorite made even better at home.",
      "ingredients": [
        "1.5 lb flank steak, sliced thin against the grain",
        "1/2 cup soy sauce",
        "1/2 cup brown sugar",
        "1/2 cup water",
        "1/4 cup cornstarch for coating",
        "2 tbsp cornstarch mixed with 2 tbsp water",
        "3 tbsp vegetable oil",
        "4 cloves garlic, minced",
        "1 inch ginger, minced",
        "1 bunch green onions, cut into 2-inch pieces",
        "1/2 tsp red pepper flakes",
        "Steamed rice for serving",
        "Sesame seeds for garnish"
      ],
      "steps": [
        "Slice flank steak very thin against the grainpartially freezing the meat for 20 minutes makes this easier. Thin slices = tender beef.",
        "Toss beef slices in cornstarch until evenly coated. Shake off excess. This creates a crispy exterior that grips the sauce.",
        "Make the sauce: whisk together soy sauce, brown sugar, and water until sugar dissolves. Set aside.",
        "Heat oil in a large wok or skillet over high heat until smoking. Working in batches, add beef in a single layer and let it sear undisturbed for 1 minute.",
        "Stir-fry beef for another 1-2 minutes until browned and crispy on edges. Remove to a plate. Repeat with remaining beef.",
        "In the same wok, add garlic, ginger, and red pepper flakes. Stir-fry for 30 seconds until fragrant.",
        "Pour in the sauce and bring to a boil. Add the cornstarch slurry and stir until sauce thickens and becomes glossy, about 1 minute.",
        "Return all the beef to the wok. Add green onions and toss everything together for 1 minute until beef is coated and green onions are just wilted but still bright.",
        "Serve immediately over steamed rice, garnished with sesame seeds and extra green onion tops. The sauce should be sticky and cling to every piece!"
      ],
      "foodTags": ["beef"],
      "imageName": "mongolian-beef",
      "cuisine": "asian"
    },
    {
      "name": "Cuban Mojo Pork",
      "isForFamily": true,
      "dietTags": ["glutenFree", "dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 180,
      "description": "Tender slow-roasted pork shoulder marinated in a bright citrus and garlic mojo sauce. The ultimate Cuban centerpiece, perfect for sandwiches or served with black beans and rice.",
      "ingredients": [
        "4 lb pork shoulder (bone-in preferred)",
        "1 cup fresh orange juice",
        "1/2 cup fresh lime juice",
        "1/2 cup olive oil",
        "12 cloves garlic, minced",
        "2 tbsp dried oregano",
        "2 tsp cumin",
        "1 tbsp salt",
        "1 tsp black pepper",
        "1 onion, sliced",
        "Fresh cilantro",
        "Lime wedges for serving",
        "Black beans and rice for serving"
      ],
      "steps": [
        "Make mojo: blend orange juice, lime juice, olive oil, garlic, oregano, and cumin until combined but still slightly chunky. This Cuban citrus-garlic marinade is the heart of the dish.",
        "Score the pork shoulder deeply all over in a crosshatch patternthis allows the marinade to penetrate. Season generously with salt and pepper, pressing into the cuts.",
        "Place pork in a large dish or resealable bag. Pour mojo over and around the meat, making sure it gets into all the cuts. Refrigerate for at least 4 hours, or overnight for best results.",
        "Preheat oven to 325F. Remove pork from marinade, reserving liquid. Place pork fat-side up in a Dutch oven or roasting pan. Scatter sliced onions around it.",
        "Pour reserved marinade over and around the pork. Cover tightly with foil or lid.",
        "Roast for 3-3.5 hours until pork is fall-apart tender and reaches 195F internally. Remove cover for the last 30 minutes to crisp the top.",
        "Let pork rest for 15-20 minutes. The juices will redistribute, making it even more succulent.",
        "Shred or slice the pork. Strain the cooking liquid and spoon it generously over the meatthis is liquid gold!",
        "Serve with traditional Cuban sides: black beans, white rice, and fried sweet plantains. Garnish with fresh cilantro and lime wedges. Buen provecho!"
      ],
      "foodTags": ["pork"],
      "imageName": "cuban-mojo-pork",
      "cuisine": "american"
    },
    {
      "name": "Philly Cheesesteak Bowls",
      "isForFamily": true,
      "dietTags": ["glutenFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 25,
      "description": "All the flavors of a classic Philly cheesesteakthinly sliced beef, caramelized onions, peppers, and melty cheeseserved over rice for a satisfying bowl meal.",
      "ingredients": [
        "1.5 lb ribeye or sirloin, very thinly sliced",
        "2 cups cooked rice",
        "1 large onion, thinly sliced",
        "1 green bell pepper, thinly sliced",
        "8 oz provolone cheese, sliced",
        "3 tbsp vegetable oil",
        "2 cloves garlic, minced",
        "1 tbsp Worcestershire sauce",
        "Salt and pepper",
        "Hot cherry peppers for serving",
        "Mayonnaise (optional)"
      ],
      "steps": [
        "Partially freeze the beef for 20-30 minutesthis makes it much easier to slice paper-thin. Slice against the grain as thin as possible.",
        "Heat 1 tablespoon oil in a large skillet over medium heat. Add onions and cook for 10-12 minutes until deeply caramelized and golden. Add peppers and cook another 5 minutes until softened. Remove and set aside.",
        "Season sliced beef with salt, pepper, and Worcestershire sauce. Toss to coat evenly.",
        "Increase heat to high and add remaining oil to the skillet. Add beef in batches, spreading in a thin layer. Let it sear for 30 seconds before stirring.",
        "Add garlic and continue stir-frying for 1-2 minutes until beef is just cooked through. Don't overcookit should still be juicy!",
        "Return onions and peppers to the skillet with the beef. Toss everything together.",
        "Lay provolone slices over the top of the beef mixture. Cover the pan and turn off heat. Let sit for 1-2 minutes until cheese is melted and gooey.",
        "Divide rice among bowls. Top with the cheesy beef and vegetable mixture, making sure to get all that melted cheese.",
        "Serve with hot cherry peppers on the side and a drizzle of mayo if you're a 'wit' person. This has all the cheesesteak magic without the bread!"
      ],
      "foodTags": ["beef"],
      "imageName": "philly-cheesesteak-bowl",
      "cuisine": "american"
    },
    {
      "name": "Japanese Pork Katsu Curry",
      "isForFamily": true,
      "dietTags": ["dairyFree"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 50,
      "description": "Crispy panko-crusted pork cutlets served over rice and smothered in rich Japanese curry sauce. The ultimate comfort food from Japan.",
      "ingredients": [
        "4 boneless pork chops (1/2 inch thick)",
        "1 cup flour",
        "2 eggs, beaten",
        "2 cups panko breadcrumbs",
        "1 onion, sliced",
        "2 carrots, cubed",
        "2 potatoes, cubed",
        "4 cups chicken broth",
        "3 tbsp curry roux blocks (Japanese curry)",
        "1 tbsp soy sauce",
        "1 tbsp honey",
        "Oil for frying",
        "Steamed rice",
        "Pickled ginger for serving"
      ],
      "steps": [
        "Make curry: saut sliced onion in a pot over medium heat for 8-10 minutes until golden. Add carrots and potatoes, cook 2 minutes more.",
        "Pour in chicken broth and bring to a boil. Reduce heat and simmer for 20 minutes until vegetables are tender.",
        "Turn off heat and add curry roux blocks, stirring until completely dissolved. Add soy sauce and honey. Simmer on low for 5 more minutes until thick. Keep warm.",
        "Prepare pork: pound chops to 1/4-inch thickness for even cooking and tenderness. Season with salt and pepper.",
        "Set up breading station: flour in one dish, beaten eggs in another, panko in a third. Dredge each cutlet in flour, then egg, then panko, pressing firmly to adhere.",
        "Heat 1/2 inch oil in a large skillet to 350F. Fry cutlets one or two at a time for 3-4 minutes per side until deep golden and cooked through (145F internal).",
        "Drain katsu on a wire rack for 2 minutes. Slice into strips against the grainthis is traditional presentation.",
        "Build bowls: mound rice on one side, pour curry sauce on the other. Lay sliced katsu on top, half on rice, half in curry.",
        "Serve with pickled ginger and extra curry sauce on the side. The contrast of crispy katsu and rich curry is pure magic!"
      ],
      "foodTags": ["pork"],
      "imageName": "pork-katsu-curry",
      "cuisine": "asian"
    },
    {
      "name": "Spinach and Ricotta Stuffed Shells",
      "isForFamily": true,
      "dietTags": ["vegetarian"],
      "chefLevels": ["sousChef"],
      "cookTimeMinutes": 55,
      "description": "Jumbo pasta shells stuffed with a creamy spinach and ricotta filling, baked in marinara sauce and topped with bubbling mozzarella. Italian comfort food perfection.",
      "ingredients": [
        "24 jumbo pasta shells",
        "2 cups ricotta cheese",
        "10 oz frozen spinach, thawed and squeezed dry",
        "1 cup shredded mozzarella, divided",
        "1/2 cup grated Parmesan",
        "1 egg",
        "3 cloves garlic, minced",
        "1/4 tsp nutmeg",
        "3 cups marinara sauce",
        "Fresh basil for garnish",
        "Salt and pepper"
      ],
      "steps": [
        "Preheat oven to 375F. Cook pasta shells according to package directions until just al denteabout 1 minute less than recommended. Drain and lay flat on a sheet pan to prevent sticking.",
        "Squeeze thawed spinach very dry in a clean kitchen towel. Any excess water will make the filling soggy. You want it as dry as possible.",
        "Make filling: combine ricotta, squeezed spinach, 1/2 cup mozzarella, Parmesan, egg, garlic, and nutmeg. Season generously with salt and pepper. Mix until well combined.",
        "Spread 1 cup marinara sauce evenly on the bottom of a 9x13 baking dish. This prevents shells from sticking and adds flavor.",
        "Fill each shell with about 2 tablespoons of the ricotta mixture. Don't overstuffyou want them to close slightly. Nestle filled shells in the dish, seam-side up.",
        "Spoon remaining marinara sauce over and around the shells. Make sure each one gets some sauce to prevent drying out.",
        "Cover dish tightly with foil. Bake for 25 minutes. The shells should be heated through and sauce bubbling.",
        "Remove foil and sprinkle remaining mozzarella over the top. Return to oven uncovered for 10-15 minutes until cheese is melted and golden.",
        "Let rest for 5 minutes before serving. Garnish with fresh basil and extra Parmesan. Serve 4-6 shells per person with crusty bread on the side!"
      ],
      "foodTags": ["vegetarian"],
      "imageName": "stuffed-shells",
      "cuisine": "italian"
    },
    {
      "name": "Crispy Sesame Tofu Bowls",
      "isForFamily": false,
      "dietTags": ["vegan", "dairyFree"],
      "chefLevels": ["lineCook"],
      "cookTimeMinutes": 35,
      "description": "Crispy pan-fried tofu glazed with a sweet and savory sesame sauce, served over fluffy rice with steamed edamame and pickled vegetables. A satisfying plant-based meal.",
      "ingredients": [
        "1 block (14 oz) extra-firm tofu, pressed and cubed",
        "3 tbsp cornstarch",
        "3 tbsp vegetable oil",
        "2 cups jasmine rice, cooked",
        "1 cup shelled edamame, steamed",
        "1 cup shredded purple cabbage",
        "1 Persian cucumber, sliced",
        "2 tbsp rice vinegar",
        "1 tsp sugar",
        "2 tbsp sesame seeds",
        "2 green onions, sliced",
        "3 tbsp soy sauce",
        "2 tbsp honey (or maple syrup for vegan)",
        "1 tbsp sesame oil",
        "2 cloves garlic, minced",
        "1 tsp fresh ginger, grated"
      ],
      "steps": [
        "Press tofu for 15 minutes to remove excess waterplace between paper towels with a heavy pan on top. Cut into 1-inch cubes.",
        "Toss tofu cubes with cornstarch until evenly coated. Shake off excess. The cornstarch creates an extra crispy exterior.",
        "Make the sauce: whisk together soy sauce, honey, sesame oil, rice vinegar, garlic, and ginger. Set aside.",
        "Toss cucumber and cabbage with rice vinegar and sugar for a quick pickle. Let sit while cooking tofu.",
        "Heat vegetable oil in a large non-stick skillet over medium-high heat. Add tofu in a single layerdon't crowd the pan.",
        "Cook tofu 3-4 minutes per side until golden and crispy on all sides. Resist the urge to move it aroundlet it develop a crust.",
        "Reduce heat to medium. Pour sauce over tofu and toss to coat. Cook 1-2 minutes until sauce thickens and glazes the tofu.",
        "Divide rice among bowls. Top with glazed tofu, edamame, and pickled vegetables. Arrange everything in sections for visual appeal.",
        "Garnish with sesame seeds and sliced green onions. Serve immediately while tofu is still crispy. Drizzle any extra sauce from the pan over the top!"
      ],
      "foodTags": ["vegetarian"],
      "imageName": "sesame-tofu-bowl",
      "cuisine": "asian"
    }
  ]
}